; ModuleID = '/tmp/tmp.ll'
source_filename = "c/admesh-0.95.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.__anonstruct_stl_file_31 = type { %struct._IO_FILE*, %struct.__anonstruct_stl_facet_25*, %struct.__anonstruct_stl_edge_27*, %struct.stl_hash_edge**, %struct.stl_hash_edge*, i32, %struct.__anonstruct_stl_neighbors_28*, %struct.__anonstruct_v_indices_struct_29*, %struct.__anonstruct_stl_vertex_23*, %struct.__anonstruct_stl_stats_30 }
%struct.__anonstruct_stl_facet_25 = type { %struct.__anonstruct_stl_normal_24, [3 x %struct.__anonstruct_stl_vertex_23], [2 x i8] }
%struct.__anonstruct_stl_normal_24 = type { float, float, float }
%struct.__anonstruct_stl_vertex_23 = type { float, float, float }
%struct.__anonstruct_stl_edge_27 = type { %struct.__anonstruct_stl_vertex_23, %struct.__anonstruct_stl_vertex_23, i32 }
%struct.stl_hash_edge = type { [6 x i32], i32, i32, %struct.stl_hash_edge* }
%struct.__anonstruct_stl_neighbors_28 = type { [3 x i32], [3 x i8] }
%struct.__anonstruct_v_indices_struct_29 = type { [3 x i32] }

!0 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"PIC Level", i32 2}
!5 = distinct !DICompileUnit(language: DW_LANG_C99, file: !6, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !14, nameTableKind: GNU)
!6 = !DIFile(filename: "c/admesh-0.95.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!7 = !{!8}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__anonenum_stl_type_26", file: !9, line: 58, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "/home/wslee/benchmarks/admesh-0.95/stl.h", directory: "")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13}
!12 = !DIEnumerator(name: "binary", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "ascii", value: 1, isUnsigned: true)
!14 = !{!15, !16, !18, !19, !21, !23, !25, !34, !35, !37, !43, !17, !20, !44, !10, !102, !110, !117, !119, !120, !132, !150, !76, !157}
!15 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !28, line: 77, size: 256, elements: !29)
!28 = !DIFile(filename: "./getopt.h", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!29 = !{!30, !31, !32, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !27, file: !28, line: 78, baseType: !21, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !27, file: !28, line: 79, baseType: !20, size: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !27, file: !28, line: 80, baseType: !19, size: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !27, file: !28, line: 81, baseType: !20, size: 32, offset: 192)
!34 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !36, line: 211, baseType: !10)
!36 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stl_normal", file: !39, line: 99, size: 128, elements: !40)
!39 = !DIFile(filename: "/home/wslee/benchmarks/admesh-0.95/normals.c", directory: "")
!40 = !{!41, !42}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "facet_num", scope: !38, file: !39, line: 100, baseType: !20, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !38, file: !39, line: 101, baseType: !37, size: 64, offset: 64)
!43 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !46, line: 49, baseType: !47)
!46 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 271, size: 1728, elements: !49)
!48 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !70, !71, !72, !73, !77, !79, !81, !85, !88, !92, !93, !94, !95, !96, !97, !98}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 272, baseType: !20, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 273, baseType: !16, size: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 274, baseType: !16, size: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 275, baseType: !16, size: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 276, baseType: !16, size: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 277, baseType: !16, size: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 278, baseType: !16, size: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 279, baseType: !16, size: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 280, baseType: !16, size: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 281, baseType: !16, size: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 282, baseType: !16, size: 64, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 283, baseType: !16, size: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 284, baseType: !63, size: 64, offset: 768)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 186, size: 192, elements: !65)
!65 = !{!66, !67, !69}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !64, file: !48, line: 187, baseType: !63, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !64, file: !48, line: 188, baseType: !68, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !64, file: !48, line: 189, baseType: !20, size: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 285, baseType: !68, size: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 286, baseType: !20, size: 32, offset: 896)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 287, baseType: !20, size: 32, offset: 928)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 288, baseType: !74, size: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !75, line: 141, baseType: !76)
!75 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!76 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 289, baseType: !78, size: 16, offset: 1024)
!78 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 290, baseType: !80, size: 8, offset: 1040)
!80 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 291, baseType: !82, size: 8, offset: 1048)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 1)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 292, baseType: !86, size: 64, offset: 1088)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 180, baseType: null)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 293, baseType: !89, size: 64, offset: 1152)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !75, line: 142, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !75, line: 56, baseType: !91)
!91 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !47, file: !48, line: 294, baseType: !18, size: 64, offset: 1216)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !47, file: !48, line: 295, baseType: !18, size: 64, offset: 1280)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !47, file: !48, line: 296, baseType: !18, size: 64, offset: 1344)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !47, file: !48, line: 297, baseType: !18, size: 64, offset: 1408)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 298, baseType: !35, size: 32, offset: 1472)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 299, baseType: !20, size: 32, offset: 1504)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 300, baseType: !99, size: 192, offset: 1536)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 192, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 24)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "v_indices_struct", file: !9, line: 81, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_v_indices_struct_29", file: !9, line: 81, size: 96, elements: !105)
!105 = !{!106}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "vertex", scope: !104, file: !9, line: 82, baseType: !107, size: 96)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 96, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 3)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "stl_vertex", file: !9, line: 34, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_stl_vertex_23", file: !9, line: 34, size: 96, elements: !113)
!113 = !{!114, !115, !116}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !112, file: !9, line: 35, baseType: !15, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !112, file: !9, line: 36, baseType: !15, size: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !112, file: !9, line: 37, baseType: !15, size: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "stl_hash_edge", file: !9, line: 67, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stl_hash_edge", file: !9, line: 67, size: 320, elements: !123)
!123 = !{!124, !128, !129, !130}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !122, file: !9, line: 68, baseType: !125, size: 192)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 192, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 6)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "facet_number", scope: !122, file: !9, line: 69, baseType: !20, size: 32, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "which_edge", scope: !122, file: !9, line: 70, baseType: !20, size: 32, offset: 224)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !122, file: !9, line: 71, baseType: !131, size: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "stl_facet", file: !9, line: 50, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_stl_facet_25", file: !9, line: 50, size: 416, elements: !135)
!135 = !{!136, !143, !145}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !134, file: !9, line: 51, baseType: !137, size: 96)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "stl_normal", file: !9, line: 41, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_stl_normal_24", file: !9, line: 41, size: 96, elements: !139)
!139 = !{!140, !141, !142}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !138, file: !9, line: 42, baseType: !15, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !138, file: !9, line: 43, baseType: !15, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !138, file: !9, line: 44, baseType: !15, size: 32, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "vertex", scope: !134, file: !9, line: 52, baseType: !144, size: 288, offset: 96)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 288, elements: !108)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !134, file: !9, line: 53, baseType: !146, size: 16, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "stl_extra", file: !9, line: 48, baseType: !147)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 16, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 2)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "stl_neighbors", file: !9, line: 75, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_stl_neighbors_28", file: !9, line: 75, size: 128, elements: !153)
!153 = !{!154, !155}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "neighbor", scope: !152, file: !9, line: 76, baseType: !107, size: 96)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "which_vertex_not", scope: !152, file: !9, line: 77, baseType: !156, size: 24, offset: 96)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, elements: !108)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "stl_type", file: !9, line: 58, baseType: !8)
!158 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!159 = distinct !DISubprogram(name: "main", scope: !160, file: !160, line: 30, type: !161, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, retainedNodes: !164)
!160 = !DIFile(filename: "/home/wslee/benchmarks/admesh-0.95/admesh.c", directory: "")
!161 = !DISubroutineType(types: !162)
!162 = !{null, !20, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!164 = !{}
!165 = !DILocalVariable(name: "argc", arg: 1, scope: !159, file: !160, line: 30, type: !20)
!166 = !DILocation(line: 0, scope: !159)
!167 = !DILocalVariable(name: "argv", arg: 2, scope: !159, file: !160, line: 30, type: !163)
!168 = !DILocalVariable(name: "stl_in", scope: !159, file: !160, line: 32, type: !169)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "stl_file", file: !9, line: 122, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_stl_file_31", file: !9, line: 122, size: 2432, elements: !171)
!171 = !{!172, !173, !174, !182, !183, !184, !185, !186, !187, !188}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !170, file: !9, line: 123, baseType: !44, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "facet_start", scope: !170, file: !9, line: 124, baseType: !132, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "edge_start", scope: !170, file: !9, line: 125, baseType: !175, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "stl_edge", file: !9, line: 60, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_stl_edge_27", file: !9, line: 60, size: 224, elements: !178)
!178 = !{!179, !180, !181}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !177, file: !9, line: 61, baseType: !111, size: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "p2", scope: !177, file: !9, line: 62, baseType: !111, size: 96, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "facet_number", scope: !177, file: !9, line: 63, baseType: !20, size: 32, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !170, file: !9, line: 126, baseType: !119, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !170, file: !9, line: 127, baseType: !120, size: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !170, file: !9, line: 128, baseType: !20, size: 32, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "neighbors_start", scope: !170, file: !9, line: 129, baseType: !150, size: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "v_indices", scope: !170, file: !9, line: 130, baseType: !102, size: 64, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "v_shared", scope: !170, file: !9, line: 131, baseType: !110, size: 64, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !170, file: !9, line: 132, baseType: !189, size: 1856, offset: 576)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "stl_stats", file: !9, line: 86, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_stl_stats_30", file: !9, line: 86, size: 1856, elements: !191)
!191 = !{!192, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !190, file: !9, line: 87, baseType: !193, size: 648)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 648, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 81)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !190, file: !9, line: 88, baseType: !157, size: 32, offset: 672)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "number_of_facets", scope: !190, file: !9, line: 89, baseType: !20, size: 32, offset: 704)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !190, file: !9, line: 90, baseType: !111, size: 96, offset: 736)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !190, file: !9, line: 91, baseType: !111, size: 96, offset: 832)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !190, file: !9, line: 92, baseType: !111, size: 96, offset: 928)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "bounding_diameter", scope: !190, file: !9, line: 93, baseType: !15, size: 32, offset: 1024)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "shortest_edge", scope: !190, file: !9, line: 94, baseType: !15, size: 32, offset: 1056)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !190, file: !9, line: 95, baseType: !15, size: 32, offset: 1088)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "number_of_blocks", scope: !190, file: !9, line: 96, baseType: !10, size: 32, offset: 1120)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "connected_edges", scope: !190, file: !9, line: 97, baseType: !20, size: 32, offset: 1152)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "connected_facets_1_edge", scope: !190, file: !9, line: 98, baseType: !20, size: 32, offset: 1184)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "connected_facets_2_edge", scope: !190, file: !9, line: 99, baseType: !20, size: 32, offset: 1216)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "connected_facets_3_edge", scope: !190, file: !9, line: 100, baseType: !20, size: 32, offset: 1248)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "facets_w_1_bad_edge", scope: !190, file: !9, line: 101, baseType: !20, size: 32, offset: 1280)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "facets_w_2_bad_edge", scope: !190, file: !9, line: 102, baseType: !20, size: 32, offset: 1312)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "facets_w_3_bad_edge", scope: !190, file: !9, line: 103, baseType: !20, size: 32, offset: 1344)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "original_num_facets", scope: !190, file: !9, line: 104, baseType: !20, size: 32, offset: 1376)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "edges_fixed", scope: !190, file: !9, line: 105, baseType: !20, size: 32, offset: 1408)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "degenerate_facets", scope: !190, file: !9, line: 106, baseType: !20, size: 32, offset: 1440)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "facets_removed", scope: !190, file: !9, line: 107, baseType: !20, size: 32, offset: 1472)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "facets_added", scope: !190, file: !9, line: 108, baseType: !20, size: 32, offset: 1504)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "facets_reversed", scope: !190, file: !9, line: 109, baseType: !20, size: 32, offset: 1536)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "backwards_edges", scope: !190, file: !9, line: 110, baseType: !20, size: 32, offset: 1568)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "normals_fixed", scope: !190, file: !9, line: 111, baseType: !20, size: 32, offset: 1600)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "number_of_parts", scope: !190, file: !9, line: 112, baseType: !20, size: 32, offset: 1632)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "malloced", scope: !190, file: !9, line: 113, baseType: !20, size: 32, offset: 1664)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "freed", scope: !190, file: !9, line: 114, baseType: !20, size: 32, offset: 1696)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "facets_malloced", scope: !190, file: !9, line: 115, baseType: !20, size: 32, offset: 1728)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !190, file: !9, line: 116, baseType: !20, size: 32, offset: 1760)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "shared_vertices", scope: !190, file: !9, line: 117, baseType: !20, size: 32, offset: 1792)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "shared_malloced", scope: !190, file: !9, line: 118, baseType: !20, size: 32, offset: 1824)
!227 = !DILocation(line: 32, column: 12, scope: !159)
!228 = !DILocalVariable(name: "x_trans", scope: !159, file: !160, line: 37, type: !15)
!229 = !DILocation(line: 37, column: 9, scope: !159)
!230 = !DILocalVariable(name: "y_trans", scope: !159, file: !160, line: 38, type: !15)
!231 = !DILocation(line: 38, column: 9, scope: !159)
!232 = !DILocalVariable(name: "z_trans", scope: !159, file: !160, line: 39, type: !15)
!233 = !DILocation(line: 39, column: 9, scope: !159)
!234 = !DILocalVariable(name: "long_options", scope: !159, file: !160, line: 81, type: !235)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 7168, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 28)
!238 = !DILocation(line: 81, column: 17, scope: !159)
!239 = !DILocalVariable(name: "__cil_tmp59", scope: !159, file: !160, line: 88, type: !18)
!240 = !DILocation(line: 88, column: 9, scope: !159)
!241 = !DILocalVariable(name: "__cil_tmp60", scope: !159, file: !160, line: 89, type: !20)
!242 = !DILocation(line: 89, column: 7, scope: !159)
!243 = !DILocalVariable(name: "__cil_tmp61", scope: !159, file: !160, line: 90, type: !16)
!244 = !DILocation(line: 90, column: 9, scope: !159)
!245 = !DILocalVariable(name: "__cil_tmp62", scope: !159, file: !160, line: 91, type: !16)
!246 = !DILocation(line: 91, column: 9, scope: !159)
!247 = !DILocalVariable(name: "__cil_tmp63", scope: !159, file: !160, line: 92, type: !16)
!248 = !DILocation(line: 92, column: 9, scope: !159)
!249 = !DILocalVariable(name: "__cil_tmp64", scope: !159, file: !160, line: 93, type: !16)
!250 = !DILocation(line: 93, column: 9, scope: !159)
!251 = !DILocalVariable(name: "__cil_tmp65", scope: !159, file: !160, line: 94, type: !16)
!252 = !DILocation(line: 94, column: 9, scope: !159)
!253 = !DILocalVariable(name: "__cil_tmp66", scope: !159, file: !160, line: 95, type: !16)
!254 = !DILocation(line: 95, column: 9, scope: !159)
!255 = !DILocalVariable(name: "__cil_tmp67", scope: !159, file: !160, line: 96, type: !16)
!256 = !DILocation(line: 96, column: 9, scope: !159)
!257 = !DILocalVariable(name: "__cil_tmp68", scope: !159, file: !160, line: 97, type: !16)
!258 = !DILocation(line: 97, column: 9, scope: !159)
!259 = !DILocalVariable(name: "__cil_tmp69", scope: !159, file: !160, line: 98, type: !16)
!260 = !DILocation(line: 98, column: 9, scope: !159)
!261 = !DILocalVariable(name: "__cil_tmp70", scope: !159, file: !160, line: 99, type: !16)
!262 = !DILocation(line: 99, column: 9, scope: !159)
!263 = !DILocalVariable(name: "__cil_tmp71", scope: !159, file: !160, line: 100, type: !16)
!264 = !DILocation(line: 100, column: 9, scope: !159)
!265 = !DILocalVariable(name: "__cil_tmp72", scope: !159, file: !160, line: 101, type: !16)
!266 = !DILocation(line: 101, column: 9, scope: !159)
!267 = !DILocalVariable(name: "__cil_tmp73", scope: !159, file: !160, line: 102, type: !16)
!268 = !DILocation(line: 102, column: 9, scope: !159)
!269 = !DILocalVariable(name: "__cil_tmp74", scope: !159, file: !160, line: 103, type: !16)
!270 = !DILocation(line: 103, column: 9, scope: !159)
!271 = !DILocalVariable(name: "__cil_tmp75", scope: !159, file: !160, line: 104, type: !16)
!272 = !DILocation(line: 104, column: 9, scope: !159)
!273 = !DILocalVariable(name: "__cil_tmp76", scope: !159, file: !160, line: 105, type: !16)
!274 = !DILocation(line: 105, column: 9, scope: !159)
!275 = !DILocalVariable(name: "__cil_tmp77", scope: !159, file: !160, line: 106, type: !16)
!276 = !DILocation(line: 106, column: 9, scope: !159)
!277 = !DILocalVariable(name: "__cil_tmp78", scope: !159, file: !160, line: 107, type: !16)
!278 = !DILocation(line: 107, column: 9, scope: !159)
!279 = !DILocalVariable(name: "__cil_tmp79", scope: !159, file: !160, line: 108, type: !16)
!280 = !DILocation(line: 108, column: 9, scope: !159)
