; ModuleID = '/tmp/tmp.ll'
source_filename = "c/alac-decoder-0.1.3.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct.alac_file = type { i8*, i32, i32, i32, i32, i32*, i32*, i32*, i32*, i32, i8, i8, i8, i8, i8, i8, i16, i32, i32, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.stream_tTAG = type { %struct._IO_FILE*, i32, i32 }
%struct.__anonstruct_demux_res_t_24 = type { i32, i16, i16, i32, i32, i8*, %struct.__anonstruct_time_to_sample_25*, i32, i32*, i32, i32, i8*, i32 }
%struct.__anonstruct_time_to_sample_25 = type { i32, i32 }
%struct.__anonstruct_qtmovie_t_25 = type { %struct.stream_tTAG*, %struct.__anonstruct_demux_res_t_24*, i64 }

@host_bigendian = global i32 0, align 4, !dbg !0
@alac = global %struct.alac_file* null, align 8, !dbg !160
@input_file = internal global %struct._IO_FILE* null, align 8, !dbg !167
@input_stream = internal global %struct.stream_tTAG* null, align 8, !dbg !163
@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [41 x i8] c"failed to create input stream from file\0A\00", align 1
@test_file_type = internal global i32 0, align 4, !dbg !169

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "host_bigendian", scope: !2, file: !162, line: 47, type: !13, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !159, nameTableKind: GNU)
!3 = !DIFile(filename: "c/alac-decoder-0.1.3.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !9, !11, !13, !14, !15, !17, !76, !26, !78, !80, !8, !82, !83, !85, !86, !88, !84, !89, !116, !25, !51, !122, !155, !101, !157, !158, !143}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !7, line: 52, baseType: !8)
!7 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!8 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !7, line: 50, baseType: !10)
!10 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !16, line: 211, baseType: !8)
!16 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !19, line: 49, baseType: !20)
!19 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 271, size: 1728, elements: !22)
!21 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!22 = !{!23, !24, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !45, !46, !47, !48, !52, !53, !55, !59, !62, !66, !67, !68, !69, !70, !71, !72}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !20, file: !21, line: 272, baseType: !13, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !20, file: !21, line: 273, baseType: !25, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !20, file: !21, line: 274, baseType: !25, size: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !20, file: !21, line: 275, baseType: !25, size: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !20, file: !21, line: 276, baseType: !25, size: 64, offset: 256)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !20, file: !21, line: 277, baseType: !25, size: 64, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !20, file: !21, line: 278, baseType: !25, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !20, file: !21, line: 279, baseType: !25, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !20, file: !21, line: 280, baseType: !25, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !20, file: !21, line: 281, baseType: !25, size: 64, offset: 576)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !20, file: !21, line: 282, baseType: !25, size: 64, offset: 640)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !20, file: !21, line: 283, baseType: !25, size: 64, offset: 704)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !20, file: !21, line: 284, baseType: !38, size: 64, offset: 768)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !21, line: 186, size: 192, elements: !40)
!40 = !{!41, !42, !44}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !39, file: !21, line: 187, baseType: !38, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !39, file: !21, line: 188, baseType: !43, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !39, file: !21, line: 189, baseType: !13, size: 32, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !20, file: !21, line: 285, baseType: !43, size: 64, offset: 832)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !20, file: !21, line: 286, baseType: !13, size: 32, offset: 896)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !20, file: !21, line: 287, baseType: !13, size: 32, offset: 928)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !20, file: !21, line: 288, baseType: !49, size: 64, offset: 960)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !50, line: 141, baseType: !51)
!50 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!51 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !20, file: !21, line: 289, baseType: !10, size: 16, offset: 1024)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !20, file: !21, line: 290, baseType: !54, size: 8, offset: 1040)
!54 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !20, file: !21, line: 291, baseType: !56, size: 8, offset: 1048)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 1)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !20, file: !21, line: 292, baseType: !60, size: 64, offset: 1088)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !21, line: 180, baseType: null)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !20, file: !21, line: 293, baseType: !63, size: 64, offset: 1152)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !50, line: 142, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !50, line: 56, baseType: !65)
!65 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !20, file: !21, line: 294, baseType: !14, size: 64, offset: 1216)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !20, file: !21, line: 295, baseType: !14, size: 64, offset: 1280)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !20, file: !21, line: 296, baseType: !14, size: 64, offset: 1344)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !20, file: !21, line: 297, baseType: !14, size: 64, offset: 1408)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !20, file: !21, line: 298, baseType: !15, size: 32, offset: 1472)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !20, file: !21, line: 299, baseType: !13, size: 32, offset: 1504)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !20, file: !21, line: 300, baseType: !73, size: 192, offset: 1536)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 192, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 24)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !79, line: 197, baseType: !13)
!79 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "fourcc_t", file: !81, line: 7, baseType: !6)
!81 = !DIFile(filename: "/home/wslee/benchmarks/sound/alac-decoder-0.1.3/demux.h", directory: "")
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !7, line: 49, baseType: !12)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !79, line: 196, baseType: !87)
!87 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "alac_file", file: !91, line: 4, baseType: !92)
!91 = !DIFile(filename: "/home/wslee/benchmarks/sound/alac-decoder-0.1.3/decomp.h", directory: "")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alac_file", file: !93, line: 53, size: 640, elements: !94)
!93 = !DIFile(filename: "/home/wslee/benchmarks/sound/alac-decoder-0.1.3/alac.c", directory: "")
!94 = !{!95, !96, !97, !98, !99, !100, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "input_buffer", scope: !92, file: !93, line: 54, baseType: !11, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "input_buffer_bitaccumulator", scope: !92, file: !93, line: 55, baseType: !13, size: 32, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "samplesize", scope: !92, file: !93, line: 56, baseType: !13, size: 32, offset: 96)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "numchannels", scope: !92, file: !93, line: 57, baseType: !13, size: 32, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "bytespersample", scope: !92, file: !93, line: 58, baseType: !13, size: 32, offset: 160)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "predicterror_buffer_a", scope: !92, file: !93, line: 59, baseType: !101, size: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "predicterror_buffer_b", scope: !92, file: !93, line: 60, baseType: !101, size: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "outputsamples_buffer_a", scope: !92, file: !93, line: 61, baseType: !101, size: 64, offset: 320)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "outputsamples_buffer_b", scope: !92, file: !93, line: 62, baseType: !101, size: 64, offset: 384)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "setinfo_max_samples_per_frame", scope: !92, file: !93, line: 63, baseType: !6, size: 32, offset: 448)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "setinfo_7a", scope: !92, file: !93, line: 64, baseType: !84, size: 8, offset: 480)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "setinfo_sample_size", scope: !92, file: !93, line: 65, baseType: !84, size: 8, offset: 488)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "setinfo_rice_historymult", scope: !92, file: !93, line: 66, baseType: !84, size: 8, offset: 496)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "setinfo_rice_initialhistory", scope: !92, file: !93, line: 67, baseType: !84, size: 8, offset: 504)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "setinfo_rice_kmodifier", scope: !92, file: !93, line: 68, baseType: !84, size: 8, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "setinfo_7f", scope: !92, file: !93, line: 69, baseType: !84, size: 8, offset: 520)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "setinfo_80", scope: !92, file: !93, line: 70, baseType: !9, size: 16, offset: 528)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "setinfo_82", scope: !92, file: !93, line: 71, baseType: !6, size: 32, offset: 544)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "setinfo_86", scope: !92, file: !93, line: 72, baseType: !6, size: 32, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "setinfo_8a_rate", scope: !92, file: !93, line: 73, baseType: !6, size: 32, offset: 608)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "qtmovie_t", file: !118, line: 41, baseType: !119)
!118 = !DIFile(filename: "/home/wslee/benchmarks/sound/alac-decoder-0.1.3/demux.c", directory: "")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_qtmovie_t_25", file: !118, line: 41, size: 192, elements: !120)
!120 = !{!121, !131, !154}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !119, file: !118, line: 42, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream_t", file: !124, line: 8, baseType: !125)
!124 = !DIFile(filename: "/home/wslee/benchmarks/sound/alac-decoder-0.1.3/stream.h", directory: "")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream_tTAG", file: !126, line: 52, size: 128, elements: !127)
!126 = !DIFile(filename: "/home/wslee/benchmarks/sound/alac-decoder-0.1.3/stream.c", directory: "")
!127 = !{!128, !129, !130}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !125, file: !126, line: 53, baseType: !17, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "bigendian", scope: !125, file: !126, line: 54, baseType: !13, size: 32, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !125, file: !126, line: 55, baseType: !13, size: 32, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "res", scope: !119, file: !118, line: 43, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "demux_res_t", file: !81, line: 9, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_demux_res_t_24", file: !81, line: 9, size: 576, elements: !135)
!135 = !{!136, !137, !138, !139, !140, !141, !142, !148, !149, !150, !151, !152, !153}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "format_read", scope: !134, file: !81, line: 10, baseType: !13, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "num_channels", scope: !134, file: !81, line: 11, baseType: !9, size: 16, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "sample_size", scope: !134, file: !81, line: 12, baseType: !9, size: 16, offset: 48)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !134, file: !81, line: 13, baseType: !6, size: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !134, file: !81, line: 14, baseType: !80, size: 32, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !134, file: !81, line: 15, baseType: !14, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "time_to_sample", scope: !134, file: !81, line: 16, baseType: !143, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_time_to_sample_25", file: !81, line: 9, size: 64, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "sample_count", scope: !144, file: !81, line: 10, baseType: !6, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "sample_duration", scope: !144, file: !81, line: 11, baseType: !6, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "num_time_to_samples", scope: !134, file: !81, line: 17, baseType: !6, size: 32, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "sample_byte_size", scope: !134, file: !81, line: 18, baseType: !82, size: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "num_sample_byte_sizes", scope: !134, file: !81, line: 19, baseType: !6, size: 32, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "codecdata_len", scope: !134, file: !81, line: 20, baseType: !6, size: 32, offset: 416)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "codecdata", scope: !134, file: !81, line: 21, baseType: !14, size: 64, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "mdat_len", scope: !134, file: !81, line: 22, baseType: !6, size: 32, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "saved_mdat_pos", scope: !119, file: !118, line: 44, baseType: !51, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!158 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!159 = !{!0, !160, !163, !165, !167, !169, !171, !173, !175, !177}
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "alac", scope: !2, file: !162, line: 49, type: !89, isLocal: false, isDefinition: true)
!162 = !DIFile(filename: "/home/wslee/benchmarks/sound/alac-decoder-0.1.3/main.c", directory: "")
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "input_stream", scope: !2, file: !162, line: 53, type: !122, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !162, line: 59, type: !13, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "input_file", scope: !2, file: !162, line: 51, type: !17, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "test_file_type", scope: !2, file: !162, line: 60, type: !13, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "write_wav_format", scope: !2, file: !162, line: 58, type: !13, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "output_file", scope: !2, file: !162, line: 55, type: !17, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "output_opened", scope: !2, file: !162, line: 56, type: !13, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "input_opened", scope: !2, file: !162, line: 52, type: !13, isLocal: true, isDefinition: true)
!179 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!180 = !{i32 2, !"Dwarf Version", i32 4}
!181 = !{i32 2, !"Debug Info Version", i32 3}
!182 = !{i32 1, !"wchar_size", i32 4}
!183 = !{i32 7, !"PIC Level", i32 2}
!184 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!185 = distinct !DISubprogram(name: "wavwriter_writeheaders", scope: !186, file: !186, line: 69, type: !187, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!186 = !DIFile(filename: "/home/wslee/benchmarks/sound/alac-decoder-0.1.3/wavwriter.c", directory: "")
!187 = !DISubroutineType(types: !188)
!188 = !{null, !17, !13, !13, !13, !13}
!189 = !DILocalVariable(name: "f", arg: 1, scope: !185, file: !186, line: 69, type: !17)
!190 = !DILocation(line: 0, scope: !185)
!191 = !DILocalVariable(name: "datasize", arg: 2, scope: !185, file: !186, line: 69, type: !13)
!192 = !DILocalVariable(name: "numchannels", arg: 3, scope: !185, file: !186, line: 69, type: !13)
!193 = !DILocalVariable(name: "samplerate", arg: 4, scope: !185, file: !186, line: 69, type: !13)
!194 = !DILocalVariable(name: "bitspersample", arg: 5, scope: !185, file: !186, line: 70, type: !13)
!195 = !DILocation(line: 74, column: 3, scope: !196)
!196 = distinct !DILexicalBlock(scope: !197, file: !186, line: 76, column: 3)
!197 = distinct !DILexicalBlock(scope: !198, file: !186, line: 75, column: 3)
!198 = distinct !DILexicalBlock(scope: !185, file: !186, line: 74, column: 3)
!199 = !DILocation(line: 75, column: 34, scope: !200)
