; ModuleID = '/tmp/tmp.ll'
source_filename = "c/ample-0.5.7.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct.global_config = type { i32, i16, i16, i16, i16, i32, i32, i8*, i8*, i8**, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8* }
%struct.node = type { i32, i8*, i8*, i64, i32, i32, i32, i8*, %struct.node*, %struct.node* }
%struct.childstat = type { i32, i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.client_config = type { i16, i8*, i8*, i8*, i64, i64, %struct._IO_FILE*, i32, %struct.node*, i16 }
%struct.hostent = type { i8*, i8**, i32, i32, i8** }
%struct.in_addr = type { i32 }
%struct.sigaction = type { %union.__anonunion___sigaction_handler_44, %struct.__anonstruct___sigset_t_9, i32, void ()* }
%union.__anonunion___sigaction_handler_44 = type { void (i32)* }
%struct.__anonstruct___sigset_t_9 = type { [16 x i64] }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.confoption = type { i8*, i16, i8* }
%struct.servent = type { i8*, i8**, i32, i8* }
%struct.stat = type { i64, i16, i64, i32, i32, i32, i32, i64, i16, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "bitrate_table", scope: !2, file: !328, line: 59, type: !379, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !325, nameTableKind: GNU)
!3 = !DIFile(filename: "c/ample-0.5.7.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !8, !11, !13, !15, !16, !18, !17, !7, !19, !20, !21, !29, !86, !62, !118, !205, !206, !127, !99, !207, !115, !208, !217, !221, !222, !223, !224, !108, !225, !10, !229, !231, !240, !241, !242, !243, !244, !278, !280, !256, !281, !297, !299, !26, !300, !310, !311, !318}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !9, line: 211, baseType: !10)
!9 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!18 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !23, line: 142, size: 32, elements: !24)
!23 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!24 = !{!25}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !22, file: !23, line: 143, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !23, line: 141, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !28, line: 52, baseType: !10)
!28 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !31, line: 49, baseType: !32)
!31 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !33, line: 271, size: 1728, elements: !34)
!33 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !55, !56, !57, !58, !61, !63, !65, !69, !72, !76, !77, !78, !79, !80, !81, !82}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !32, file: !33, line: 272, baseType: !19, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !32, file: !33, line: 273, baseType: !6, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !32, file: !33, line: 274, baseType: !6, size: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !32, file: !33, line: 275, baseType: !6, size: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !32, file: !33, line: 276, baseType: !6, size: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !32, file: !33, line: 277, baseType: !6, size: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !32, file: !33, line: 278, baseType: !6, size: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !32, file: !33, line: 279, baseType: !6, size: 64, offset: 448)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !32, file: !33, line: 280, baseType: !6, size: 64, offset: 512)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !32, file: !33, line: 281, baseType: !6, size: 64, offset: 576)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !32, file: !33, line: 282, baseType: !6, size: 64, offset: 640)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !32, file: !33, line: 283, baseType: !6, size: 64, offset: 704)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !32, file: !33, line: 284, baseType: !48, size: 64, offset: 768)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !33, line: 186, size: 192, elements: !50)
!50 = !{!51, !52, !54}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !49, file: !33, line: 187, baseType: !48, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !49, file: !33, line: 188, baseType: !53, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !49, file: !33, line: 189, baseType: !19, size: 32, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !32, file: !33, line: 285, baseType: !53, size: 64, offset: 832)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !32, file: !33, line: 286, baseType: !19, size: 32, offset: 896)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !32, file: !33, line: 287, baseType: !19, size: 32, offset: 928)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !32, file: !33, line: 288, baseType: !59, size: 64, offset: 960)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !60, line: 141, baseType: !20)
!60 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !32, file: !33, line: 289, baseType: !62, size: 16, offset: 1024)
!62 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !32, file: !33, line: 290, baseType: !64, size: 8, offset: 1040)
!64 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !32, file: !33, line: 291, baseType: !66, size: 8, offset: 1048)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !32, file: !33, line: 292, baseType: !70, size: 64, offset: 1088)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !33, line: 180, baseType: null)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !32, file: !33, line: 293, baseType: !73, size: 64, offset: 1152)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !60, line: 142, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !60, line: 56, baseType: !75)
!75 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !32, file: !33, line: 294, baseType: !17, size: 64, offset: 1216)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !32, file: !33, line: 295, baseType: !17, size: 64, offset: 1280)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !32, file: !33, line: 296, baseType: !17, size: 64, offset: 1344)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !32, file: !33, line: 297, baseType: !17, size: 64, offset: 1408)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !32, file: !33, line: 298, baseType: !8, size: 32, offset: 1472)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !32, file: !33, line: 299, baseType: !19, size: 32, offset: 1504)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !32, file: !33, line: 300, baseType: !83, size: 192, offset: 1536)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 24)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client_config", file: !88, line: 4, size: 640, elements: !89)
!88 = !DIFile(filename: "/home/wslee/benchmarks/sound/ample-0.5.7/src/client.h", directory: "")
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97, !98, !117}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !87, file: !88, line: 5, baseType: !62, size: 16)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !87, file: !88, line: 6, baseType: !6, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !87, file: !88, line: 7, baseType: !6, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "requestpath", scope: !87, file: !88, line: 8, baseType: !6, size: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "startpos", scope: !87, file: !88, line: 9, baseType: !20, size: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "endpos", scope: !87, file: !88, line: 10, baseType: !20, size: 64, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !87, file: !88, line: 11, baseType: !29, size: 64, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "statussock", scope: !87, file: !88, line: 12, baseType: !19, size: 32, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "mp3base", scope: !87, file: !88, line: 13, baseType: !99, size: 64, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp3entry", file: !101, line: 14, baseType: !102)
!101 = !DIFile(filename: "/home/wslee/benchmarks/sound/ample-0.5.7/src/entries.h", directory: "")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !101, line: 14, size: 576, elements: !103)
!103 = !{!104, !105, !106, !107, !110, !111, !112, !113, !114, !116}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !102, file: !101, line: 15, baseType: !19, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !102, file: !101, line: 16, baseType: !6, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !102, file: !101, line: 17, baseType: !6, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "filesize", scope: !102, file: !101, line: 18, baseType: !108, size: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !109, line: 88, baseType: !59)
!109 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!110 = !DIDerivedType(tag: DW_TAG_member, name: "id3v1len", scope: !102, file: !101, line: 19, baseType: !19, size: 32, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "id3v2len", scope: !102, file: !101, line: 20, baseType: !19, size: 32, offset: 288)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !102, file: !101, line: 21, baseType: !19, size: 32, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !102, file: !101, line: 22, baseType: !6, size: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !102, file: !101, line: 23, baseType: !115, size: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !102, file: !101, line: 24, baseType: !115, size: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !87, file: !88, line: 14, baseType: !18, size: 16, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !121, line: 25, size: 1216, elements: !122)
!121 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "")
!122 = !{!123, !191, !200, !201}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !120, file: !121, line: 26, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion___sigaction_handler_44", file: !121, line: 25, size: 64, elements: !125)
!125 = !{!126, !130}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !124, file: !121, line: 26, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !19}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !124, file: !121, line: 27, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !19, !134, !17}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !136, line: 51, baseType: !137)
!136 = !DIFile(filename: "/usr/include/bits/siginfo.h", directory: "")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "siginfo", file: !136, line: 51, size: 1088, elements: !138)
!138 = !{!139, !140, !141, !142}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !137, file: !136, line: 52, baseType: !19, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !137, file: !136, line: 53, baseType: !19, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !137, file: !136, line: 54, baseType: !19, size: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !137, file: !136, line: 55, baseType: !143, size: 960, offset: 128)
!143 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion__sifields_26", file: !136, line: 51, size: 960, elements: !144)
!144 = !{!145, !149, !156, !167, !173, !182, !186}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !143, file: !136, line: 52, baseType: !146, size: 928)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 928, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 29)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !143, file: !136, line: 53, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct__kill_27", file: !136, line: 51, size: 64, elements: !151)
!151 = !{!152, !154}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !150, file: !136, line: 52, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !60, line: 143, baseType: !19)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !150, file: !136, line: 53, baseType: !155, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !60, line: 135, baseType: !10)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !143, file: !136, line: 54, baseType: !157, size: 128)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct__timer_28", file: !136, line: 51, size: 128, elements: !158)
!158 = !{!159, !160, !161}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !157, file: !136, line: 52, baseType: !19, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !157, file: !136, line: 53, baseType: !19, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !157, file: !136, line: 54, baseType: !162, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !136, line: 33, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !136, line: 33, size: 64, elements: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !163, file: !136, line: 34, baseType: !19, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !163, file: !136, line: 35, baseType: !17, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !143, file: !136, line: 55, baseType: !168, size: 128)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct__rt_29", file: !136, line: 51, size: 128, elements: !169)
!169 = !{!170, !171, !172}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !168, file: !136, line: 52, baseType: !153, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !168, file: !136, line: 53, baseType: !155, size: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !168, file: !136, line: 54, baseType: !162, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !143, file: !136, line: 56, baseType: !174, size: 256)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct__sigchld_30", file: !136, line: 51, size: 256, elements: !175)
!175 = !{!176, !177, !178, !179, !181}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !174, file: !136, line: 52, baseType: !153, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !174, file: !136, line: 53, baseType: !155, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !174, file: !136, line: 54, baseType: !19, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !174, file: !136, line: 55, baseType: !180, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !60, line: 145, baseType: !20)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !174, file: !136, line: 56, baseType: !180, size: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !143, file: !136, line: 57, baseType: !183, size: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct__sigfault_31", file: !136, line: 51, size: 64, elements: !184)
!184 = !{!185}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !183, file: !136, line: 52, baseType: !17, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !143, file: !136, line: 58, baseType: !187, size: 128)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct__sigpoll_32", file: !136, line: 51, size: 128, elements: !188)
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !187, file: !136, line: 52, baseType: !20, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !187, file: !136, line: 53, baseType: !19, size: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !120, file: !121, line: 27, baseType: !192, size: 1024, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !193, line: 29, baseType: !194)
!193 = !DIFile(filename: "/usr/include/bits/sigset.h", directory: "")
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct___sigset_t_9", file: !193, line: 29, size: 1024, elements: !195)
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !194, file: !193, line: 30, baseType: !197, size: 1024)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 1024, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 16)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !120, file: !121, line: 28, baseType: !19, size: 32, offset: 1088)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !120, file: !121, line: 29, baseType: !202, size: 64, offset: 1152)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{null}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "childstat", file: !210, line: 41, size: 192, elements: !211)
!210 = !DIFile(filename: "/home/wslee/benchmarks/sound/ample-0.5.7/src/ample.h", directory: "")
!211 = !{!212, !215, !216}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "childpid", scope: !209, file: !210, line: 42, baseType: !213, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !214, line: 261, baseType: !153)
!214 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!215 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !209, file: !210, line: 43, baseType: !6, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !209, file: !210, line: 44, baseType: !6, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !220, line: 38, baseType: !192)
!220 = !DIFile(filename: "/usr/include/sys/select.h", directory: "")
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!222 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!223 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!224 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !227, line: 76, baseType: !228)
!227 = !DIFile(filename: "/usr/include/time.h", directory: "")
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !60, line: 149, baseType: !20)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !234, line: 106, size: 256, elements: !235)
!234 = !DIFile(filename: "/usr/include/getopt.h", directory: "")
!235 = !{!236, !237, !238, !239}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !234, line: 107, baseType: !11, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !233, file: !234, line: 108, baseType: !19, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !233, file: !234, line: 109, baseType: !207, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !233, file: !234, line: 110, baseType: !19, size: 32, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !28, line: 50, baseType: !62)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !246, line: 43, size: 1152, elements: !247)
!246 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!247 = !{!248, !252, !253, !255, !257, !259, !260, !262, !263, !264, !265, !267, !269, !274, !275, !276, !277}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !245, file: !246, line: 44, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !60, line: 134, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_quad_t", file: !60, line: 57, baseType: !251)
!251 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !245, file: !246, line: 45, baseType: !62, size: 16, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !245, file: !246, line: 46, baseType: !254, size: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !60, line: 137, baseType: !15)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !245, file: !246, line: 47, baseType: !256, size: 32, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !60, line: 139, baseType: !10)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !245, file: !246, line: 48, baseType: !258, size: 32, offset: 224)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !60, line: 140, baseType: !10)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !245, file: !246, line: 49, baseType: !155, size: 32, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !245, file: !246, line: 50, baseType: !261, size: 32, offset: 288)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !60, line: 136, baseType: !10)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !245, file: !246, line: 51, baseType: !249, size: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !245, file: !246, line: 52, baseType: !62, size: 16, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !245, file: !246, line: 53, baseType: !59, size: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !245, file: !246, line: 54, baseType: !266, size: 64, offset: 512)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !60, line: 164, baseType: !20)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !245, file: !246, line: 55, baseType: !268, size: 64, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !60, line: 169, baseType: !20)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !245, file: !246, line: 56, baseType: !270, size: 128, offset: 640)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !227, line: 120, size: 128, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !270, file: !227, line: 121, baseType: !228, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !270, file: !227, line: 122, baseType: !20, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !245, file: !246, line: 57, baseType: !270, size: 128, offset: 768)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !245, file: !246, line: 58, baseType: !270, size: 128, offset: 896)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__unused4", scope: !245, file: !246, line: 59, baseType: !15, size: 64, offset: 1024)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__unused5", scope: !245, file: !246, line: 60, baseType: !15, size: 64, offset: 1088)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !214, line: 275, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !60, line: 192, baseType: !10)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "wait", file: !283, line: 67, size: 32, elements: !284)
!283 = !DIFile(filename: "/usr/include/bits/waitstatus.h", directory: "")
!284 = !{!285, !286, !292}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "w_status", scope: !282, file: !283, line: 68, baseType: !19, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__wait_terminated", scope: !282, file: !283, line: 69, baseType: !287, size: 32)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct___wait_terminated_50", file: !283, line: 67, size: 32, elements: !288)
!288 = !{!289, !290, !291}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "__w_termsig", scope: !287, file: !283, line: 68, baseType: !10, size: 7, flags: DIFlagBitField, extraData: i64 0)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__w_coredump", scope: !287, file: !283, line: 69, baseType: !10, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__w_retcode", scope: !287, file: !283, line: 70, baseType: !10, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__wait_stopped", scope: !282, file: !283, line: 70, baseType: !293, size: 32)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct___wait_stopped_51", file: !283, line: 67, size: 32, elements: !294)
!294 = !{!295, !296}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__w_stopval", scope: !293, file: !283, line: 68, baseType: !10, size: 8, flags: DIFlagBitField, extraData: i64 0)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__w_stopsig", scope: !293, file: !283, line: 69, baseType: !10, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !298, line: 29, baseType: !62)
!298 = !DIFile(filename: "/usr/include/bits/sockaddr.h", directory: "")
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !23, line: 97, baseType: !243)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !303, line: 174, size: 128, elements: !304)
!303 = !DIFile(filename: "/usr/include/bits/socket.h", directory: "")
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !302, file: !303, line: 175, baseType: !297, size: 16)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !302, file: !303, line: 176, baseType: !307, size: 112, offset: 16)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 112, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 14)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !220, line: 67, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_fd_set_10", file: !220, line: 67, size: 1024, elements: !314)
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__fds_bits", scope: !313, file: !220, line: 68, baseType: !316, size: 1024)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 1024, elements: !198)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !220, line: 55, baseType: !20)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !320, line: 69, size: 128, elements: !321)
!320 = !DIFile(filename: "/usr/include/bits/time.h", directory: "")
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !319, file: !320, line: 70, baseType: !228, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !319, file: !320, line: 71, baseType: !324, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !60, line: 151, baseType: !20)
!325 = !{!0, !326, !333, !338, !341, !365, !367, !371, !373, !376}
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "bs", scope: !2, file: !328, line: 76, type: !329, isLocal: false, isDefinition: true)
!328 = !DIFile(filename: "/home/wslee/benchmarks/sound/ample-0.5.7/src/helper.c", directory: "")
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 128, elements: !331)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!331 = !{!332}
!332 = !DISubrange(count: 4)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "freqtab", scope: !2, file: !328, line: 82, type: !335, isLocal: false, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 256, elements: !336)
!336 = !{!337, !332}
!337 = !DISubrange(count: 2)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "root", scope: !2, file: !340, line: 66, type: !99, isLocal: false, isDefinition: true)
!340 = !DIFile(filename: "/home/wslee/benchmarks/sound/ample-0.5.7/src/entries.c", directory: "")
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "gconf", scope: !2, file: !210, line: 59, type: !343, isLocal: false, isDefinition: true)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_config", file: !210, line: 18, size: 1024, elements: !344)
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !343, file: !210, line: 19, baseType: !19, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "inetd", scope: !343, file: !210, line: 20, baseType: !18, size: 16, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !343, file: !210, line: 21, baseType: !18, size: 16, offset: 48)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "trace", scope: !343, file: !210, line: 22, baseType: !18, size: 16, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !343, file: !210, line: 23, baseType: !18, size: 16, offset: 80)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "debuglevel", scope: !343, file: !210, line: 24, baseType: !19, size: 32, offset: 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "max_clients", scope: !343, file: !210, line: 25, baseType: !19, size: 32, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !343, file: !210, line: 26, baseType: !6, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !343, file: !210, line: 27, baseType: !6, size: 64, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pathlist", scope: !343, file: !210, line: 28, baseType: !206, size: 64, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "program_name", scope: !343, file: !210, line: 29, baseType: !6, size: 64, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "logfile", scope: !343, file: !210, line: 30, baseType: !6, size: 64, offset: 448)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "conffile", scope: !343, file: !210, line: 31, baseType: !6, size: 64, offset: 512)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "htmlfile", scope: !343, file: !210, line: 32, baseType: !6, size: 64, offset: 576)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "htmlheader", scope: !343, file: !210, line: 33, baseType: !6, size: 64, offset: 640)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "htmlmiddle", scope: !343, file: !210, line: 34, baseType: !6, size: 64, offset: 704)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "htmlfooter", scope: !343, file: !210, line: 35, baseType: !6, size: 64, offset: 768)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "servername", scope: !343, file: !210, line: 36, baseType: !6, size: 64, offset: 832)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "serveraddress", scope: !343, file: !210, line: 37, baseType: !6, size: 64, offset: 896)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !343, file: !210, line: 38, baseType: !6, size: 64, offset: 960)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "childarray", scope: !2, file: !210, line: 60, type: !208, isLocal: false, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "timeout", scope: !2, file: !369, line: 60, type: !370, isLocal: false, isDefinition: true)
!369 = !DIFile(filename: "/home/wslee/benchmarks/sound/ample-0.5.7/src/configuration.c", directory: "")
!370 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !19)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "result", scope: !2, file: !328, line: 404, type: !6, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "bytestometa", scope: !2, file: !375, line: 48, type: !19, isLocal: true, isDefinition: true)
!375 = !DIFile(filename: "/home/wslee/benchmarks/sound/ample-0.5.7/src/client.c", directory: "")
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "num_clients", scope: !2, file: !378, line: 67, type: !370, isLocal: true, isDefinition: true)
!378 = !DIFile(filename: "/home/wslee/benchmarks/sound/ample-0.5.7/src/ample.c", directory: "")
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 3072, elements: !380)
!380 = !{!337, !381, !199}
!381 = !DISubrange(count: 3)
!382 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!383 = !{i32 2, !"Dwarf Version", i32 4}
!384 = !{i32 2, !"Debug Info Version", i32 3}
!385 = !{i32 1, !"wchar_size", i32 4}
!386 = !{i32 7, !"PIC Level", i32 2}
!387 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!388 = distinct !DISubprogram(name: "sendstatusmsg", scope: !328, file: !328, line: 98, type: !389, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !19, !6, null}
!391 = !DILocalVariable(name: "to", arg: 1, scope: !388, file: !328, line: 98, type: !19)
!392 = !DILocation(line: 0, scope: !388)
!393 = !DILocalVariable(name: "fmt", arg: 2, scope: !388, file: !328, line: 98, type: !6)
!394 = !DILocalVariable(name: "buffer", scope: !388, file: !328, line: 100, type: !395)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8000, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 1000)
!398 = !DILocation(line: 100, column: 8, scope: !388)
!399 = !DILocalVariable(name: "argp", scope: !388, file: !328, line: 102, type: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !401, line: 102, baseType: !402)
!401 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stdarg.h", directory: "")
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !401, line: 40, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 102, baseType: !404)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 192, elements: !67)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 102, size: 192, elements: !406)
!406 = !{!407, !408, !409, !410}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !405, file: !3, line: 102, baseType: !10, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !405, file: !3, line: 102, baseType: !10, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !405, file: !3, line: 102, baseType: !17, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !405, file: !3, line: 102, baseType: !17, size: 64, offset: 128)
!411 = !DILocation(line: 102, column: 11, scope: !388)
!412 = !DILocalVariable(name: "__cil_tmp7", scope: !388, file: !328, line: 104, type: !17)
!413 = !DILocation(line: 104, column: 9, scope: !388)
!414 = !DILocalVariable(name: "__cil_tmp8", scope: !388, file: !328, line: 105, type: !6)
!415 = !DILocation(line: 105, column: 9, scope: !388)
!416 = !DILocation(line: 105, column: 10, scope: !417)
!417 = distinct !DILexicalBlock(scope: !418, file: !328, line: 105, column: 7)
!418 = distinct !DILexicalBlock(scope: !388, file: !328, line: 107, column: 3)
!419 = !DILocation(line: 105, column: 7, scope: !418)
!420 = !DILocation(line: 106, column: 5, scope: !421)
!421 = distinct !DILexicalBlock(scope: !422, file: !328, line: 107, column: 5)
!422 = distinct !DILexicalBlock(scope: !423, file: !328, line: 106, column: 5)
!423 = distinct !DILexicalBlock(scope: !417, file: !328, line: 105, column: 16)
!424 = !DILocation(line: 107, column: 49, scope: !425)
!425 = distinct !DILexicalBlock(scope: !422, file: !328, line: 108, column: 5)
!426 = !DILocation(line: 108, column: 24, scope: !425)
!427 = !DILocation(line: 107, column: 14, scope: !425)
!428 = !DILocalVariable(name: "length", scope: !388, file: !328, line: 101, type: !19)
!429 = !DILocation(line: 108, column: 41, scope: !430)
!430 = distinct !DILexicalBlock(scope: !422, file: !328, line: 110, column: 5)
!431 = !DILocation(line: 108, column: 5, scope: !430)
!432 = !DILocation(line: 109, column: 34, scope: !433)
!433 = distinct !DILexicalBlock(scope: !422, file: !328, line: 110, column: 5)
!434 = !DILocation(line: 109, column: 11, scope: !433)
!435 = !DILocalVariable(name: "tmp", scope: !388, file: !328, line: 103, type: !8)
!436 = !DILocation(line: 109, column: 30, scope: !437)
!437 = distinct !DILexicalBlock(scope: !422, file: !328, line: 111, column: 5)
!438 = !DILocation(line: 109, column: 44, scope: !437)
!439 = !DILocation(line: 109, column: 5, scope: !437)
!440 = !DILocation(line: 110, column: 5, scope: !441)
!441 = distinct !DILexicalBlock(scope: !422, file: !328, line: 111, column: 5)
!442 = !DILocation(line: 113, column: 3, scope: !423)
!443 = !DILocation(line: 112, column: 3, scope: !418)
!444 = distinct !DISubprogram(name: "logmsg", scope: !328, file: !328, line: 175, type: !445, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !6, null}
!447 = !DILocalVariable(name: "fmt", arg: 1, scope: !444, file: !328, line: 175, type: !6)
!448 = !DILocation(line: 0, scope: !444)
!449 = !DILocalVariable(name: "argp", scope: !444, file: !328, line: 177, type: !400)
!450 = !DILocation(line: 177, column: 11, scope: !444)
!451 = !DILocation(line: 180, column: 3, scope: !452)
!452 = distinct !DILexicalBlock(scope: !453, file: !328, line: 181, column: 3)
!453 = distinct !DILexicalBlock(scope: !454, file: !328, line: 180, column: 3)
!454 = distinct !DILexicalBlock(scope: !444, file: !328, line: 179, column: 3)
!455 = !DILocation(line: 181, column: 23, scope: !456)
!456 = distinct !DILexicalBlock(scope: !453, file: !328, line: 182, column: 3)
!457 = !DILocation(line: 181, column: 3, scope: !456)
!458 = !DILocation(line: 182, column: 3, scope: !459)
!459 = distinct !DILexicalBlock(scope: !453, file: !328, line: 183, column: 3)
!460 = !DILocation(line: 183, column: 3, scope: !454)
!461 = distinct !DISubprogram(name: "printlogmsg", scope: !328, file: !328, line: 124, type: !462, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !19, !6, !464}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!465 = !DILocalVariable(name: "type", arg: 1, scope: !461, file: !328, line: 124, type: !19)
!466 = !DILocation(line: 0, scope: !461)
!467 = !DILocalVariable(name: "fmt", arg: 2, scope: !461, file: !328, line: 124, type: !6)
!468 = !DILocalVariable(name: "argp", arg: 3, scope: !461, file: !328, line: 124, type: !464)
!469 = !DILocalVariable(name: "buffer", scope: !461, file: !328, line: 126, type: !395)
!470 = !DILocation(line: 126, column: 8, scope: !461)
!471 = !DILocalVariable(name: "__cil_tmp16", scope: !461, file: !328, line: 138, type: !17)
!472 = !DILocation(line: 138, column: 9, scope: !461)
!473 = !DILocalVariable(name: "__cil_tmp17", scope: !461, file: !328, line: 139, type: !6)
!474 = !DILocation(line: 139, column: 9, scope: !461)
!475 = !DILocalVariable(name: "__cil_tmp18", scope: !461, file: !328, line: 140, type: !6)
!476 = !DILocation(line: 140, column: 9, scope: !461)
!477 = !DILocalVariable(name: "__cil_tmp19", scope: !461, file: !328, line: 141, type: !6)
!478 = !DILocation(line: 141, column: 9, scope: !461)
!479 = !DILocalVariable(name: "__cil_tmp20", scope: !461, file: !328, line: 142, type: !6)
!480 = !DILocation(line: 142, column: 9, scope: !461)
!481 = !DILocalVariable(name: "__cil_tmp21", scope: !461, file: !328, line: 143, type: !6)
!482 = !DILocation(line: 143, column: 9, scope: !461)
!483 = !DILocalVariable(name: "__cil_tmp22", scope: !461, file: !328, line: 144, type: !6)
!484 = !DILocation(line: 144, column: 9, scope: !461)
!485 = !DILocalVariable(name: "__cil_tmp23", scope: !461, file: !328, line: 145, type: !6)
!486 = !DILocation(line: 145, column: 9, scope: !461)
!487 = !DILocalVariable(name: "__cil_tmp24", scope: !461, file: !328, line: 146, type: !6)
!488 = !DILocation(line: 146, column: 9, scope: !461)
!489 = !DILocalVariable(name: "__cil_tmp25", scope: !461, file: !328, line: 147, type: !6)
!490 = !DILocation(line: 147, column: 9, scope: !461)
!491 = !DILocation(line: 130, column: 47, scope: !492)
!492 = distinct !DILexicalBlock(scope: !493, file: !328, line: 151, column: 3)
!493 = distinct !DILexicalBlock(scope: !494, file: !328, line: 150, column: 3)
!494 = distinct !DILexicalBlock(scope: !461, file: !328, line: 149, column: 3)
!495 = !DILocation(line: 130, column: 12, scope: !492)
!496 = !DILocalVariable(name: "length", scope: !461, file: !328, line: 127, type: !19)
!497 = !DILocation(line: 131, column: 39, scope: !498)
!498 = distinct !DILexicalBlock(scope: !493, file: !328, line: 133, column: 3)
!499 = !DILocation(line: 131, column: 3, scope: !498)
!500 = !DILocation(line: 134, column: 15, scope: !501)
!501 = distinct !DILexicalBlock(scope: !494, file: !328, line: 134, column: 7)
!502 = !DILocation(line: 134, column: 9, scope: !501)
!503 = !DILocation(line: 134, column: 7, scope: !494)
!504 = !DILocation(line: 135, column: 14, scope: !505)
!505 = distinct !DILexicalBlock(scope: !506, file: !328, line: 135, column: 9)
!506 = distinct !DILexicalBlock(scope: !501, file: !328, line: 134, column: 22)
!507 = !DILocation(line: 135, column: 9, scope: !506)
!508 = !DILocation(line: 136, column: 23, scope: !509)
!509 = distinct !DILexicalBlock(scope: !510, file: !328, line: 137, column: 7)
!510 = distinct !DILexicalBlock(scope: !511, file: !328, line: 136, column: 7)
!511 = distinct !DILexicalBlock(scope: !505, file: !328, line: 135, column: 20)
!512 = !DILocation(line: 136, column: 7, scope: !509)
!513 = !DILocation(line: 139, column: 5, scope: !511)
!514 = !DILocation(line: 137, column: 14, scope: !515)
!515 = distinct !DILexicalBlock(scope: !505, file: !328, line: 137, column: 9)
!516 = !DILocation(line: 137, column: 9, scope: !505)
!517 = !DILocation(line: 138, column: 23, scope: !518)
!518 = distinct !DILexicalBlock(scope: !519, file: !328, line: 139, column: 7)
!519 = distinct !DILexicalBlock(scope: !520, file: !328, line: 138, column: 7)
!520 = distinct !DILexicalBlock(scope: !515, file: !328, line: 137, column: 20)
!521 = !DILocation(line: 138, column: 7, scope: !518)
!522 = !DILocation(line: 141, column: 5, scope: !520)
!523 = !DILocation(line: 139, column: 14, scope: !524)
!524 = distinct !DILexicalBlock(scope: !515, file: !328, line: 139, column: 9)
!525 = !DILocation(line: 139, column: 9, scope: !515)
!526 = !DILocation(line: 140, column: 17, scope: !527)
!527 = distinct !DILexicalBlock(scope: !528, file: !328, line: 141, column: 7)
!528 = distinct !DILexicalBlock(scope: !529, file: !328, line: 140, column: 7)
!529 = distinct !DILexicalBlock(scope: !524, file: !328, line: 139, column: 20)
!530 = !DILocalVariable(name: "tmp___1", scope: !461, file: !328, line: 130, type: !207)
!531 = !DILocation(line: 140, column: 11, scope: !532)
!532 = distinct !DILexicalBlock(scope: !529, file: !328, line: 140, column: 11)
!533 = !DILocation(line: 140, column: 20, scope: !532)
!534 = !DILocation(line: 140, column: 11, scope: !529)
!535 = !DILocation(line: 141, column: 15, scope: !536)
!536 = distinct !DILexicalBlock(scope: !537, file: !328, line: 142, column: 9)
!537 = distinct !DILexicalBlock(scope: !538, file: !328, line: 141, column: 9)
!538 = distinct !DILexicalBlock(scope: !532, file: !328, line: 140, column: 26)
!539 = !DILocalVariable(name: "tmp", scope: !461, file: !328, line: 128, type: !207)
!540 = !DILocation(line: 141, column: 28, scope: !541)
!541 = distinct !DILexicalBlock(scope: !537, file: !328, line: 143, column: 9)
!542 = !DILocation(line: 141, column: 19, scope: !541)
!543 = !DILocalVariable(name: "tmp___0", scope: !461, file: !328, line: 129, type: !6)
!544 = !DILocation(line: 141, column: 43, scope: !545)
!545 = distinct !DILexicalBlock(scope: !537, file: !328, line: 143, column: 9)
!546 = !DILocation(line: 141, column: 9, scope: !545)
!547 = !DILocation(line: 144, column: 7, scope: !538)
!548 = !DILocation(line: 144, column: 32, scope: !549)
!549 = distinct !DILexicalBlock(scope: !550, file: !328, line: 146, column: 9)
!550 = distinct !DILexicalBlock(scope: !551, file: !328, line: 145, column: 9)
!551 = distinct !DILexicalBlock(scope: !532, file: !328, line: 144, column: 14)
!552 = !DILocation(line: 144, column: 9, scope: !549)
!553 = !DILocation(line: 145, column: 7, scope: !554)
!554 = distinct !DILexicalBlock(scope: !555, file: !328, line: 149, column: 7)
!555 = distinct !DILexicalBlock(scope: !529, file: !328, line: 148, column: 7)
!556 = !DILocation(line: 147, column: 5, scope: !506)
!557 = !DILocation(line: 151, column: 12, scope: !558)
!558 = distinct !DILexicalBlock(scope: !494, file: !328, line: 151, column: 7)
!559 = !DILocation(line: 151, column: 7, scope: !494)
!560 = !DILocation(line: 152, column: 15, scope: !561)
!561 = distinct !DILexicalBlock(scope: !562, file: !328, line: 153, column: 5)
!562 = distinct !DILexicalBlock(scope: !563, file: !328, line: 152, column: 5)
!563 = distinct !DILexicalBlock(scope: !558, file: !328, line: 151, column: 18)
!564 = !DILocalVariable(name: "tmp___2", scope: !461, file: !328, line: 131, type: !153)
!565 = !DILocation(line: 152, column: 69, scope: !566)
!566 = distinct !DILexicalBlock(scope: !562, file: !328, line: 154, column: 5)
!567 = !DILocation(line: 152, column: 5, scope: !566)
!568 = !DILocation(line: 155, column: 3, scope: !563)
!569 = !DILocation(line: 153, column: 12, scope: !570)
!570 = distinct !DILexicalBlock(scope: !558, file: !328, line: 153, column: 7)
!571 = !DILocation(line: 153, column: 7, scope: !558)
!572 = !DILocation(line: 154, column: 15, scope: !573)
!573 = distinct !DILexicalBlock(scope: !574, file: !328, line: 155, column: 5)
!574 = distinct !DILexicalBlock(scope: !575, file: !328, line: 154, column: 5)
!575 = distinct !DILexicalBlock(scope: !570, file: !328, line: 153, column: 18)
!576 = !DILocalVariable(name: "tmp___3", scope: !461, file: !328, line: 132, type: !153)
!577 = !DILocation(line: 154, column: 69, scope: !578)
!578 = distinct !DILexicalBlock(scope: !574, file: !328, line: 156, column: 5)
!579 = !DILocation(line: 154, column: 5, scope: !578)
!580 = !DILocation(line: 157, column: 3, scope: !575)
!581 = !DILocation(line: 155, column: 12, scope: !582)
!582 = distinct !DILexicalBlock(scope: !570, file: !328, line: 155, column: 7)
!583 = !DILocation(line: 155, column: 7, scope: !570)
!584 = !DILocation(line: 156, column: 15, scope: !585)
!585 = distinct !DILexicalBlock(scope: !586, file: !328, line: 157, column: 5)
!586 = distinct !DILexicalBlock(scope: !587, file: !328, line: 156, column: 5)
!587 = distinct !DILexicalBlock(scope: !582, file: !328, line: 155, column: 18)
!588 = !DILocalVariable(name: "tmp___8", scope: !461, file: !328, line: 137, type: !207)
!589 = !DILocation(line: 156, column: 9, scope: !590)
!590 = distinct !DILexicalBlock(scope: !587, file: !328, line: 156, column: 9)
!591 = !DILocation(line: 156, column: 18, scope: !590)
!592 = !DILocation(line: 156, column: 9, scope: !587)
!593 = !DILocation(line: 157, column: 17, scope: !594)
!594 = distinct !DILexicalBlock(scope: !595, file: !328, line: 158, column: 7)
!595 = distinct !DILexicalBlock(scope: !596, file: !328, line: 157, column: 7)
!596 = distinct !DILexicalBlock(scope: !590, file: !328, line: 156, column: 24)
!597 = !DILocalVariable(name: "tmp___4", scope: !461, file: !328, line: 133, type: !207)
!598 = !DILocation(line: 157, column: 26, scope: !599)
!599 = distinct !DILexicalBlock(scope: !595, file: !328, line: 159, column: 7)
!600 = !DILocation(line: 157, column: 17, scope: !599)
!601 = !DILocalVariable(name: "tmp___5", scope: !461, file: !328, line: 134, type: !6)
!602 = !DILocation(line: 157, column: 17, scope: !603)
!603 = distinct !DILexicalBlock(scope: !595, file: !328, line: 159, column: 7)
!604 = !DILocalVariable(name: "tmp___6", scope: !461, file: !328, line: 135, type: !153)
!605 = !DILocation(line: 158, column: 23, scope: !606)
!606 = distinct !DILexicalBlock(scope: !595, file: !328, line: 159, column: 7)
!607 = !DILocation(line: 157, column: 7, scope: !606)
!608 = !DILocation(line: 161, column: 5, scope: !596)
!609 = !DILocation(line: 160, column: 17, scope: !610)
!610 = distinct !DILexicalBlock(scope: !611, file: !328, line: 163, column: 7)
!611 = distinct !DILexicalBlock(scope: !612, file: !328, line: 162, column: 7)
!612 = distinct !DILexicalBlock(scope: !590, file: !328, line: 161, column: 12)
!613 = !DILocalVariable(name: "tmp___7", scope: !461, file: !328, line: 136, type: !153)
!614 = !DILocation(line: 160, column: 71, scope: !615)
!615 = distinct !DILexicalBlock(scope: !611, file: !328, line: 162, column: 7)
!616 = !DILocation(line: 160, column: 7, scope: !615)
!617 = !DILocation(line: 161, column: 5, scope: !618)
!618 = distinct !DILexicalBlock(scope: !619, file: !328, line: 165, column: 5)
!619 = distinct !DILexicalBlock(scope: !587, file: !328, line: 164, column: 5)
!620 = !DILocation(line: 163, column: 10, scope: !621)
!621 = distinct !DILexicalBlock(scope: !622, file: !328, line: 166, column: 3)
!622 = distinct !DILexicalBlock(scope: !494, file: !328, line: 165, column: 3)
!623 = !DILocation(line: 163, column: 3, scope: !621)
!624 = !DILocation(line: 164, column: 3, scope: !494)
!625 = !DILocation(line: 166, column: 1, scope: !461)
!626 = distinct !DISubprogram(name: "debug", scope: !328, file: !328, line: 199, type: !389, scopeLine: 200, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!627 = !DILocalVariable(name: "priority", arg: 1, scope: !626, file: !328, line: 199, type: !19)
!628 = !DILocation(line: 0, scope: !626)
!629 = !DILocalVariable(name: "fmt", arg: 2, scope: !626, file: !328, line: 199, type: !6)
!630 = !DILocalVariable(name: "argp", scope: !626, file: !328, line: 201, type: !400)
!631 = !DILocation(line: 201, column: 11, scope: !626)
!632 = !DILocation(line: 204, column: 24, scope: !633)
!633 = distinct !DILexicalBlock(scope: !634, file: !328, line: 204, column: 7)
!634 = distinct !DILexicalBlock(scope: !626, file: !328, line: 203, column: 3)
!635 = !DILocation(line: 204, column: 16, scope: !633)
!636 = !DILocation(line: 204, column: 7, scope: !634)
!637 = !DILocation(line: 205, column: 5, scope: !638)
!638 = distinct !DILexicalBlock(scope: !633, file: !328, line: 204, column: 36)
!639 = !DILocation(line: 207, column: 3, scope: !640)
!640 = distinct !DILexicalBlock(scope: !641, file: !328, line: 208, column: 3)
!641 = distinct !DILexicalBlock(scope: !634, file: !328, line: 207, column: 3)
!642 = !DILocation(line: 208, column: 23, scope: !643)
!643 = distinct !DILexicalBlock(scope: !641, file: !328, line: 209, column: 3)
!644 = !DILocation(line: 208, column: 3, scope: !643)
!645 = !DILocation(line: 209, column: 3, scope: !646)
!646 = distinct !DILexicalBlock(scope: !641, file: !328, line: 210, column: 3)
!647 = !DILocation(line: 210, column: 3, scope: !634)
!648 = !DILocation(line: 212, column: 1, scope: !626)
!649 = distinct !DISubprogram(name: "die", scope: !328, file: !328, line: 222, type: !445, scopeLine: 223, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!650 = !DILocalVariable(name: "fmt", arg: 1, scope: !649, file: !328, line: 222, type: !6)
!651 = !DILocation(line: 0, scope: !649)
!652 = !DILocalVariable(name: "argp", scope: !649, file: !328, line: 224, type: !400)
!653 = !DILocation(line: 224, column: 11, scope: !649)
!654 = !DILocation(line: 227, column: 3, scope: !655)
!655 = distinct !DILexicalBlock(scope: !656, file: !328, line: 228, column: 3)
!656 = distinct !DILexicalBlock(scope: !657, file: !328, line: 227, column: 3)
!657 = distinct !DILexicalBlock(scope: !649, file: !328, line: 226, column: 3)
!658 = !DILocation(line: 228, column: 23, scope: !659)
!659 = distinct !DILexicalBlock(scope: !656, file: !328, line: 229, column: 3)
!660 = !DILocation(line: 228, column: 3, scope: !659)
!661 = !DILocation(line: 229, column: 3, scope: !662)
!662 = distinct !DILexicalBlock(scope: !656, file: !328, line: 230, column: 3)
!663 = !DILocation(line: 230, column: 3, scope: !657)
!664 = distinct !DISubprogram(name: "mgetcwd", scope: !328, file: !328, line: 252, type: !665, scopeLine: 253, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!665 = !DISubroutineType(types: !666)
!666 = !{!6}
!667 = !DILocalVariable(name: "size", scope: !664, file: !328, line: 254, type: !8)
!668 = !DILocation(line: 254, column: 10, scope: !664)
!669 = !DILocalVariable(name: "buffer", scope: !664, file: !328, line: 255, type: !6)
!670 = !DILocation(line: 255, column: 9, scope: !664)
!671 = !DILocalVariable(name: "__cil_tmp6", scope: !664, file: !328, line: 259, type: !6)
!672 = !DILocation(line: 259, column: 9, scope: !664)
!673 = !DILocation(line: 255, column: 8, scope: !674)
!674 = distinct !DILexicalBlock(scope: !675, file: !328, line: 262, column: 3)
!675 = distinct !DILexicalBlock(scope: !664, file: !328, line: 261, column: 3)
!676 = !DILocation(line: 256, column: 16, scope: !677)
!677 = distinct !DILexicalBlock(scope: !674, file: !328, line: 256, column: 3)
!678 = !DILocation(line: 256, column: 9, scope: !677)
!679 = !DILocalVariable(name: "tmp", scope: !664, file: !328, line: 256, type: !17)
!680 = !DILocation(line: 0, scope: !664)
!681 = !DILocation(line: 256, column: 10, scope: !674)
!682 = !DILocation(line: 258, column: 3, scope: !683)
!683 = distinct !DILexicalBlock(scope: !684, file: !328, line: 259, column: 3)
!684 = distinct !DILexicalBlock(scope: !675, file: !328, line: 258, column: 3)
!685 = !DILocation(line: 258, column: 13, scope: !683)
!686 = !DILocation(line: 259, column: 22, scope: !687)
!687 = distinct !DILexicalBlock(scope: !688, file: !328, line: 262, column: 5)
!688 = distinct !DILexicalBlock(scope: !689, file: !328, line: 261, column: 5)
!689 = distinct !DILexicalBlock(scope: !683, file: !328, line: 258, column: 13)
!690 = !DILocation(line: 259, column: 30, scope: !687)
!691 = !DILocation(line: 259, column: 15, scope: !687)
!692 = !DILocalVariable(name: "tmp___0", scope: !664, file: !328, line: 257, type: !6)
!693 = !DILocation(line: 259, column: 9, scope: !694)
!694 = distinct !DILexicalBlock(scope: !689, file: !328, line: 259, column: 9)
!695 = !DILocation(line: 259, column: 52, scope: !694)
!696 = !DILocation(line: 259, column: 36, scope: !694)
!697 = !DILocation(line: 259, column: 33, scope: !694)
!698 = !DILocation(line: 259, column: 9, scope: !689)
!699 = !DILocation(line: 260, column: 15, scope: !700)
!700 = distinct !DILexicalBlock(scope: !694, file: !328, line: 259, column: 60)
!701 = !DILocation(line: 260, column: 7, scope: !700)
!702 = !DILocation(line: 261, column: 15, scope: !703)
!703 = distinct !DILexicalBlock(scope: !704, file: !328, line: 263, column: 5)
!704 = distinct !DILexicalBlock(scope: !689, file: !328, line: 262, column: 5)
!705 = !DILocalVariable(name: "tmp___1", scope: !664, file: !328, line: 258, type: !207)
!706 = !DILocation(line: 261, column: 9, scope: !707)
!707 = distinct !DILexicalBlock(scope: !689, file: !328, line: 261, column: 9)
!708 = !DILocation(line: 261, column: 18, scope: !707)
!709 = !DILocation(line: 261, column: 9, scope: !689)
!710 = !DILocation(line: 262, column: 7, scope: !711)
!711 = distinct !DILexicalBlock(scope: !712, file: !328, line: 263, column: 7)
!712 = distinct !DILexicalBlock(scope: !713, file: !328, line: 262, column: 7)
!713 = distinct !DILexicalBlock(scope: !707, file: !328, line: 261, column: 25)
!714 = !DILocation(line: 265, column: 5, scope: !713)
!715 = !DILocation(line: 263, column: 5, scope: !716)
!716 = distinct !DILexicalBlock(scope: !717, file: !328, line: 267, column: 5)
!717 = distinct !DILexicalBlock(scope: !689, file: !328, line: 266, column: 5)
!718 = distinct !{!718, !682, !719}
!719 = !DILocation(line: 266, column: 3, scope: !683)
!720 = !DILocation(line: 268, column: 3, scope: !683)
!721 = !DILocation(line: 272, column: 1, scope: !664)
!722 = distinct !DISubprogram(name: "expandmalloc", scope: !328, file: !328, line: 233, type: !723, scopeLine: 234, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !16, !725, !19}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!726 = !DILocalVariable(name: "old", arg: 1, scope: !722, file: !328, line: 233, type: !16)
!727 = !DILocation(line: 0, scope: !722)
!728 = !DILocalVariable(name: "size", arg: 2, scope: !722, file: !328, line: 233, type: !725)
!729 = !DILocalVariable(name: "line", arg: 3, scope: !722, file: !328, line: 233, type: !19)
!730 = !DILocalVariable(name: "__cil_tmp4", scope: !722, file: !328, line: 235, type: !6)
!731 = !DILocation(line: 235, column: 9, scope: !722)
!732 = !DILocalVariable(name: "__cil_tmp5", scope: !722, file: !328, line: 236, type: !6)
!733 = !DILocation(line: 236, column: 9, scope: !722)
!734 = !DILocation(line: 235, column: 9, scope: !735)
!735 = distinct !DILexicalBlock(scope: !736, file: !328, line: 239, column: 3)
!736 = distinct !DILexicalBlock(scope: !722, file: !328, line: 238, column: 3)
!737 = !DILocation(line: 237, column: 9, scope: !738)
!738 = distinct !DILexicalBlock(scope: !735, file: !328, line: 236, column: 3)
!739 = !DILocation(line: 237, column: 16, scope: !738)
!740 = !DILocation(line: 236, column: 3, scope: !738)
!741 = !DILocation(line: 238, column: 18, scope: !742)
!742 = distinct !DILexicalBlock(scope: !735, file: !328, line: 239, column: 3)
!743 = !DILocation(line: 238, column: 24, scope: !742)
!744 = !DILocation(line: 238, column: 10, scope: !742)
!745 = !DILocation(line: 238, column: 8, scope: !742)
!746 = !DILocation(line: 239, column: 23, scope: !747)
!747 = distinct !DILexicalBlock(scope: !736, file: !328, line: 239, column: 7)
!748 = !DILocation(line: 239, column: 7, scope: !747)
!749 = !DILocation(line: 239, column: 28, scope: !747)
!750 = !DILocation(line: 239, column: 7, scope: !736)
!751 = !DILocation(line: 240, column: 5, scope: !752)
!752 = distinct !DILexicalBlock(scope: !753, file: !328, line: 241, column: 5)
!753 = distinct !DILexicalBlock(scope: !754, file: !328, line: 240, column: 5)
!754 = distinct !DILexicalBlock(scope: !747, file: !328, line: 239, column: 60)
!755 = !DILocation(line: 243, column: 3, scope: !754)
!756 = !DILocation(line: 241, column: 3, scope: !736)
!757 = distinct !DISubprogram(name: "itoa", scope: !328, file: !328, line: 275, type: !758, scopeLine: 276, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!758 = !DISubroutineType(types: !759)
!759 = !{!6, !19}
!760 = !DILocalVariable(name: "integer", arg: 1, scope: !757, file: !328, line: 275, type: !19)
!761 = !DILocation(line: 0, scope: !757)
!762 = !DILocalVariable(name: "__cil_tmp6", scope: !757, file: !328, line: 281, type: !6)
!763 = !DILocation(line: 281, column: 9, scope: !757)
!764 = !DILocalVariable(name: "tmp", scope: !757, file: !328, line: 277, type: !19)
!765 = !DILocation(line: 281, column: 15, scope: !766)
!766 = distinct !DILexicalBlock(scope: !767, file: !328, line: 281, column: 7)
!767 = distinct !DILexicalBlock(scope: !757, file: !328, line: 283, column: 3)
!768 = !DILocation(line: 281, column: 7, scope: !767)
!769 = !DILocalVariable(name: "size", scope: !757, file: !328, line: 278, type: !19)
!770 = !DILocation(line: 283, column: 3, scope: !771)
!771 = distinct !DILexicalBlock(scope: !766, file: !328, line: 281, column: 21)
!772 = !DILocation(line: 283, column: 15, scope: !773)
!773 = distinct !DILexicalBlock(scope: !766, file: !328, line: 283, column: 7)
!774 = !DILocation(line: 283, column: 7, scope: !766)
!775 = !DILocation(line: 285, column: 3, scope: !776)
!776 = distinct !DILexicalBlock(scope: !773, file: !328, line: 283, column: 20)
!777 = !DILocation(line: 285, column: 15, scope: !778)
!778 = distinct !DILexicalBlock(scope: !773, file: !328, line: 285, column: 7)
!779 = !DILocation(line: 285, column: 7, scope: !773)
!780 = !DILocation(line: 287, column: 3, scope: !781)
!781 = distinct !DILexicalBlock(scope: !778, file: !328, line: 285, column: 20)
!782 = !DILocation(line: 0, scope: !773)
!783 = !DILocation(line: 0, scope: !766)
!784 = !DILocation(line: 288, column: 3, scope: !785)
!785 = distinct !DILexicalBlock(scope: !786, file: !328, line: 289, column: 3)
!786 = distinct !DILexicalBlock(scope: !767, file: !328, line: 288, column: 3)
!787 = !DILocation(line: 0, scope: !767)
!788 = !DILocation(line: 288, column: 13, scope: !785)
!789 = !DILocation(line: 288, column: 11, scope: !790)
!790 = distinct !DILexicalBlock(scope: !791, file: !328, line: 288, column: 9)
!791 = distinct !DILexicalBlock(scope: !785, file: !328, line: 288, column: 13)
!792 = !DILocation(line: 288, column: 9, scope: !791)
!793 = !DILocation(line: 288, column: 7, scope: !794)
!794 = distinct !DILexicalBlock(scope: !790, file: !328, line: 288, column: 16)
!795 = !DILocation(line: 289, column: 9, scope: !791)
!796 = !DILocation(line: 290, column: 10, scope: !791)
!797 = distinct !{!797, !784, !798}
!798 = !DILocation(line: 291, column: 3, scope: !785)
!799 = !DILocation(line: 293, column: 3, scope: !785)
!800 = !DILocation(line: 293, column: 13, scope: !801)
!801 = distinct !DILexicalBlock(scope: !802, file: !328, line: 297, column: 3)
!802 = distinct !DILexicalBlock(scope: !767, file: !328, line: 296, column: 3)
!803 = !DILocalVariable(name: "tmp___0", scope: !757, file: !328, line: 280, type: !17)
!804 = !DILocalVariable(name: "result___1", scope: !757, file: !328, line: 279, type: !6)
!805 = !DILocation(line: 294, column: 3, scope: !806)
!806 = distinct !DILexicalBlock(scope: !802, file: !328, line: 294, column: 3)
!807 = !DILocation(line: 295, column: 3, scope: !767)
!808 = distinct !DISubprogram(name: "urlencode", scope: !328, file: !328, line: 369, type: !809, scopeLine: 370, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!809 = !DISubroutineType(types: !810)
!810 = !{!6, !6}
!811 = !DILocalVariable(name: "toencode", arg: 1, scope: !808, file: !328, line: 369, type: !6)
!812 = !DILocation(line: 0, scope: !808)
!813 = !DILocation(line: 371, column: 9, scope: !814)
!814 = distinct !DILexicalBlock(scope: !815, file: !328, line: 375, column: 3)
!815 = distinct !DILexicalBlock(scope: !816, file: !328, line: 374, column: 3)
!816 = distinct !DILexicalBlock(scope: !808, file: !328, line: 373, column: 3)
!817 = !DILocalVariable(name: "tmp", scope: !808, file: !328, line: 371, type: !6)
!818 = !DILocation(line: 371, column: 3, scope: !816)
!819 = distinct !DISubprogram(name: "commonencode", scope: !328, file: !328, line: 307, type: !820, scopeLine: 308, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!820 = !DISubroutineType(types: !821)
!821 = !{!6, !6, !18}
!822 = !DILocalVariable(name: "toencode", arg: 1, scope: !819, file: !328, line: 307, type: !6)
!823 = !DILocation(line: 0, scope: !819)
!824 = !DILocalVariable(name: "url", arg: 2, scope: !819, file: !328, line: 307, type: !18)
!825 = !DILocalVariable(name: "retval", scope: !819, file: !328, line: 318, type: !6)
!826 = !DILocation(line: 318, column: 9, scope: !819)
!827 = !DILocalVariable(name: "buffer", scope: !819, file: !328, line: 319, type: !828)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 24, elements: !829)
!829 = !{!381}
!830 = !DILocation(line: 319, column: 8, scope: !819)
!831 = !DILocalVariable(name: "size", scope: !819, file: !328, line: 320, type: !8)
!832 = !DILocation(line: 320, column: 10, scope: !819)
!833 = !DILocalVariable(name: "__cil_tmp21", scope: !819, file: !328, line: 327, type: !17)
!834 = !DILocation(line: 327, column: 9, scope: !819)
!835 = !DILocalVariable(name: "__cil_tmp22", scope: !819, file: !328, line: 328, type: !6)
!836 = !DILocation(line: 328, column: 9, scope: !819)
!837 = !DILocalVariable(name: "__cil_tmp23", scope: !819, file: !328, line: 329, type: !6)
!838 = !DILocation(line: 329, column: 9, scope: !819)
!839 = !DILocalVariable(name: "__cil_tmp24", scope: !819, file: !328, line: 330, type: !6)
!840 = !DILocation(line: 330, column: 9, scope: !819)
!841 = !DILocalVariable(name: "__cil_tmp25", scope: !819, file: !328, line: 331, type: !6)
!842 = !DILocation(line: 331, column: 9, scope: !819)
!843 = !DILocalVariable(name: "__cil_tmp26", scope: !819, file: !328, line: 332, type: !6)
!844 = !DILocation(line: 332, column: 9, scope: !819)
!845 = !DILocalVariable(name: "__cil_tmp27", scope: !819, file: !328, line: 333, type: !6)
!846 = !DILocation(line: 333, column: 9, scope: !819)
!847 = !DILocalVariable(name: "__cil_tmp28", scope: !819, file: !328, line: 334, type: !6)
!848 = !DILocation(line: 334, column: 9, scope: !819)
!849 = !DILocalVariable(name: "validchars", scope: !819, file: !328, line: 309, type: !6)
!850 = !DILocalVariable(name: "urlprefix", scope: !819, file: !328, line: 310, type: !6)
!851 = !DILocalVariable(name: "htmlprefix", scope: !819, file: !328, line: 311, type: !6)
!852 = !DILocalVariable(name: "urlsuffix", scope: !819, file: !328, line: 312, type: !6)
!853 = !DILocalVariable(name: "htmlsuffix", scope: !819, file: !328, line: 313, type: !6)
!854 = !DILocation(line: 320, column: 8, scope: !855)
!855 = distinct !DILexicalBlock(scope: !819, file: !328, line: 336, column: 3)
!856 = !DILocalVariable(name: "used", scope: !819, file: !328, line: 321, type: !8)
!857 = !DILocation(line: 323, column: 7, scope: !858)
!858 = distinct !DILexicalBlock(scope: !855, file: !328, line: 323, column: 7)
!859 = !DILocation(line: 323, column: 7, scope: !855)
!860 = !DILocalVariable(name: "prefix", scope: !819, file: !328, line: 314, type: !6)
!861 = !DILocalVariable(name: "suffix", scope: !819, file: !328, line: 315, type: !6)
!862 = !DILocation(line: 326, column: 3, scope: !863)
!863 = distinct !DILexicalBlock(scope: !858, file: !328, line: 323, column: 12)
!864 = !DILocation(line: 0, scope: !858)
!865 = !DILocation(line: 331, column: 20, scope: !866)
!866 = distinct !DILexicalBlock(scope: !867, file: !328, line: 331, column: 3)
!867 = distinct !DILexicalBlock(scope: !855, file: !328, line: 330, column: 3)
!868 = !DILocation(line: 331, column: 13, scope: !866)
!869 = !DILocalVariable(name: "tmp___0", scope: !819, file: !328, line: 322, type: !17)
!870 = !DILocation(line: 331, column: 10, scope: !867)
!871 = !DILocation(line: 332, column: 23, scope: !872)
!872 = distinct !DILexicalBlock(scope: !855, file: !328, line: 332, column: 7)
!873 = !DILocation(line: 332, column: 7, scope: !872)
!874 = !DILocation(line: 332, column: 30, scope: !872)
!875 = !DILocation(line: 332, column: 7, scope: !855)
!876 = !DILocation(line: 333, column: 5, scope: !877)
!877 = distinct !DILexicalBlock(scope: !878, file: !328, line: 334, column: 5)
!878 = distinct !DILexicalBlock(scope: !879, file: !328, line: 333, column: 5)
!879 = distinct !DILexicalBlock(scope: !872, file: !328, line: 332, column: 62)
!880 = !DILocation(line: 336, column: 3, scope: !879)
!881 = !DILocation(line: 334, column: 4, scope: !855)
!882 = !DILocation(line: 334, column: 11, scope: !855)
!883 = !DILocalVariable(name: "tmp", scope: !819, file: !328, line: 316, type: !6)
!884 = !DILocation(line: 336, column: 3, scope: !885)
!885 = distinct !DILexicalBlock(scope: !886, file: !328, line: 338, column: 3)
!886 = distinct !DILexicalBlock(scope: !855, file: !328, line: 337, column: 3)
!887 = !DILocation(line: 0, scope: !855)
!888 = !DILocation(line: 336, column: 13, scope: !885)
!889 = !DILocation(line: 336, column: 18, scope: !890)
!890 = distinct !DILexicalBlock(scope: !891, file: !328, line: 336, column: 9)
!891 = distinct !DILexicalBlock(scope: !885, file: !328, line: 336, column: 13)
!892 = !DILocation(line: 336, column: 12, scope: !890)
!893 = !DILocation(line: 336, column: 23, scope: !890)
!894 = !DILocation(line: 336, column: 9, scope: !891)
!895 = !DILocation(line: 336, column: 7, scope: !896)
!896 = distinct !DILexicalBlock(scope: !890, file: !328, line: 336, column: 30)
!897 = !DILocation(line: 337, column: 15, scope: !898)
!898 = distinct !DILexicalBlock(scope: !899, file: !328, line: 339, column: 5)
!899 = distinct !DILexicalBlock(scope: !891, file: !328, line: 338, column: 5)
!900 = !DILocalVariable(name: "tmp___1", scope: !819, file: !328, line: 323, type: !8)
!901 = !DILocation(line: 337, column: 15, scope: !902)
!902 = distinct !DILexicalBlock(scope: !899, file: !328, line: 339, column: 5)
!903 = !DILocalVariable(name: "tmp___2", scope: !819, file: !328, line: 324, type: !8)
!904 = !DILocation(line: 337, column: 9, scope: !905)
!905 = distinct !DILexicalBlock(scope: !891, file: !328, line: 337, column: 9)
!906 = !DILocation(line: 337, column: 14, scope: !905)
!907 = !DILocation(line: 337, column: 32, scope: !905)
!908 = !DILocation(line: 337, column: 38, scope: !905)
!909 = !DILocation(line: 337, column: 21, scope: !905)
!910 = !DILocation(line: 337, column: 9, scope: !891)
!911 = !DILocation(line: 338, column: 7, scope: !912)
!912 = distinct !DILexicalBlock(scope: !913, file: !328, line: 339, column: 7)
!913 = distinct !DILexicalBlock(scope: !914, file: !328, line: 338, column: 7)
!914 = distinct !DILexicalBlock(scope: !905, file: !328, line: 337, column: 49)
!915 = !DILocation(line: 341, column: 5, scope: !914)
!916 = !DILocalVariable(name: "tmp2", scope: !819, file: !328, line: 317, type: !6)
!917 = !DILocation(line: 339, column: 5, scope: !918)
!918 = distinct !DILexicalBlock(scope: !919, file: !328, line: 341, column: 5)
!919 = distinct !DILexicalBlock(scope: !891, file: !328, line: 340, column: 5)
!920 = !DILocation(line: 0, scope: !891)
!921 = !DILocation(line: 339, column: 15, scope: !918)
!922 = !DILocation(line: 339, column: 20, scope: !923)
!923 = distinct !DILexicalBlock(scope: !924, file: !328, line: 339, column: 11)
!924 = distinct !DILexicalBlock(scope: !918, file: !328, line: 339, column: 15)
!925 = !DILocation(line: 339, column: 14, scope: !923)
!926 = !DILocation(line: 339, column: 26, scope: !923)
!927 = !DILocation(line: 339, column: 11, scope: !924)
!928 = !DILocation(line: 339, column: 9, scope: !929)
!929 = distinct !DILexicalBlock(scope: !923, file: !328, line: 339, column: 33)
!930 = !DILocation(line: 340, column: 17, scope: !931)
!931 = distinct !DILexicalBlock(scope: !924, file: !328, line: 340, column: 11)
!932 = !DILocation(line: 340, column: 11, scope: !931)
!933 = !DILocation(line: 340, column: 31, scope: !931)
!934 = !DILocation(line: 340, column: 25, scope: !931)
!935 = !DILocation(line: 340, column: 22, scope: !931)
!936 = !DILocation(line: 340, column: 11, scope: !924)
!937 = !DILocation(line: 341, column: 9, scope: !938)
!938 = distinct !DILexicalBlock(scope: !931, file: !328, line: 340, column: 38)
!939 = !DILocation(line: 339, column: 12, scope: !924)
!940 = distinct !{!940, !917, !941}
!941 = !DILocation(line: 340, column: 5, scope: !918)
!942 = !DILocation(line: 342, column: 5, scope: !918)
!943 = !DILocation(line: 344, column: 15, scope: !944)
!944 = distinct !DILexicalBlock(scope: !891, file: !328, line: 344, column: 9)
!945 = !DILocation(line: 344, column: 9, scope: !944)
!946 = !DILocation(line: 344, column: 21, scope: !944)
!947 = !DILocation(line: 344, column: 9, scope: !891)
!948 = !DILocation(line: 345, column: 19, scope: !949)
!949 = distinct !DILexicalBlock(scope: !950, file: !328, line: 345, column: 7)
!950 = distinct !DILexicalBlock(scope: !944, file: !328, line: 344, column: 27)
!951 = !DILocation(line: 345, column: 7, scope: !949)
!952 = !DILocation(line: 345, column: 17, scope: !949)
!953 = !DILocation(line: 346, column: 7, scope: !949)
!954 = !DILocation(line: 346, column: 17, scope: !949)
!955 = !DILocation(line: 347, column: 39, scope: !956)
!956 = distinct !DILexicalBlock(scope: !949, file: !328, line: 347, column: 7)
!957 = !DILocation(line: 347, column: 80, scope: !956)
!958 = !DILocation(line: 347, column: 7, scope: !956)
!959 = !DILocation(line: 348, column: 12, scope: !949)
!960 = !DILocation(line: 350, column: 5, scope: !950)
!961 = !DILocation(line: 350, column: 41, scope: !962)
!962 = distinct !DILexicalBlock(scope: !963, file: !328, line: 352, column: 7)
!963 = distinct !DILexicalBlock(scope: !964, file: !328, line: 351, column: 7)
!964 = distinct !DILexicalBlock(scope: !944, file: !328, line: 350, column: 12)
!965 = !DILocation(line: 351, column: 39, scope: !962)
!966 = !DILocation(line: 351, column: 16, scope: !962)
!967 = !DILocation(line: 350, column: 7, scope: !962)
!968 = !DILocation(line: 351, column: 39, scope: !969)
!969 = distinct !DILexicalBlock(scope: !963, file: !328, line: 353, column: 7)
!970 = !DILocation(line: 351, column: 7, scope: !969)
!971 = !DILocation(line: 352, column: 39, scope: !972)
!972 = distinct !DILexicalBlock(scope: !963, file: !328, line: 353, column: 7)
!973 = !DILocation(line: 352, column: 80, scope: !972)
!974 = !DILocation(line: 352, column: 7, scope: !972)
!975 = !DILocation(line: 353, column: 39, scope: !976)
!976 = distinct !DILexicalBlock(scope: !963, file: !328, line: 354, column: 7)
!977 = !DILocation(line: 353, column: 7, scope: !976)
!978 = !DILocation(line: 354, column: 17, scope: !979)
!979 = distinct !DILexicalBlock(scope: !963, file: !328, line: 355, column: 7)
!980 = !DILocalVariable(name: "tmp___3", scope: !819, file: !328, line: 325, type: !8)
!981 = !DILocation(line: 354, column: 17, scope: !982)
!982 = distinct !DILexicalBlock(scope: !963, file: !328, line: 356, column: 7)
!983 = !DILocalVariable(name: "tmp___4", scope: !819, file: !328, line: 326, type: !8)
!984 = !DILocation(line: 354, column: 24, scope: !963)
!985 = !DILocation(line: 354, column: 30, scope: !963)
!986 = !DILocation(line: 354, column: 12, scope: !963)
!987 = !DILocation(line: 0, scope: !944)
!988 = distinct !{!988, !884, !989}
!989 = !DILocation(line: 337, column: 3, scope: !885)
!990 = !DILocation(line: 339, column: 3, scope: !885)
!991 = !DILocation(line: 358, column: 11, scope: !855)
!992 = !DILocation(line: 358, column: 3, scope: !855)
!993 = distinct !DISubprogram(name: "htmlencode", scope: !328, file: !328, line: 382, type: !809, scopeLine: 383, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!994 = !DILocalVariable(name: "toencode", arg: 1, scope: !993, file: !328, line: 382, type: !6)
!995 = !DILocation(line: 0, scope: !993)
!996 = !DILocation(line: 384, column: 9, scope: !997)
!997 = distinct !DILexicalBlock(scope: !998, file: !328, line: 388, column: 3)
!998 = distinct !DILexicalBlock(scope: !999, file: !328, line: 387, column: 3)
!999 = distinct !DILexicalBlock(scope: !993, file: !328, line: 386, column: 3)
!1000 = !DILocalVariable(name: "tmp", scope: !993, file: !328, line: 384, type: !6)
!1001 = !DILocation(line: 384, column: 3, scope: !999)
!1002 = distinct !DISubprogram(name: "replacevariables", scope: !328, file: !328, line: 401, type: !1003, scopeLine: 402, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!6, !6, !86, !99}
!1005 = !DILocalVariable(name: "input", arg: 1, scope: !1002, file: !328, line: 401, type: !6)
!1006 = !DILocation(line: 0, scope: !1002)
!1007 = !DILocalVariable(name: "cconf___0", arg: 2, scope: !1002, file: !328, line: 401, type: !86)
!1008 = !DILocalVariable(name: "entry", arg: 3, scope: !1002, file: !328, line: 401, type: !99)
!1009 = !DILocalVariable(name: "variables", scope: !1002, file: !328, line: 412, type: !1010)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 1408, elements: !1011)
!1011 = !{!1012, !337}
!1012 = !DISubrange(count: 11)
!1013 = !DILocation(line: 412, column: 9, scope: !1002)
!1014 = !DILocalVariable(name: "size", scope: !1002, file: !328, line: 414, type: !8)
!1015 = !DILocation(line: 414, column: 10, scope: !1002)
!1016 = !DILocalVariable(name: "__cil_tmp30", scope: !1002, file: !328, line: 429, type: !17)
!1017 = !DILocation(line: 429, column: 9, scope: !1002)
!1018 = !DILocalVariable(name: "__cil_tmp31", scope: !1002, file: !328, line: 430, type: !19)
!1019 = !DILocation(line: 430, column: 7, scope: !1002)
!1020 = !DILocalVariable(name: "__cil_tmp32", scope: !1002, file: !328, line: 431, type: !17)
!1021 = !DILocation(line: 431, column: 9, scope: !1002)
!1022 = !DILocalVariable(name: "__cil_tmp33", scope: !1002, file: !328, line: 432, type: !6)
!1023 = !DILocation(line: 432, column: 9, scope: !1002)
!1024 = !DILocalVariable(name: "__cil_tmp34", scope: !1002, file: !328, line: 433, type: !6)
!1025 = !DILocation(line: 433, column: 9, scope: !1002)
!1026 = !DILocalVariable(name: "__cil_tmp35", scope: !1002, file: !328, line: 434, type: !6)
!1027 = !DILocation(line: 434, column: 9, scope: !1002)
!1028 = !DILocalVariable(name: "__cil_tmp36", scope: !1002, file: !328, line: 435, type: !6)
!1029 = !DILocation(line: 435, column: 9, scope: !1002)
!1030 = !DILocalVariable(name: "__cil_tmp37", scope: !1002, file: !328, line: 436, type: !6)
!1031 = !DILocation(line: 436, column: 9, scope: !1002)
!1032 = !DILocalVariable(name: "__cil_tmp38", scope: !1002, file: !328, line: 437, type: !6)
!1033 = !DILocation(line: 437, column: 9, scope: !1002)
!1034 = !DILocalVariable(name: "__cil_tmp39", scope: !1002, file: !328, line: 438, type: !6)
!1035 = !DILocation(line: 438, column: 9, scope: !1002)
!1036 = !DILocalVariable(name: "__cil_tmp40", scope: !1002, file: !328, line: 439, type: !6)
!1037 = !DILocation(line: 439, column: 9, scope: !1002)
!1038 = !DILocalVariable(name: "__cil_tmp41", scope: !1002, file: !328, line: 440, type: !6)
!1039 = !DILocation(line: 440, column: 9, scope: !1002)
!1040 = !DILocalVariable(name: "__cil_tmp42", scope: !1002, file: !328, line: 441, type: !6)
!1041 = !DILocation(line: 441, column: 9, scope: !1002)
!1042 = !DILocalVariable(name: "__cil_tmp43", scope: !1002, file: !328, line: 442, type: !6)
!1043 = !DILocation(line: 442, column: 9, scope: !1002)
!1044 = !DILocalVariable(name: "__cil_tmp44", scope: !1002, file: !328, line: 443, type: !6)
!1045 = !DILocation(line: 443, column: 9, scope: !1002)
!1046 = !DILocalVariable(name: "__cil_tmp45", scope: !1002, file: !328, line: 444, type: !6)
!1047 = !DILocation(line: 444, column: 9, scope: !1002)
!1048 = !DILocalVariable(name: "__cil_tmp46", scope: !1002, file: !328, line: 445, type: !6)
!1049 = !DILocation(line: 445, column: 9, scope: !1002)
!1050 = !DILocalVariable(name: "__cil_tmp47", scope: !1002, file: !328, line: 446, type: !6)
!1051 = !DILocation(line: 446, column: 9, scope: !1002)
!1052 = !DILocalVariable(name: "__cil_tmp48", scope: !1002, file: !328, line: 447, type: !6)
!1053 = !DILocation(line: 447, column: 9, scope: !1002)
!1054 = !DILocalVariable(name: "__cil_tmp49", scope: !1002, file: !328, line: 448, type: !6)
!1055 = !DILocation(line: 448, column: 9, scope: !1002)
!1056 = !DILocalVariable(name: "__cil_tmp50", scope: !1002, file: !328, line: 449, type: !6)
!1057 = !DILocation(line: 449, column: 9, scope: !1002)
!1058 = !DILocalVariable(name: "__cil_tmp51", scope: !1002, file: !328, line: 450, type: !6)
!1059 = !DILocation(line: 450, column: 9, scope: !1002)
!1060 = !DILocalVariable(name: "__cil_tmp52", scope: !1002, file: !328, line: 451, type: !6)
!1061 = !DILocation(line: 451, column: 9, scope: !1002)
!1062 = !DILocalVariable(name: "__cil_tmp53", scope: !1002, file: !328, line: 452, type: !6)
!1063 = !DILocation(line: 452, column: 9, scope: !1002)
!1064 = !DILocalVariable(name: "str_nbsp", scope: !1002, file: !328, line: 403, type: !6)
!1065 = !DILocalVariable(name: "str_err", scope: !1002, file: !328, line: 404, type: !6)
!1066 = !DILocalVariable(name: "str_dir", scope: !1002, file: !328, line: 405, type: !6)
!1067 = !DILocalVariable(name: "str_file", scope: !1002, file: !328, line: 406, type: !6)
!1068 = !DILocalVariable(name: "str_sep", scope: !1002, file: !328, line: 407, type: !6)
!1069 = !DILocalVariable(name: "start", scope: !1002, file: !328, line: 408, type: !6)
!1070 = !DILocation(line: 436, column: 3, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1002, file: !328, line: 454, column: 3)
!1072 = !DILocation(line: 436, column: 19, scope: !1071)
!1073 = !DILocation(line: 436, column: 27, scope: !1071)
!1074 = !DILocation(line: 436, column: 32, scope: !1071)
!1075 = !DILocation(line: 436, column: 20, scope: !1071)
!1076 = !DILocation(line: 451, column: 8, scope: !1071)
!1077 = !DILocalVariable(name: "used", scope: !1002, file: !328, line: 415, type: !19)
!1078 = !DILocation(line: 455, column: 23, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1071, file: !328, line: 455, column: 7)
!1080 = !DILocation(line: 455, column: 7, scope: !1079)
!1081 = !DILocation(line: 455, column: 30, scope: !1079)
!1082 = !DILocation(line: 455, column: 7, scope: !1071)
!1083 = !DILocation(line: 456, column: 18, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1085, file: !328, line: 457, column: 5)
!1085 = distinct !DILexicalBlock(scope: !1086, file: !328, line: 456, column: 5)
!1086 = distinct !DILexicalBlock(scope: !1079, file: !328, line: 455, column: 62)
!1087 = !DILocation(line: 456, column: 5, scope: !1084)
!1088 = !DILocation(line: 457, column: 12, scope: !1085)
!1089 = !DILocation(line: 459, column: 3, scope: !1086)
!1090 = !DILocation(line: 460, column: 16, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1092, file: !328, line: 461, column: 3)
!1092 = distinct !DILexicalBlock(scope: !1071, file: !328, line: 460, column: 3)
!1093 = !DILocation(line: 460, column: 9, scope: !1091)
!1094 = !DILocalVariable(name: "tmp", scope: !1002, file: !328, line: 416, type: !17)
!1095 = !DILocation(line: 460, column: 10, scope: !1092)
!1096 = !DILocation(line: 461, column: 23, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1071, file: !328, line: 461, column: 7)
!1098 = !DILocation(line: 461, column: 7, scope: !1097)
!1099 = !DILocation(line: 461, column: 30, scope: !1097)
!1100 = !DILocation(line: 461, column: 7, scope: !1071)
!1101 = !DILocation(line: 462, column: 5, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !328, line: 463, column: 5)
!1103 = distinct !DILexicalBlock(scope: !1104, file: !328, line: 462, column: 5)
!1104 = distinct !DILexicalBlock(scope: !1097, file: !328, line: 461, column: 62)
!1105 = !DILocation(line: 465, column: 3, scope: !1104)
!1106 = !DILocation(line: 463, column: 4, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1071, file: !328, line: 466, column: 3)
!1108 = !DILocation(line: 463, column: 11, scope: !1107)
!1109 = !DILocation(line: 465, column: 32, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1107, file: !328, line: 464, column: 3)
!1111 = !DILocation(line: 465, column: 21, scope: !1110)
!1112 = !DILocation(line: 465, column: 3, scope: !1110)
!1113 = !DILocation(line: 465, column: 19, scope: !1110)
!1114 = !DILocation(line: 466, column: 12, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1071, file: !328, line: 466, column: 7)
!1116 = !DILocation(line: 466, column: 7, scope: !1071)
!1117 = !DILocation(line: 468, column: 16, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1119, file: !328, line: 468, column: 9)
!1119 = distinct !DILexicalBlock(scope: !1115, file: !328, line: 466, column: 20)
!1120 = !DILocation(line: 468, column: 21, scope: !1118)
!1121 = !DILocation(line: 468, column: 9, scope: !1119)
!1122 = !DILocation(line: 469, column: 32, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1124, file: !328, line: 469, column: 7)
!1124 = distinct !DILexicalBlock(scope: !1118, file: !328, line: 468, column: 27)
!1125 = !DILocation(line: 469, column: 7, scope: !1123)
!1126 = !DILocation(line: 469, column: 23, scope: !1123)
!1127 = !DILocation(line: 470, column: 47, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1123, file: !328, line: 470, column: 7)
!1129 = !DILocation(line: 470, column: 17, scope: !1128)
!1130 = !DILocalVariable(name: "tmp___0", scope: !1002, file: !328, line: 417, type: !8)
!1131 = !DILocation(line: 470, column: 17, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1123, file: !328, line: 472, column: 7)
!1133 = !DILocalVariable(name: "tmp___1", scope: !1002, file: !328, line: 418, type: !8)
!1134 = !DILocation(line: 470, column: 33, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1123, file: !328, line: 472, column: 7)
!1136 = !DILocation(line: 470, column: 44, scope: !1135)
!1137 = !DILocation(line: 470, column: 17, scope: !1135)
!1138 = !DILocalVariable(name: "tmp___2", scope: !1002, file: !328, line: 419, type: !17)
!1139 = !DILocation(line: 470, column: 7, scope: !1123)
!1140 = !DILocation(line: 470, column: 23, scope: !1123)
!1141 = !DILocation(line: 472, column: 40, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1123, file: !328, line: 471, column: 7)
!1143 = !DILocation(line: 473, column: 22, scope: !1142)
!1144 = !DILocation(line: 472, column: 7, scope: !1142)
!1145 = !DILocation(line: 473, column: 7, scope: !1123)
!1146 = !DILocation(line: 473, column: 23, scope: !1123)
!1147 = !DILocation(line: 474, column: 7, scope: !1123)
!1148 = !DILocation(line: 474, column: 23, scope: !1123)
!1149 = !DILocation(line: 475, column: 7, scope: !1123)
!1150 = !DILocation(line: 475, column: 23, scope: !1123)
!1151 = !DILocation(line: 476, column: 7, scope: !1123)
!1152 = !DILocation(line: 476, column: 23, scope: !1123)
!1153 = !DILocation(line: 477, column: 7, scope: !1123)
!1154 = !DILocation(line: 477, column: 23, scope: !1123)
!1155 = !DILocation(line: 479, column: 5, scope: !1124)
!1156 = !DILocation(line: 479, column: 32, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !328, line: 480, column: 7)
!1158 = distinct !DILexicalBlock(scope: !1118, file: !328, line: 479, column: 12)
!1159 = !DILocation(line: 479, column: 7, scope: !1157)
!1160 = !DILocation(line: 479, column: 23, scope: !1157)
!1161 = !DILocation(line: 480, column: 32, scope: !1157)
!1162 = !DILocation(line: 480, column: 7, scope: !1157)
!1163 = !DILocation(line: 480, column: 23, scope: !1157)
!1164 = !DILocation(line: 481, column: 37, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1157, file: !328, line: 481, column: 7)
!1166 = !DILocation(line: 481, column: 25, scope: !1165)
!1167 = !DILocation(line: 481, column: 7, scope: !1165)
!1168 = !DILocation(line: 481, column: 23, scope: !1165)
!1169 = !DILocation(line: 482, column: 32, scope: !1157)
!1170 = !DILocation(line: 482, column: 7, scope: !1157)
!1171 = !DILocation(line: 482, column: 23, scope: !1157)
!1172 = !DILocation(line: 483, column: 43, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1157, file: !328, line: 483, column: 7)
!1174 = !DILocation(line: 483, column: 30, scope: !1173)
!1175 = !DILocation(line: 483, column: 25, scope: !1173)
!1176 = !DILocation(line: 483, column: 7, scope: !1173)
!1177 = !DILocation(line: 483, column: 23, scope: !1173)
!1178 = !DILocation(line: 484, column: 7, scope: !1157)
!1179 = !DILocation(line: 484, column: 23, scope: !1157)
!1180 = !DILocation(line: 485, column: 32, scope: !1157)
!1181 = !DILocation(line: 485, column: 7, scope: !1157)
!1182 = !DILocation(line: 485, column: 23, scope: !1157)
!1183 = !DILocation(line: 488, column: 3, scope: !1119)
!1184 = !DILocation(line: 488, column: 3, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1186, file: !328, line: 490, column: 3)
!1186 = distinct !DILexicalBlock(scope: !1071, file: !328, line: 489, column: 3)
!1187 = !DILocation(line: 412, column: 9, scope: !1071)
!1188 = !DILocation(line: 0, scope: !1071)
!1189 = !DILocalVariable(name: "encvariable", scope: !1002, file: !328, line: 411, type: !6)
!1190 = !DILocation(line: 488, column: 13, scope: !1185)
!1191 = !DILocation(line: 488, column: 11, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1193, file: !328, line: 492, column: 5)
!1193 = distinct !DILexicalBlock(scope: !1194, file: !328, line: 491, column: 5)
!1194 = distinct !DILexicalBlock(scope: !1185, file: !328, line: 488, column: 13)
!1195 = !DILocalVariable(name: "end", scope: !1002, file: !328, line: 409, type: !6)
!1196 = !DILocation(line: 488, column: 12, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1194, file: !328, line: 488, column: 9)
!1198 = !DILocation(line: 488, column: 32, scope: !1197)
!1199 = !DILocation(line: 488, column: 9, scope: !1194)
!1200 = !DILocation(line: 488, column: 7, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1197, file: !328, line: 488, column: 65)
!1202 = !DILocation(line: 489, column: 5, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1204, file: !328, line: 491, column: 5)
!1204 = distinct !DILexicalBlock(scope: !1194, file: !328, line: 490, column: 5)
!1205 = !DILocation(line: 491, column: 34, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1204, file: !328, line: 491, column: 5)
!1207 = !DILocation(line: 491, column: 23, scope: !1206)
!1208 = !DILocation(line: 491, column: 50, scope: !1206)
!1209 = !DILocation(line: 490, column: 5, scope: !1206)
!1210 = !DILocation(line: 491, column: 5, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1212, file: !328, line: 495, column: 5)
!1212 = distinct !DILexicalBlock(scope: !1194, file: !328, line: 494, column: 5)
!1213 = !DILocation(line: 491, column: 15, scope: !1211)
!1214 = !DILocation(line: 491, column: 19, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1216, file: !328, line: 491, column: 11)
!1216 = distinct !DILexicalBlock(scope: !1211, file: !328, line: 491, column: 15)
!1217 = !DILocation(line: 491, column: 27, scope: !1215)
!1218 = !DILocation(line: 491, column: 44, scope: !1215)
!1219 = !DILocation(line: 491, column: 37, scope: !1215)
!1220 = !DILocation(line: 491, column: 35, scope: !1215)
!1221 = !DILocation(line: 491, column: 11, scope: !1216)
!1222 = !DILocation(line: 491, column: 9, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1215, file: !328, line: 491, column: 51)
!1224 = !DILocation(line: 492, column: 7, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1226, file: !328, line: 494, column: 7)
!1226 = distinct !DILexicalBlock(scope: !1216, file: !328, line: 493, column: 7)
!1227 = distinct !{!1227, !1210, !1228}
!1228 = !DILocation(line: 495, column: 5, scope: !1211)
!1229 = !DILocation(line: 497, column: 5, scope: !1211)
!1230 = !DILocation(line: 494, column: 38, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1232, file: !328, line: 501, column: 5)
!1232 = distinct !DILexicalBlock(scope: !1194, file: !328, line: 500, column: 5)
!1233 = !DILocation(line: 495, column: 27, scope: !1231)
!1234 = !DILocation(line: 495, column: 13, scope: !1231)
!1235 = !DILocation(line: 494, column: 5, scope: !1231)
!1236 = !DILocation(line: 495, column: 19, scope: !1232)
!1237 = !DILocation(line: 495, column: 38, scope: !1232)
!1238 = !DILocation(line: 495, column: 31, scope: !1232)
!1239 = !DILocation(line: 495, column: 12, scope: !1232)
!1240 = !DILocalVariable(name: "variable", scope: !1002, file: !328, line: 410, type: !6)
!1241 = !DILocalVariable(name: "i", scope: !1002, file: !328, line: 413, type: !19)
!1242 = !DILocation(line: 498, column: 5, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1244, file: !328, line: 501, column: 5)
!1244 = distinct !DILexicalBlock(scope: !1194, file: !328, line: 500, column: 5)
!1245 = !DILocation(line: 496, column: 14, scope: !1232)
!1246 = !DILocation(line: 0, scope: !1194)
!1247 = !DILocation(line: 498, column: 15, scope: !1243)
!1248 = !DILocation(line: 498, column: 30, scope: !1249)
!1249 = distinct !DILexicalBlock(scope: !1250, file: !328, line: 498, column: 11)
!1250 = distinct !DILexicalBlock(scope: !1243, file: !328, line: 498, column: 15)
!1251 = !DILocation(line: 498, column: 14, scope: !1249)
!1252 = !DILocation(line: 498, column: 46, scope: !1249)
!1253 = !DILocation(line: 498, column: 11, scope: !1250)
!1254 = !DILocation(line: 498, column: 9, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1249, file: !328, line: 498, column: 79)
!1256 = !DILocation(line: 499, column: 40, scope: !1257)
!1257 = distinct !DILexicalBlock(scope: !1258, file: !328, line: 501, column: 7)
!1258 = distinct !DILexicalBlock(scope: !1250, file: !328, line: 500, column: 7)
!1259 = !DILocation(line: 499, column: 17, scope: !1257)
!1260 = !DILocalVariable(name: "tmp___6", scope: !1002, file: !328, line: 423, type: !8)
!1261 = !DILocation(line: 499, column: 62, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1258, file: !328, line: 501, column: 7)
!1263 = !DILocation(line: 499, column: 17, scope: !1262)
!1264 = !DILocalVariable(name: "tmp___7", scope: !1002, file: !328, line: 424, type: !19)
