; ModuleID = '/tmp/tmp.ll'
source_filename = "c/archimedes.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i32, [44 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

@KB = constant double 0x3B30B0EDF6C91C1B, align 8, !dbg !0
@Q = constant double 0x3C07A4DAD55E53FE, align 8, !dbg !107
@HBAR = constant double 0x38E185A7F04CCA12, align 8, !dbg !111
@EPS0 = constant double 0x3DA37876F148112E, align 8, !dbg !113
@M = constant double 0x39B279DD94D505EE, align 8, !dbg !115
@NI = constant double 1.450000e+16, align 8, !dbg !117
@PI = constant double 0x400921FB54524550, align 8, !dbg !119
@DE = constant double 2.000000e-03, align 8, !dbg !121
@mstarHSILICON = constant double 5.700000e-01, align 8, !dbg !123
@mstarHGERMANIUM = constant double 7.300000e-01, align 8, !dbg !125
@mstarHGAAS = constant double 5.100000e-01, align 8, !dbg !127
@MIU0 = global double 1.400000e-01, align 8, !dbg !129
@VS = global double 1.000000e+05, align 8, !dbg !131
@mstarhole = global double 5.700000e-01, align 8, !dbg !133
@MIU0hole = global double 4.710000e-02, align 8, !dbg !135

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "KB", scope: !2, file: !109, line: 37, type: !110, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !106, nameTableKind: GNU)
!3 = !DIFile(filename: "c/archimedes.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !7, !8, !12, !23, !18, !25, !26, !27, !28, !30, !36, !38, !21, !10, !53, !35}
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !15, line: 106, size: 256, elements: !16)
!15 = !DIFile(filename: "/usr/include/getopt.h", directory: "")
!16 = !{!17, !20, !22, !24}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !14, file: !15, line: 107, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !14, file: !15, line: 108, baseType: !21, size: 32, offset: 64)
!21 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !14, file: !15, line: 109, baseType: !23, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !14, file: !15, line: 110, baseType: !21, size: 32, offset: 192)
!25 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!27 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !29, line: 214, baseType: !6)
!29 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.1.2/include/stddef.h", directory: "")
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !32, line: 76, baseType: !33)
!32 = !DIFile(filename: "/usr/include/time.h", directory: "")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !34, line: 151, baseType: !35)
!34 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!35 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !32, line: 131, size: 448, elements: !41)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !40, file: !32, line: 132, baseType: !21, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !40, file: !32, line: 133, baseType: !21, size: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !40, file: !32, line: 134, baseType: !21, size: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !40, file: !32, line: 135, baseType: !21, size: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !40, file: !32, line: 136, baseType: !21, size: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !40, file: !32, line: 137, baseType: !21, size: 32, offset: 160)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !40, file: !32, line: 138, baseType: !21, size: 32, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !40, file: !32, line: 139, baseType: !21, size: 32, offset: 224)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !40, file: !32, line: 140, baseType: !21, size: 32, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !40, file: !32, line: 141, baseType: !35, size: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !40, file: !32, line: 142, baseType: !18, size: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !55, line: 46, baseType: !56)
!55 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 267, size: 1728, elements: !58)
!57 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !79, !80, !81, !82, !84, !86, !88, !92, !95, !99, !100, !101, !102}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !56, file: !57, line: 268, baseType: !21, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !56, file: !57, line: 269, baseType: !10, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !56, file: !57, line: 270, baseType: !10, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !56, file: !57, line: 271, baseType: !10, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !56, file: !57, line: 272, baseType: !10, size: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !56, file: !57, line: 273, baseType: !10, size: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !56, file: !57, line: 274, baseType: !10, size: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !56, file: !57, line: 275, baseType: !10, size: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !56, file: !57, line: 276, baseType: !10, size: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !56, file: !57, line: 277, baseType: !10, size: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !56, file: !57, line: 278, baseType: !10, size: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !56, file: !57, line: 279, baseType: !10, size: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !56, file: !57, line: 280, baseType: !72, size: 64, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !57, line: 182, size: 192, elements: !74)
!74 = !{!75, !76, !78}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !73, file: !57, line: 183, baseType: !72, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !73, file: !57, line: 184, baseType: !77, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !73, file: !57, line: 185, baseType: !21, size: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !56, file: !57, line: 281, baseType: !77, size: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !56, file: !57, line: 282, baseType: !21, size: 32, offset: 896)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !56, file: !57, line: 283, baseType: !21, size: 32, offset: 928)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !56, file: !57, line: 284, baseType: !83, size: 64, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !34, line: 143, baseType: !35)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !56, file: !57, line: 285, baseType: !85, size: 16, offset: 1024)
!85 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !56, file: !57, line: 286, baseType: !87, size: 8, offset: 1040)
!87 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !56, file: !57, line: 287, baseType: !89, size: 8, offset: 1048)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 1)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !56, file: !57, line: 288, baseType: !93, size: 64, offset: 1088)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !57, line: 176, baseType: null)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !56, file: !57, line: 289, baseType: !96, size: 64, offset: 1152)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !34, line: 144, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !34, line: 59, baseType: !98)
!98 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !56, file: !57, line: 290, baseType: !26, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !56, file: !57, line: 291, baseType: !26, size: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !56, file: !57, line: 292, baseType: !21, size: 32, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !56, file: !57, line: 293, baseType: !103, size: 352, offset: 1376)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 352, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 44)
!106 = !{!0, !107, !111, !113, !115, !117, !119, !121, !123, !125, !127, !129, !131, !133, !135, !137, !139, !141, !144, !149, !151, !153, !155, !157, !159, !161, !163, !165, !167, !169, !171, !173, !175, !177, !179, !181, !183, !185, !187, !192, !197, !202, !204, !207, !211, !213, !215, !217, !219, !221, !223, !225, !227, !229, !231, !233, !235, !237, !242, !244, !246, !249, !255, !261, !263, !265, !267, !269, !271, !273, !275, !277, !283, !285, !287, !289, !291, !293, !295, !297, !299, !301, !303, !305, !307, !311, !313, !315, !317, !319, !321, !323, !325, !328, !330, !332, !334, !338, !340, !342, !344, !349, !353, !355, !357, !359, !361, !363, !365, !367, !369, !371, !373, !376, !378}
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "Q", scope: !2, file: !109, line: 39, type: !110, isLocal: false, isDefinition: true)
!109 = !DIFile(filename: "/abs/pronto/test-suite/archimedes-0.7.0/src/constants.h", directory: "")
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "HBAR", scope: !2, file: !109, line: 41, type: !110, isLocal: false, isDefinition: true)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "EPS0", scope: !2, file: !109, line: 43, type: !110, isLocal: false, isDefinition: true)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "M", scope: !2, file: !109, line: 45, type: !110, isLocal: false, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "NI", scope: !2, file: !109, line: 47, type: !110, isLocal: false, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "PI", scope: !2, file: !109, line: 49, type: !110, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "DE", scope: !2, file: !109, line: 51, type: !110, isLocal: false, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "mstarHSILICON", scope: !2, file: !109, line: 53, type: !110, isLocal: false, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "mstarHGERMANIUM", scope: !2, file: !109, line: 55, type: !110, isLocal: false, isDefinition: true)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "mstarHGAAS", scope: !2, file: !109, line: 57, type: !110, isLocal: false, isDefinition: true)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "MIU0", scope: !2, file: !109, line: 59, type: !27, isLocal: false, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "VS", scope: !2, file: !109, line: 61, type: !27, isLocal: false, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "mstarhole", scope: !2, file: !109, line: 63, type: !27, isLocal: false, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "MIU0hole", scope: !2, file: !109, line: 65, type: !27, isLocal: false, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
