; ModuleID = '/tmp/tmp.ll'
source_filename = "c/bc-1.06.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct.bc_struct = type { i32, i32, i32, i32, %struct.bc_struct*, i8*, i8* }
%struct.id_rec = type { i8*, i32, i32, i32, i16, %struct.id_rec*, %struct.id_rec* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i32, [44 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.__anonstruct_program_counter_19 = type { i32, i32 }
%struct.estack_rec = type { %struct.bc_struct*, %struct.estack_rec* }
%struct.fstack_rec = type { i32, %struct.fstack_rec* }
%struct.__anonstruct_bc_function_18 = type { i8, i8*, i32, i32, %struct.bc_label_group*, %struct.arg_list*, %struct.arg_list* }
%struct.bc_label_group = type { [64 x i64], %struct.bc_label_group* }
%struct.arg_list = type { i32, i32, %struct.arg_list* }
%struct.bc_var = type { %struct.bc_struct*, %struct.bc_var* }
%struct.bc_var_array = type { %struct.bc_array*, i8, %struct.bc_var_array* }
%struct.bc_array = type { %struct.bc_array_node*, i16 }
%struct.bc_array_node = type { %union.__anonunion_n_items_20 }
%union.__anonunion_n_items_20 = type { [16 x %struct.bc_struct*] }
%struct.yy_buffer_state = type { %struct._IO_FILE*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_bc_Free_list", scope: !2, file: !40, line: 52, type: !17, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !245, nameTableKind: GNU)
!3 = !DIFile(filename: "c/bc-1.06.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__anonenum_sign_10", file: !6, line: 35, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./../h/number.h", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "PLUS", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "MINUS", value: 1, isUnsigned: true)
!11 = !{!7, !12, !13, !14, !15, !17, !22, !29, !30, !24, !32, !33, !34, !35, !36, !38, !46, !55, !66, !64, !68, !122, !129, !136, !157, !145, !158, !159, !166, !167, !172, !194, !177, !190, !195, !154, !197, !199, !200, !201, !215, !216, !225, !227, !237, !243, !244, !103}
!12 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!13 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !16, line: 214, baseType: !7)
!16 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.1.2/include/stddef.h", directory: "")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "bc_num", file: !6, line: 37, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bc_struct", file: !6, line: 39, size: 320, elements: !20)
!20 = !{!21, !23, !25, !26, !27, !28, !31}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign", scope: !19, file: !6, line: 40, baseType: !22, size: 32)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "sign", file: !6, line: 35, baseType: !5)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "n_len", scope: !19, file: !6, line: 41, baseType: !24, size: 32, offset: 32)
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "n_scale", scope: !19, file: !6, line: 42, baseType: !24, size: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "n_refs", scope: !19, file: !6, line: 43, baseType: !24, size: 32, offset: 96)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "n_next", scope: !19, file: !6, line: 44, baseType: !17, size: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "n_ptr", scope: !19, file: !6, line: 45, baseType: !29, size: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "n_value", scope: !19, file: !6, line: 46, baseType: !29, size: 64, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!35 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "stk_rec", file: !40, line: 1413, baseType: !41)
!40 = !DIFile(filename: "/abs/pronto/test-suite/bc-1.06/lib/number.c", directory: "")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stk_rec", file: !40, line: 1413, size: 128, elements: !42)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "digit", scope: !41, file: !40, line: 1414, baseType: !35, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !41, file: !40, line: 1415, baseType: !45, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_list", file: !48, line: 80, baseType: !49)
!48 = !DIFile(filename: "/abs/pronto/test-suite/bc-1.06/bc/bcdefs.h", directory: "")
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arg_list", file: !48, line: 80, size: 128, elements: !50)
!50 = !{!51, !52, !53}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "av_name", scope: !49, file: !48, line: 81, baseType: !24, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "arg_is_var", scope: !49, file: !48, line: 82, baseType: !24, size: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !49, file: !48, line: 83, baseType: !54, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "id_rec", file: !48, line: 160, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "id_rec", file: !48, line: 160, size: 320, elements: !58)
!58 = !{!59, !60, !61, !62, !63, !65, !67}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !57, file: !48, line: 161, baseType: !29, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "a_name", scope: !57, file: !48, line: 162, baseType: !24, size: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "f_name", scope: !57, file: !48, line: 163, baseType: !24, size: 32, offset: 96)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "v_name", scope: !57, file: !48, line: 164, baseType: !24, size: 32, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "balance", scope: !57, file: !48, line: 165, baseType: !64, size: 16, offset: 160)
!64 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !57, file: !48, line: 166, baseType: !66, size: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !57, file: !48, line: 167, baseType: !66, size: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !70, line: 46, baseType: !71)
!70 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !72, line: 267, size: 1728, elements: !73)
!72 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !94, !95, !96, !97, !100, !102, !104, !108, !111, !115, !116, !117, !118}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !71, file: !72, line: 268, baseType: !24, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !71, file: !72, line: 269, baseType: !29, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !71, file: !72, line: 270, baseType: !29, size: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !71, file: !72, line: 271, baseType: !29, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !71, file: !72, line: 272, baseType: !29, size: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !71, file: !72, line: 273, baseType: !29, size: 64, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !71, file: !72, line: 274, baseType: !29, size: 64, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !71, file: !72, line: 275, baseType: !29, size: 64, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !71, file: !72, line: 276, baseType: !29, size: 64, offset: 512)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !71, file: !72, line: 277, baseType: !29, size: 64, offset: 576)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !71, file: !72, line: 278, baseType: !29, size: 64, offset: 640)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !71, file: !72, line: 279, baseType: !29, size: 64, offset: 704)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !71, file: !72, line: 280, baseType: !87, size: 64, offset: 768)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !72, line: 182, size: 192, elements: !89)
!89 = !{!90, !91, !93}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !88, file: !72, line: 183, baseType: !87, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !88, file: !72, line: 184, baseType: !92, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !88, file: !72, line: 185, baseType: !24, size: 32, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !71, file: !72, line: 281, baseType: !92, size: 64, offset: 832)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !71, file: !72, line: 282, baseType: !24, size: 32, offset: 896)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !71, file: !72, line: 283, baseType: !24, size: 32, offset: 928)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !71, file: !72, line: 284, baseType: !98, size: 64, offset: 960)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !99, line: 143, baseType: !35)
!99 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !71, file: !72, line: 285, baseType: !101, size: 16, offset: 1024)
!101 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !71, file: !72, line: 286, baseType: !103, size: 8, offset: 1040)
!103 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !71, file: !72, line: 287, baseType: !105, size: 8, offset: 1048)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 8, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 1)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !71, file: !72, line: 288, baseType: !109, size: 64, offset: 1088)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !72, line: 176, baseType: null)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !71, file: !72, line: 289, baseType: !112, size: 64, offset: 1152)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !99, line: 144, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !99, line: 59, baseType: !114)
!114 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !71, file: !72, line: 290, baseType: !14, size: 64, offset: 1216)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !71, file: !72, line: 291, baseType: !14, size: 64, offset: 1280)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !71, file: !72, line: 292, baseType: !24, size: 32, offset: 1344)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !71, file: !72, line: 293, baseType: !119, size: 352, offset: 1376)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 352, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 44)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "estack_rec", file: !48, line: 147, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "estack_rec", file: !48, line: 147, size: 128, elements: !125)
!125 = !{!126, !127}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "s_num", scope: !124, file: !48, line: 148, baseType: !17, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !124, file: !48, line: 149, baseType: !128, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "fstack_rec", file: !48, line: 152, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fstack_rec", file: !48, line: 152, size: 128, elements: !132)
!132 = !{!133, !134}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "s_val", scope: !131, file: !48, line: 153, baseType: !24, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !131, file: !48, line: 154, baseType: !135, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "bc_function", file: !48, line: 90, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_bc_function_18", file: !48, line: 90, size: 384, elements: !139)
!139 = !{!140, !141, !142, !143, !144, !155, !156}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "f_defined", scope: !138, file: !48, line: 91, baseType: !30, size: 8)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "f_body", scope: !138, file: !48, line: 92, baseType: !29, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "f_body_size", scope: !138, file: !48, line: 93, baseType: !24, size: 32, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "f_code_size", scope: !138, file: !48, line: 94, baseType: !24, size: 32, offset: 160)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "f_label", scope: !138, file: !48, line: 95, baseType: !145, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "bc_label_group", file: !48, line: 71, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bc_label_group", file: !48, line: 71, size: 4160, elements: !148)
!148 = !{!149, !153}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "l_adrs", scope: !147, file: !48, line: 72, baseType: !150, size: 4096)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 4096, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !147, file: !48, line: 73, baseType: !154, size: 64, offset: 4096)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "f_params", scope: !138, file: !48, line: 96, baseType: !46, size: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "f_autos", scope: !138, file: !48, line: 97, baseType: !46, size: 64, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "bc_var", file: !48, line: 111, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bc_var", file: !48, line: 111, size: 128, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "v_value", scope: !161, file: !48, line: 112, baseType: !17, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "v_next", scope: !161, file: !48, line: 113, baseType: !165, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "bc_var_array", file: !48, line: 136, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bc_var_array", file: !48, line: 136, size: 192, elements: !170)
!170 = !{!171, !192, !193}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "a_value", scope: !169, file: !48, line: 137, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "bc_array", file: !48, line: 130, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bc_array", file: !48, line: 130, size: 128, elements: !175)
!175 = !{!176, !191}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "a_tree", scope: !174, file: !48, line: 131, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "bc_array_node", file: !48, line: 121, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bc_array_node", file: !48, line: 121, size: 1024, elements: !180)
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "n_items", scope: !179, file: !48, line: 122, baseType: !182, size: 1024)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_n_items_20", file: !48, line: 121, size: 1024, elements: !183)
!183 = !{!184, !188}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "n_num", scope: !182, file: !48, line: 122, baseType: !185, size: 1024)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 1024, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 16)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "n_down", scope: !182, file: !48, line: 123, baseType: !189, size: 1024)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 1024, elements: !186)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "a_depth", scope: !174, file: !48, line: 132, baseType: !64, size: 16, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "a_param", scope: !169, file: !48, line: 138, baseType: !30, size: 8, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "a_next", scope: !169, file: !48, line: 139, baseType: !194, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "YY_CHAR", file: !198, line: 264, baseType: !33)
!198 = !DIFile(filename: "/abs/pronto/test-suite/bc-1.06/bc/scan.c", directory: "")
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "yy_state_type", file: !198, line: 266, baseType: !24)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "yy_size_t", file: !198, line: 141, baseType: !7)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "YY_BUFFER_STATE", file: !198, line: 99, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yy_buffer_state", file: !198, line: 144, size: 448, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213, !214}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "yy_input_file", scope: !203, file: !198, line: 145, baseType: !68, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "yy_ch_buf", scope: !203, file: !198, line: 146, baseType: !29, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "yy_buf_pos", scope: !203, file: !198, line: 147, baseType: !29, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "yy_buf_size", scope: !203, file: !198, line: 148, baseType: !200, size: 32, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "yy_n_chars", scope: !203, file: !198, line: 149, baseType: !24, size: 32, offset: 224)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "yy_is_our_buffer", scope: !203, file: !198, line: 150, baseType: !24, size: 32, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "yy_is_interactive", scope: !203, file: !198, line: 151, baseType: !24, size: 32, offset: 288)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "yy_at_bol", scope: !203, file: !198, line: 152, baseType: !24, size: 32, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "yy_fill_buffer", scope: !203, file: !198, line: 153, baseType: !24, size: 32, offset: 352)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "yy_buffer_status", scope: !203, file: !198, line: 154, baseType: !24, size: 32, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "YYSTYPE", file: !218, line: 1, baseType: !219)
!218 = !DIFile(filename: "/abs/pronto/test-suite/bc-1.06/bc/bc.h", directory: "")
!219 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_YYSTYPE_21", file: !218, line: 1, size: 64, elements: !220)
!220 = !{!221, !222, !223, !224}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "s_value", scope: !219, file: !218, line: 2, baseType: !29, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "c_value", scope: !219, file: !218, line: 3, baseType: !30, size: 8)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_value", scope: !219, file: !218, line: 4, baseType: !24, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "a_value", scope: !219, file: !218, line: 5, baseType: !46, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !230, line: 81, size: 256, elements: !231)
!230 = !DIFile(filename: "./../h/getopt.h", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!231 = !{!232, !233, !234, !236}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !229, file: !230, line: 82, baseType: !36, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !229, file: !230, line: 83, baseType: !24, size: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !229, file: !230, line: 84, baseType: !235, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !229, file: !230, line: 85, baseType: !24, size: 32, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "file_node", file: !48, line: 173, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_node", file: !48, line: 173, size: 128, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !239, file: !48, line: 174, baseType: !29, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !239, file: !48, line: 175, baseType: !243, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!245 = !{!246, !248, !254, !256, !258, !260, !262, !264, !267, !269, !271, !273, !278, !280, !282, !284, !286, !288, !290, !292, !294, !296, !298, !300, !302, !304, !306, !308, !310, !312, !314, !316, !318, !320, !322, !324, !326, !328, !330, !332, !339, !341, !343, !345, !347, !349, !351, !353, !355, !358, !360, !362, !365, !367, !369, !371, !373, !375, !377, !379, !382, !384, !386, !0, !389, !394, !397, !399, !401, !403, !405, !407, !413, !419, !424, !429, !431, !436, !438, !444, !449, !454, !456, !458, !463, !465, !470, !472, !477}
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "mul_base_digits", scope: !2, file: !40, line: 628, type: !24, isLocal: false, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "libmath", scope: !2, file: !250, line: 40, type: !251, isLocal: false, isDefinition: true)
!250 = !DIFile(filename: "/abs/pronto/test-suite/bc-1.06/bc/global.c", directory: "")
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 2624, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 41)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "yyin", scope: !2, file: !198, line: 265, type: !68, isLocal: false, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "yyout", scope: !2, file: !198, line: 265, type: !68, isLocal: false, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "_zero_", scope: !2, file: !6, line: 85, type: !17, isLocal: false, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "_one_", scope: !2, file: !6, line: 86, type: !17, isLocal: false, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "_two_", scope: !2, file: !6, line: 87, type: !17, isLocal: false, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "break_label", scope: !2, file: !266, line: 33, type: !24, isLocal: false, isDefinition: true)
!266 = !DIFile(filename: "/abs/pronto/test-suite/bc-1.06/bc/global.h", directory: "")
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "if_label", scope: !2, file: !266, line: 36, type: !24, isLocal: false, isDefinition: true)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "continue_label", scope: !2, file: !266, line: 39, type: !24, isLocal: false, isDefinition: true)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "next_label", scope: !2, file: !266, line: 42, type: !24, isLocal: false, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "genstr", scope: !2, file: !266, line: 45, type: !275, isLocal: false, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 640, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 80)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "out_count", scope: !2, file: !266, line: 48, type: !24, isLocal: false, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "did_gen", scope: !2, file: !266, line: 52, type: !30, isLocal: false, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "interactive", scope: !2, file: !266, line: 55, type: !30, isLocal: false, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "compile_only", scope: !2, file: !266, line: 58, type: !24, isLocal: false, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "use_math", scope: !2, file: !266, line: 61, type: !24, isLocal: false, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "warn_not_std", scope: !2, file: !266, line: 64, type: !24, isLocal: false, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "std_only", scope: !2, file: !266, line: 67, type: !24, isLocal: false, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "quiet", scope: !2, file: !266, line: 70, type: !24, isLocal: false, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "file_names", scope: !2, file: !266, line: 73, type: !237, isLocal: false, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "file_name", scope: !2, file: !266, line: 76, type: !29, isLocal: false, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "is_std_in", scope: !2, file: !266, line: 79, type: !30, isLocal: false, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "functions", scope: !2, file: !266, line: 84, type: !136, isLocal: false, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "f_names", scope: !2, file: !266, line: 85, type: !157, isLocal: false, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "f_count", scope: !2, file: !266, line: 86, type: !24, isLocal: false, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "variables", scope: !2, file: !266, line: 90, type: !158, isLocal: false, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "v_names", scope: !2, file: !266, line: 91, type: !157, isLocal: false, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "v_count", scope: !2, file: !266, line: 92, type: !24, isLocal: false, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "arrays", scope: !2, file: !266, line: 96, type: !166, isLocal: false, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "a_names", scope: !2, file: !266, line: 97, type: !157, isLocal: false, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "a_count", scope: !2, file: !266, line: 98, type: !24, isLocal: false, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "ex_stack", scope: !2, file: !266, line: 101, type: !122, isLocal: false, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "fn_stack", scope: !2, file: !266, line: 104, type: !129, isLocal: false, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "i_base", scope: !2, file: !266, line: 107, type: !24, isLocal: false, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "o_base", scope: !2, file: !266, line: 108, type: !24, isLocal: false, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "scale", scope: !2, file: !266, line: 109, type: !24, isLocal: false, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "c_code", scope: !2, file: !266, line: 122, type: !30, isLocal: false, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "runtime_error", scope: !2, file: !266, line: 125, type: !30, isLocal: false, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "pc", scope: !2, file: !266, line: 128, type: !334, isLocal: false, isDefinition: true)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "program_counter", file: !48, line: 102, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_program_counter_19", file: !48, line: 102, size: 64, elements: !336)
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pc_func", scope: !335, file: !48, line: 103, baseType: !24, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pc_addr", scope: !335, file: !48, line: 104, baseType: !24, size: 32, offset: 32)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "out_col", scope: !2, file: !266, line: 131, type: !24, isLocal: false, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "line_size", scope: !2, file: !266, line: 135, type: !24, isLocal: false, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "line_no", scope: !2, file: !266, line: 138, type: !24, isLocal: false, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "had_error", scope: !2, file: !266, line: 139, type: !24, isLocal: false, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "next_array", scope: !2, file: !266, line: 144, type: !24, isLocal: false, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "next_func", scope: !2, file: !266, line: 145, type: !24, isLocal: false, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "next_var", scope: !2, file: !266, line: 146, type: !24, isLocal: false, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "name_tree", scope: !2, file: !266, line: 148, type: !55, isLocal: false, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "load_adr", scope: !2, file: !357, line: 37, type: !334, isLocal: false, isDefinition: true)
!357 = !DIFile(filename: "/abs/pronto/test-suite/bc-1.06/bc/load.c", directory: "")
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "load_str", scope: !2, file: !357, line: 38, type: !30, isLocal: false, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "load_const", scope: !2, file: !357, line: 39, type: !30, isLocal: false, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "had_sigint", scope: !2, file: !364, line: 39, type: !24, isLocal: false, isDefinition: true)
!364 = !DIFile(filename: "/abs/pronto/test-suite/bc-1.06/bc/execute.c", directory: "")
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "yyleng", scope: !2, file: !198, line: 101, type: !24, isLocal: false, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "yy_hold_char", scope: !2, file: !198, line: 211, type: !30, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "yy_n_chars", scope: !2, file: !198, line: 213, type: !24, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "yy_did_buffer_switch_on_eof", scope: !2, file: !198, line: 226, type: !24, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "yytext", scope: !2, file: !198, line: 267, type: !29, isLocal: false, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "yy_last_accepting_state", scope: !2, file: !198, line: 576, type: !199, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "yy_last_accepting_cpos", scope: !2, file: !198, line: 577, type: !29, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "yylval", scope: !2, file: !381, line: 138, type: !217, isLocal: false, isDefinition: true)
!381 = !DIFile(filename: "/usr/gnu/share/bison.simple", directory: "")
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "yychar", scope: !2, file: !381, line: 137, type: !24, isLocal: false, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "yynerrs", scope: !2, file: !381, line: 146, type: !24, isLocal: false, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "first_file", scope: !2, file: !388, line: 39, type: !30, isLocal: true, isDefinition: true)
!388 = !DIFile(filename: "/abs/pronto/test-suite/bc-1.06/bc/main.c", directory: "")
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "ref_str", scope: !2, file: !40, line: 1419, type: !391, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 136, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 17)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "arglist2", scope: !2, file: !396, line: 79, type: !29, isLocal: true, isDefinition: true)
!396 = !DIFile(filename: "/abs/pronto/test-suite/bc-1.06/bc/util.c", directory: "")
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "arglist1", scope: !2, file: !396, line: 79, type: !29, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "yy_init", scope: !2, file: !198, line: 220, type: !24, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "yy_start", scope: !2, file: !198, line: 221, type: !24, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "yy_current_buffer", scope: !2, file: !198, line: 201, type: !201, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "yy_c_buf_p", scope: !2, file: !198, line: 219, type: !29, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "yy_ec", scope: !2, file: !198, line: 324, type: !409, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 8192, elements: !411)
!410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!411 = !{!412}
!412 = !DISubrange(count: 256)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "yy_accept", scope: !2, file: !198, line: 287, type: !415, isLocal: true, isDefinition: true)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 4768, elements: !417)
!416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!417 = !{!418}
!418 = !DISubrange(count: 298)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "yy_chk", scope: !2, file: !198, line: 509, type: !421, isLocal: true, isDefinition: true)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 9280, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 580)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "yy_base", scope: !2, file: !198, line: 366, type: !426, isLocal: true, isDefinition: true)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 4832, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 302)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "yy_def", scope: !2, file: !198, line: 404, type: !426, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "yy_meta", scope: !2, file: !198, line: 356, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 1728, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 54)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "yy_nxt", scope: !2, file: !198, line: 442, type: !421, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "yypact", scope: !2, file: !440, line: 236, type: !441, isLocal: true, isDefinition: true)
!440 = !DIFile(filename: "bc.y", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 2976, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 186)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "yytranslate", scope: !2, file: !440, line: 62, type: !446, isLocal: true, isDefinition: true)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 2320, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 290)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "yycheck", scope: !2, file: !440, line: 342, type: !451, isLocal: true, isDefinition: true)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 11104, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 694)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "yytable", scope: !2, file: !440, line: 269, type: !451, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "yydefact", scope: !2, file: !440, line: 207, type: !441, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "yyr2", scope: !2, file: !440, line: 193, type: !460, isLocal: true, isDefinition: true)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 1712, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 107)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "yyr1", scope: !2, file: !440, line: 179, type: !460, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "yypgoto", scope: !2, file: !440, line: 258, type: !467, isLocal: true, isDefinition: true)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 544, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 34)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "yydefgoto", scope: !2, file: !440, line: 229, type: !467, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !388, line: 45, type: !474, isLocal: true, isDefinition: true)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 2304, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 9)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "last", scope: !2, file: !388, line: 42, type: !237, isLocal: true, isDefinition: true)
!479 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!480 = !{i32 2, !"Dwarf Version", i32 4}
!481 = !{i32 2, !"Debug Info Version", i32 3}
!482 = !{i32 1, !"wchar_size", i32 4}
!483 = !{i32 7, !"PIC Level", i32 2}
!484 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!485 = distinct !DISubprogram(name: "gnu_dev_major", scope: !486, file: !486, line: 41, type: !487, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !489)
!486 = !DIFile(filename: "/usr/include/sys/sysmacros.h", directory: "")
!487 = !DISubroutineType(types: !488)
!488 = !{!7, !12}
!489 = !{}
!490 = !DILocalVariable(name: "__dev", arg: 1, scope: !485, file: !486, line: 41, type: !12)
!491 = !DILocation(line: 0, scope: !485)
!492 = !DILocation(line: 44, column: 35, scope: !493)
!493 = distinct !DILexicalBlock(scope: !485, file: !486, line: 45, column: 3)
!494 = !DILocation(line: 44, column: 41, scope: !493)
!495 = !DILocation(line: 44, column: 98, scope: !493)
!496 = !DILocation(line: 44, column: 76, scope: !493)
!497 = !DILocation(line: 44, column: 105, scope: !493)
!498 = !DILocation(line: 44, column: 54, scope: !493)
!499 = !DILocation(line: 44, column: 52, scope: !493)
!500 = !DILocation(line: 44, column: 11, scope: !493)
!501 = !DILocation(line: 44, column: 3, scope: !493)
!502 = distinct !DISubprogram(name: "gnu_dev_minor", scope: !486, file: !486, line: 47, type: !487, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !489)
!503 = !DILocalVariable(name: "__dev", arg: 1, scope: !502, file: !486, line: 47, type: !12)
!504 = !DILocation(line: 0, scope: !502)
!505 = !DILocation(line: 50, column: 34, scope: !506)
!506 = distinct !DILexicalBlock(scope: !502, file: !486, line: 51, column: 3)
!507 = !DILocation(line: 50, column: 90, scope: !506)
!508 = !DILocation(line: 50, column: 68, scope: !506)
!509 = !DILocation(line: 50, column: 97, scope: !506)
!510 = !DILocation(line: 50, column: 46, scope: !506)
!511 = !DILocation(line: 50, column: 44, scope: !506)
!512 = !DILocation(line: 50, column: 11, scope: !506)
!513 = !DILocation(line: 50, column: 3, scope: !506)
!514 = distinct !DISubprogram(name: "gnu_dev_makedev", scope: !486, file: !486, line: 53, type: !515, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !489)
!515 = !DISubroutineType(types: !516)
!516 = !{!12, !7, !7}
!517 = !DILocalVariable(name: "__major", arg: 1, scope: !514, file: !486, line: 53, type: !7)
!518 = !DILocation(line: 0, scope: !514)
!519 = !DILocalVariable(name: "__minor", arg: 2, scope: !514, file: !486, line: 53, type: !7)
!520 = !DILocation(line: 56, column: 43, scope: !521)
!521 = distinct !DILexicalBlock(scope: !514, file: !486, line: 57, column: 3)
!522 = !DILocation(line: 56, column: 63, scope: !521)
!523 = !DILocation(line: 56, column: 72, scope: !521)
!524 = !DILocation(line: 56, column: 51, scope: !521)
!525 = !DILocation(line: 56, column: 12, scope: !521)
!526 = !DILocation(line: 56, column: 112, scope: !521)
!527 = !DILocation(line: 56, column: 82, scope: !521)
!528 = !DILocation(line: 56, column: 127, scope: !521)
!529 = !DILocation(line: 56, column: 79, scope: !521)
!530 = !DILocation(line: 56, column: 168, scope: !521)
!531 = !DILocation(line: 56, column: 138, scope: !521)
!532 = !DILocation(line: 56, column: 183, scope: !521)
!533 = !DILocation(line: 56, column: 135, scope: !521)
!534 = !DILocation(line: 56, column: 3, scope: !521)
!535 = distinct !DISubprogram(name: "bc_new_num", scope: !40, file: !40, line: 56, type: !536, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !489)
!536 = !DISubroutineType(types: !537)
!537 = !{!17, !24, !24}
!538 = !DILocalVariable(name: "length", arg: 1, scope: !535, file: !40, line: 56, type: !24)
!539 = !DILocation(line: 0, scope: !535)
!540 = !DILocalVariable(name: "scale___0", arg: 2, scope: !535, file: !40, line: 56, type: !24)
!541 = !DILocation(line: 62, column: 23, scope: !542)
!542 = distinct !DILexicalBlock(scope: !543, file: !40, line: 62, column: 7)
!543 = distinct !DILexicalBlock(scope: !535, file: !40, line: 62, column: 3)
!544 = !DILocation(line: 62, column: 7, scope: !542)
!545 = !DILocation(line: 62, column: 37, scope: !542)
!546 = !DILocation(line: 62, column: 7, scope: !543)
!547 = !DILocation(line: 63, column: 12, scope: !548)
!548 = distinct !DILexicalBlock(scope: !542, file: !40, line: 62, column: 69)
!549 = !DILocalVariable(name: "temp", scope: !535, file: !40, line: 58, type: !17)
!550 = !DILocation(line: 64, column: 27, scope: !548)
!551 = !DILocation(line: 64, column: 19, scope: !548)
!552 = !DILocation(line: 65, column: 3, scope: !548)
!553 = !DILocation(line: 66, column: 11, scope: !554)
!554 = distinct !DILexicalBlock(scope: !555, file: !40, line: 66, column: 5)
!555 = distinct !DILexicalBlock(scope: !542, file: !40, line: 65, column: 10)
!556 = !DILocalVariable(name: "tmp", scope: !535, file: !40, line: 59, type: !14)
!557 = !DILocation(line: 66, column: 12, scope: !554)
!558 = !DILocation(line: 67, column: 9, scope: !559)
!559 = distinct !DILexicalBlock(scope: !555, file: !40, line: 67, column: 9)
!560 = !DILocation(line: 67, column: 30, scope: !559)
!561 = !DILocation(line: 67, column: 9, scope: !555)
!562 = !DILocation(line: 67, column: 7, scope: !563)
!563 = distinct !DILexicalBlock(scope: !564, file: !40, line: 68, column: 7)
!564 = distinct !DILexicalBlock(scope: !559, file: !40, line: 67, column: 62)
!565 = !DILocation(line: 69, column: 5, scope: !564)
!566 = !DILocation(line: 0, scope: !542)
!567 = !DILocation(line: 69, column: 9, scope: !568)
!568 = distinct !DILexicalBlock(scope: !543, file: !40, line: 71, column: 3)
!569 = !DILocation(line: 69, column: 16, scope: !568)
!570 = !DILocation(line: 70, column: 9, scope: !568)
!571 = !DILocation(line: 70, column: 15, scope: !568)
!572 = !DILocation(line: 71, column: 9, scope: !568)
!573 = !DILocation(line: 71, column: 17, scope: !568)
!574 = !DILocation(line: 72, column: 9, scope: !568)
!575 = !DILocation(line: 72, column: 16, scope: !568)
!576 = !DILocation(line: 73, column: 37, scope: !568)
!577 = !DILocation(line: 73, column: 13, scope: !568)
!578 = !DILocalVariable(name: "tmp___0", scope: !535, file: !40, line: 60, type: !14)
!579 = !DILocation(line: 73, column: 9, scope: !568)
!580 = !DILocation(line: 73, column: 15, scope: !568)
!581 = !DILocation(line: 74, column: 29, scope: !582)
!582 = distinct !DILexicalBlock(scope: !543, file: !40, line: 74, column: 7)
!583 = !DILocation(line: 74, column: 7, scope: !582)
!584 = !DILocation(line: 74, column: 35, scope: !582)
!585 = !DILocation(line: 74, column: 7, scope: !543)
!586 = !DILocation(line: 74, column: 5, scope: !587)
!587 = distinct !DILexicalBlock(scope: !588, file: !40, line: 75, column: 5)
!588 = distinct !DILexicalBlock(scope: !582, file: !40, line: 74, column: 67)
!589 = !DILocation(line: 76, column: 3, scope: !588)
!590 = !DILocation(line: 75, column: 25, scope: !591)
!591 = distinct !DILexicalBlock(scope: !543, file: !40, line: 77, column: 3)
!592 = !DILocation(line: 75, column: 9, scope: !591)
!593 = !DILocation(line: 75, column: 17, scope: !591)
!594 = !DILocation(line: 76, column: 16, scope: !591)
!595 = !DILocation(line: 76, column: 33, scope: !591)
!596 = !DILocation(line: 76, column: 3, scope: !591)
!597 = !DILocation(line: 77, column: 3, scope: !543)
!598 = distinct !DISubprogram(name: "out_of_memory", scope: !396, file: !396, line: 710, type: !599, scopeLine: 711, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !489)
!599 = !DISubroutineType(types: !600)
!600 = !{null}
!601 = !DILocation(line: 713, column: 36, scope: !602)
!602 = distinct !DILexicalBlock(scope: !603, file: !396, line: 715, column: 3)
!603 = distinct !DILexicalBlock(scope: !598, file: !396, line: 714, column: 3)
!604 = !DILocation(line: 713, column: 3, scope: !602)
!605 = !DILocation(line: 714, column: 3, scope: !602)
!606 = !DILocation(line: 717, column: 1, scope: !598)
!607 = distinct !DISubprogram(name: "bc_free_num", scope: !40, file: !40, line: 83, type: !608, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !489)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !34}
!610 = !DILocalVariable(name: "num", arg: 1, scope: !607, file: !40, line: 83, type: !34)
!611 = !DILocation(line: 0, scope: !607)
!612 = !DILocation(line: 87, column: 23, scope: !613)
!613 = distinct !DILexicalBlock(scope: !614, file: !40, line: 87, column: 7)
!614 = distinct !DILexicalBlock(scope: !607, file: !40, line: 87, column: 3)
!615 = !DILocation(line: 87, column: 7, scope: !613)
!616 = !DILocation(line: 87, column: 28, scope: !613)
!617 = !DILocation(line: 87, column: 7, scope: !614)
!618 = !DILocation(line: 87, column: 5, scope: !619)
!619 = distinct !DILexicalBlock(scope: !613, file: !40, line: 87, column: 60)
!620 = !DILocation(line: 88, column: 5, scope: !614)
!621 = !DILocation(line: 88, column: 12, scope: !614)
!622 = !DILocation(line: 88, column: 20, scope: !614)
!623 = !DILocation(line: 89, column: 8, scope: !624)
!624 = distinct !DILexicalBlock(scope: !614, file: !40, line: 89, column: 7)
!625 = !DILocation(line: 89, column: 15, scope: !624)
!626 = !DILocation(line: 89, column: 22, scope: !624)
!627 = !DILocation(line: 89, column: 7, scope: !614)
!628 = !DILocation(line: 90, column: 10, scope: !629)
!629 = distinct !DILexicalBlock(scope: !630, file: !40, line: 90, column: 9)
!630 = distinct !DILexicalBlock(scope: !624, file: !40, line: 89, column: 28)
!631 = !DILocation(line: 90, column: 17, scope: !629)
!632 = !DILocation(line: 90, column: 9, scope: !629)
!633 = !DILocation(line: 90, column: 9, scope: !630)
!634 = !DILocation(line: 91, column: 21, scope: !635)
!635 = distinct !DILexicalBlock(scope: !636, file: !40, line: 91, column: 7)
!636 = distinct !DILexicalBlock(scope: !629, file: !40, line: 90, column: 24)
!637 = !DILocation(line: 91, column: 28, scope: !635)
!638 = !DILocation(line: 91, column: 7, scope: !635)
!639 = !DILocation(line: 93, column: 5, scope: !636)
!640 = !DILocation(line: 92, column: 22, scope: !630)
!641 = !DILocation(line: 92, column: 6, scope: !630)
!642 = !DILocation(line: 92, column: 13, scope: !630)
!643 = !DILocation(line: 92, column: 20, scope: !630)
!644 = !DILocation(line: 93, column: 21, scope: !630)
!645 = !DILocation(line: 93, column: 19, scope: !630)
!646 = !DILocation(line: 94, column: 3, scope: !630)
!647 = !DILocation(line: 95, column: 8, scope: !614)
!648 = !DILocation(line: 96, column: 3, scope: !614)
!649 = !DILocation(line: 98, column: 1, scope: !607)
!650 = distinct !DISubprogram(name: "bc_init_numbers", scope: !40, file: !40, line: 101, type: !599, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !489)
!651 = !DILocation(line: 104, column: 12, scope: !652)
!652 = distinct !DILexicalBlock(scope: !653, file: !40, line: 106, column: 3)
!653 = distinct !DILexicalBlock(scope: !650, file: !40, line: 105, column: 3)
!654 = !DILocation(line: 104, column: 10, scope: !652)
!655 = !DILocation(line: 105, column: 11, scope: !652)
!656 = !DILocation(line: 105, column: 9, scope: !652)
!657 = !DILocation(line: 106, column: 5, scope: !652)
!658 = !DILocation(line: 106, column: 12, scope: !652)
!659 = !DILocation(line: 106, column: 20, scope: !652)
!660 = !DILocation(line: 106, column: 25, scope: !652)
!661 = !DILocation(line: 107, column: 11, scope: !652)
!662 = !DILocation(line: 107, column: 9, scope: !652)
!663 = !DILocation(line: 108, column: 5, scope: !652)
!664 = !DILocation(line: 108, column: 12, scope: !652)
!665 = !DILocation(line: 108, column: 20, scope: !652)
!666 = !DILocation(line: 108, column: 25, scope: !652)
!667 = !DILocation(line: 109, column: 3, scope: !653)
!668 = distinct !DISubprogram(name: "bc_copy_num", scope: !40, file: !40, line: 114, type: !669, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !489)
!669 = !DISubroutineType(types: !670)
!670 = !{!17, !17}
!671 = !DILocalVariable(name: "num", arg: 1, scope: !668, file: !40, line: 114, type: !17)
!672 = !DILocation(line: 0, scope: !668)
!673 = !DILocation(line: 118, column: 9, scope: !674)
!674 = distinct !DILexicalBlock(scope: !668, file: !40, line: 118, column: 3)
!675 = !DILocation(line: 118, column: 17, scope: !674)
!676 = !DILocation(line: 119, column: 3, scope: !674)
!677 = distinct !DISubprogram(name: "bc_init_num", scope: !40, file: !40, line: 125, type: !608, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !489)
!678 = !DILocalVariable(name: "num", arg: 1, scope: !677, file: !40, line: 125, type: !34)
!679 = !DILocation(line: 0, scope: !677)
!680 = !DILocation(line: 129, column: 22, scope: !681)
!681 = distinct !DILexicalBlock(scope: !682, file: !40, line: 130, column: 3)
!682 = distinct !DILexicalBlock(scope: !677, file: !40, line: 129, column: 3)
!683 = !DILocation(line: 129, column: 10, scope: !681)
!684 = !DILocation(line: 129, column: 8, scope: !681)
!685 = !DILocation(line: 130, column: 3, scope: !682)
!686 = distinct !DISubprogram(name: "bc_compare", scope: !40, file: !40, line: 261, type: !687, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !489)
!687 = !DISubroutineType(types: !688)
!688 = !{!24, !17, !17}
!689 = !DILocalVariable(name: "n1", arg: 1, scope: !686, file: !40, line: 261, type: !17)
!690 = !DILocation(line: 0, scope: !686)
!691 = !DILocalVariable(name: "n2", arg: 2, scope: !686, file: !40, line: 261, type: !17)
!692 = !DILocation(line: 265, column: 9, scope: !693)
!693 = distinct !DILexicalBlock(scope: !694, file: !40, line: 266, column: 3)
!694 = distinct !DILexicalBlock(scope: !686, file: !40, line: 265, column: 3)
!695 = !DILocalVariable(name: "tmp", scope: !686, file: !40, line: 263, type: !24)
!696 = !DILocation(line: 265, column: 3, scope: !694)
!697 = distinct !DISubprogram(name: "_bc_do_compare", scope: !40, file: !40, line: 152, type: !698, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !489)
!698 = !DISubroutineType(types: !699)
!699 = !{!24, !17, !17, !24, !24}
!700 = !DILocalVariable(name: "n1", arg: 1, scope: !697, file: !40, line: 152, type: !17)
!701 = !DILocation(line: 0, scope: !697)
!702 = !DILocalVariable(name: "n2", arg: 2, scope: !697, file: !40, line: 152, type: !17)
!703 = !DILocalVariable(name: "use_sign", arg: 3, scope: !697, file: !40, line: 152, type: !24)
!704 = !DILocalVariable(name: "ignore_last", arg: 4, scope: !697, file: !40, line: 152, type: !24)
!705 = !DILocation(line: 162, column: 7, scope: !706)
!706 = distinct !DILexicalBlock(scope: !707, file: !40, line: 162, column: 7)
!707 = distinct !DILexicalBlock(scope: !697, file: !40, line: 161, column: 3)
!708 = !DILocation(line: 162, column: 7, scope: !707)
!709 = !DILocation(line: 162, column: 28, scope: !710)
!710 = distinct !DILexicalBlock(scope: !711, file: !40, line: 162, column: 9)
!711 = distinct !DILexicalBlock(scope: !706, file: !40, line: 162, column: 17)
!712 = !DILocation(line: 162, column: 57, scope: !710)
!713 = !DILocation(line: 162, column: 35, scope: !710)
!714 = !DILocation(line: 162, column: 9, scope: !711)
!715 = !DILocation(line: 164, column: 30, scope: !716)
!716 = distinct !DILexicalBlock(scope: !717, file: !40, line: 164, column: 11)
!717 = distinct !DILexicalBlock(scope: !710, file: !40, line: 162, column: 65)
!718 = !DILocation(line: 164, column: 37, scope: !716)
!719 = !DILocation(line: 164, column: 11, scope: !717)
!720 = !DILocation(line: 165, column: 9, scope: !721)
!721 = distinct !DILexicalBlock(scope: !716, file: !40, line: 164, column: 44)
!722 = !DILocation(line: 167, column: 9, scope: !723)
!723 = distinct !DILexicalBlock(scope: !716, file: !40, line: 166, column: 14)
!724 = !DILocation(line: 170, column: 3, scope: !711)
!725 = !DILocation(line: 171, column: 11, scope: !726)
!726 = distinct !DILexicalBlock(scope: !707, file: !40, line: 171, column: 7)
!727 = !DILocation(line: 171, column: 24, scope: !726)
!728 = !DILocation(line: 171, column: 17, scope: !726)
!729 = !DILocation(line: 171, column: 7, scope: !707)
!730 = !DILocation(line: 173, column: 13, scope: !731)
!731 = distinct !DILexicalBlock(scope: !732, file: !40, line: 173, column: 9)
!732 = distinct !DILexicalBlock(scope: !726, file: !40, line: 171, column: 31)
!733 = !DILocation(line: 173, column: 25, scope: !731)
!734 = !DILocation(line: 173, column: 19, scope: !731)
!735 = !DILocation(line: 173, column: 9, scope: !732)
!736 = !DILocation(line: 176, column: 13, scope: !737)
!737 = distinct !DILexicalBlock(scope: !738, file: !40, line: 176, column: 11)
!738 = distinct !DILexicalBlock(scope: !731, file: !40, line: 173, column: 32)
!739 = !DILocation(line: 176, column: 11, scope: !738)
!740 = !DILocation(line: 177, column: 9, scope: !741)
!741 = distinct !DILexicalBlock(scope: !737, file: !40, line: 176, column: 23)
!742 = !DILocation(line: 176, column: 30, scope: !743)
!743 = distinct !DILexicalBlock(scope: !737, file: !40, line: 176, column: 11)
!744 = !DILocation(line: 176, column: 37, scope: !743)
!745 = !DILocation(line: 176, column: 11, scope: !737)
!746 = !DILocation(line: 177, column: 9, scope: !747)
!747 = distinct !DILexicalBlock(scope: !743, file: !40, line: 176, column: 44)
!748 = !DILocation(line: 179, column: 9, scope: !749)
!749 = distinct !DILexicalBlock(scope: !743, file: !40, line: 178, column: 14)
!750 = !DILocation(line: 184, column: 11, scope: !751)
!751 = distinct !DILexicalBlock(scope: !731, file: !40, line: 184, column: 9)
!752 = !DILocation(line: 184, column: 9, scope: !731)
!753 = !DILocation(line: 185, column: 7, scope: !754)
!754 = distinct !DILexicalBlock(scope: !751, file: !40, line: 184, column: 21)
!755 = !DILocation(line: 184, column: 28, scope: !756)
!756 = distinct !DILexicalBlock(scope: !751, file: !40, line: 184, column: 9)
!757 = !DILocation(line: 184, column: 35, scope: !756)
!758 = !DILocation(line: 184, column: 9, scope: !751)
!759 = !DILocation(line: 185, column: 7, scope: !760)
!760 = distinct !DILexicalBlock(scope: !756, file: !40, line: 184, column: 42)
!761 = !DILocation(line: 187, column: 7, scope: !762)
!762 = distinct !DILexicalBlock(scope: !756, file: !40, line: 186, column: 12)
!763 = !DILocation(line: 193, column: 11, scope: !764)
!764 = distinct !DILexicalBlock(scope: !707, file: !40, line: 193, column: 7)
!765 = !DILocation(line: 193, column: 25, scope: !764)
!766 = !DILocation(line: 193, column: 19, scope: !764)
!767 = !DILocation(line: 193, column: 7, scope: !707)
!768 = !DILocation(line: 193, column: 15, scope: !769)
!769 = distinct !DILexicalBlock(scope: !764, file: !40, line: 193, column: 34)
!770 = !DILocalVariable(name: "tmp", scope: !697, file: !40, line: 157, type: !24)
!771 = !DILocation(line: 194, column: 3, scope: !769)
!772 = !DILocation(line: 193, column: 15, scope: !773)
!773 = distinct !DILexicalBlock(scope: !764, file: !40, line: 194, column: 10)
!774 = !DILocation(line: 0, scope: !764)
!775 = !DILocation(line: 193, column: 15, scope: !707)
!776 = !DILocation(line: 193, column: 21, scope: !707)
!777 = !DILocalVariable(name: "count", scope: !697, file: !40, line: 156, type: !24)
!778 = !DILocation(line: 194, column: 15, scope: !707)
!779 = !DILocalVariable(name: "n1ptr", scope: !697, file: !40, line: 154, type: !29)
!780 = !DILocation(line: 195, column: 15, scope: !707)
!781 = !DILocalVariable(name: "n2ptr", scope: !697, file: !40, line: 155, type: !29)
!782 = !DILocation(line: 197, column: 3, scope: !783)
!783 = distinct !DILexicalBlock(scope: !707, file: !40, line: 196, column: 3)
!784 = !DILocation(line: 0, scope: !707)
!785 = !DILocation(line: 197, column: 13, scope: !783)
!786 = !DILocation(line: 197, column: 15, scope: !787)
!787 = distinct !DILexicalBlock(scope: !788, file: !40, line: 197, column: 9)
!788 = distinct !DILexicalBlock(scope: !783, file: !40, line: 197, column: 13)
!789 = !DILocation(line: 197, column: 9, scope: !788)
!790 = !DILocation(line: 197, column: 20, scope: !791)
!791 = distinct !DILexicalBlock(scope: !792, file: !40, line: 197, column: 11)
!792 = distinct !DILexicalBlock(scope: !787, file: !40, line: 197, column: 20)
!793 = !DILocation(line: 197, column: 14, scope: !791)
!794 = !DILocation(line: 197, column: 36, scope: !791)
!795 = !DILocation(line: 197, column: 30, scope: !791)
!796 = !DILocation(line: 197, column: 27, scope: !791)
!797 = !DILocation(line: 197, column: 11, scope: !792)
!798 = !DILocation(line: 197, column: 9, scope: !799)
!799 = distinct !DILexicalBlock(scope: !791, file: !40, line: 197, column: 45)
!800 = !DILocation(line: 199, column: 5, scope: !792)
!801 = !DILocation(line: 197, column: 7, scope: !802)
!802 = distinct !DILexicalBlock(scope: !787, file: !40, line: 199, column: 12)
!803 = !DILocation(line: 199, column: 11, scope: !788)
!804 = !DILocation(line: 200, column: 11, scope: !788)
!805 = !DILocation(line: 201, column: 11, scope: !788)
!806 = distinct !{!806, !782, !807}
!807 = !DILocation(line: 202, column: 3, scope: !783)
!808 = !DILocation(line: 203, column: 7, scope: !809)
!809 = distinct !DILexicalBlock(scope: !707, file: !40, line: 203, column: 7)
!810 = !DILocation(line: 203, column: 7, scope: !707)
!811 = !DILocation(line: 203, column: 15, scope: !812)
!812 = distinct !DILexicalBlock(scope: !813, file: !40, line: 203, column: 9)
!813 = distinct !DILexicalBlock(scope: !809, file: !40, line: 203, column: 20)
!814 = !DILocation(line: 203, column: 9, scope: !813)
!815 = !DILocation(line: 203, column: 15, scope: !816)
!816 = distinct !DILexicalBlock(scope: !817, file: !40, line: 203, column: 11)
!817 = distinct !DILexicalBlock(scope: !812, file: !40, line: 203, column: 21)
!818 = !DILocation(line: 203, column: 30, scope: !816)
!819 = !DILocation(line: 203, column: 23, scope: !816)
!820 = !DILocation(line: 203, column: 11, scope: !817)
!821 = !DILocation(line: 204, column: 9, scope: !822)
!822 = distinct !DILexicalBlock(scope: !816, file: !40, line: 203, column: 39)
!823 = !DILocation(line: 206, column: 5, scope: !817)
!824 = !DILocation(line: 207, column: 3, scope: !813)
!825 = !DILocation(line: 205, column: 13, scope: !826)
!826 = distinct !DILexicalBlock(scope: !707, file: !40, line: 205, column: 7)
!827 = !DILocation(line: 205, column: 7, scope: !707)
!828 = !DILocation(line: 207, column: 15, scope: !829)
!829 = distinct !DILexicalBlock(scope: !830, file: !40, line: 207, column: 9)
!830 = distinct !DILexicalBlock(scope: !826, file: !40, line: 205, column: 19)
!831 = !DILocation(line: 207, column: 9, scope: !829)
!832 = !DILocation(line: 207, column: 30, scope: !829)
!833 = !DILocation(line: 207, column: 24, scope: !829)
!834 = !DILocation(line: 207, column: 22, scope: !829)
!835 = !DILocation(line: 207, column: 9, scope: !830)
!836 = !DILocation(line: 210, column: 13, scope: !837)
!837 = distinct !DILexicalBlock(scope: !838, file: !40, line: 210, column: 11)
!838 = distinct !DILexicalBlock(scope: !829, file: !40, line: 207, column: 38)
!839 = !DILocation(line: 210, column: 11, scope: !838)
!840 = !DILocation(line: 211, column: 9, scope: !841)
!841 = distinct !DILexicalBlock(scope: !837, file: !40, line: 210, column: 23)
!842 = !DILocation(line: 210, column: 30, scope: !843)
!843 = distinct !DILexicalBlock(scope: !837, file: !40, line: 210, column: 11)
!844 = !DILocation(line: 210, column: 37, scope: !843)
!845 = !DILocation(line: 210, column: 11, scope: !837)
!846 = !DILocation(line: 211, column: 9, scope: !847)
!847 = distinct !DILexicalBlock(scope: !843, file: !40, line: 210, column: 44)
!848 = !DILocation(line: 213, column: 9, scope: !849)
!849 = distinct !DILexicalBlock(scope: !843, file: !40, line: 212, column: 14)
!850 = !DILocation(line: 218, column: 11, scope: !851)
!851 = distinct !DILexicalBlock(scope: !829, file: !40, line: 218, column: 9)
!852 = !DILocation(line: 218, column: 9, scope: !829)
!853 = !DILocation(line: 219, column: 7, scope: !854)
!854 = distinct !DILexicalBlock(scope: !851, file: !40, line: 218, column: 21)
!855 = !DILocation(line: 218, column: 28, scope: !856)
!856 = distinct !DILexicalBlock(scope: !851, file: !40, line: 218, column: 9)
!857 = !DILocation(line: 218, column: 35, scope: !856)
!858 = !DILocation(line: 218, column: 9, scope: !851)
!859 = !DILocation(line: 219, column: 7, scope: !860)
!860 = distinct !DILexicalBlock(scope: !856, file: !40, line: 218, column: 42)
!861 = !DILocation(line: 221, column: 7, scope: !862)
!862 = distinct !DILexicalBlock(scope: !856, file: !40, line: 220, column: 12)
!863 = !DILocation(line: 226, column: 11, scope: !864)
!864 = distinct !DILexicalBlock(scope: !707, file: !40, line: 226, column: 7)
!865 = !DILocation(line: 226, column: 26, scope: !864)
!866 = !DILocation(line: 226, column: 19, scope: !864)
!867 = !DILocation(line: 226, column: 7, scope: !707)
!868 = !DILocation(line: 228, column: 13, scope: !869)
!869 = distinct !DILexicalBlock(scope: !870, file: !40, line: 228, column: 9)
!870 = distinct !DILexicalBlock(scope: !864, file: !40, line: 226, column: 35)
!871 = !DILocation(line: 228, column: 27, scope: !869)
!872 = !DILocation(line: 228, column: 21, scope: !869)
!873 = !DILocation(line: 228, column: 9, scope: !870)
!874 = !DILocation(line: 230, column: 19, scope: !875)
!875 = distinct !DILexicalBlock(scope: !869, file: !40, line: 228, column: 36)
!876 = !DILocation(line: 230, column: 33, scope: !875)
!877 = !DILocation(line: 230, column: 27, scope: !875)
!878 = !DILocation(line: 230, column: 7, scope: !879)
!879 = distinct !DILexicalBlock(scope: !875, file: !40, line: 231, column: 7)
!880 = !DILocation(line: 0, scope: !875)
!881 = !DILocation(line: 230, column: 17, scope: !879)
!882 = !DILocation(line: 230, column: 22, scope: !883)
!883 = distinct !DILexicalBlock(scope: !884, file: !40, line: 230, column: 13)
!884 = distinct !DILexicalBlock(scope: !879, file: !40, line: 230, column: 17)
!885 = !DILocation(line: 230, column: 13, scope: !884)
!886 = !DILocation(line: 230, column: 11, scope: !887)
!887 = distinct !DILexicalBlock(scope: !883, file: !40, line: 230, column: 28)
!888 = !DILocalVariable(name: "tmp___0", scope: !697, file: !40, line: 158, type: !29)
!889 = !DILocation(line: 231, column: 15, scope: !884)
!890 = !DILocation(line: 231, column: 19, scope: !891)
!891 = distinct !DILexicalBlock(scope: !884, file: !40, line: 231, column: 13)
!892 = !DILocation(line: 231, column: 13, scope: !891)
!893 = !DILocation(line: 231, column: 28, scope: !891)
!894 = !DILocation(line: 231, column: 13, scope: !884)
!895 = !DILocation(line: 234, column: 17, scope: !896)
!896 = distinct !DILexicalBlock(scope: !897, file: !40, line: 234, column: 15)
!897 = distinct !DILexicalBlock(scope: !891, file: !40, line: 231, column: 34)
!898 = !DILocation(line: 234, column: 15, scope: !897)
!899 = !DILocation(line: 235, column: 13, scope: !900)
!900 = distinct !DILexicalBlock(scope: !896, file: !40, line: 234, column: 27)
!901 = !DILocation(line: 234, column: 34, scope: !902)
!902 = distinct !DILexicalBlock(scope: !896, file: !40, line: 234, column: 15)
!903 = !DILocation(line: 234, column: 41, scope: !902)
!904 = !DILocation(line: 234, column: 15, scope: !896)
!905 = !DILocation(line: 235, column: 13, scope: !906)
!906 = distinct !DILexicalBlock(scope: !902, file: !40, line: 234, column: 48)
!907 = !DILocation(line: 237, column: 13, scope: !908)
!908 = distinct !DILexicalBlock(scope: !902, file: !40, line: 236, column: 18)
!909 = !DILocation(line: 230, column: 15, scope: !884)
!910 = distinct !{!910, !878, !911}
!911 = !DILocation(line: 231, column: 7, scope: !879)
!912 = !DILocation(line: 234, column: 5, scope: !875)
!913 = !DILocation(line: 242, column: 19, scope: !914)
!914 = distinct !DILexicalBlock(scope: !869, file: !40, line: 234, column: 12)
!915 = !DILocation(line: 242, column: 33, scope: !914)
!916 = !DILocation(line: 242, column: 27, scope: !914)
!917 = !DILocation(line: 242, column: 7, scope: !918)
!918 = distinct !DILexicalBlock(scope: !914, file: !40, line: 243, column: 7)
!919 = !DILocation(line: 0, scope: !914)
!920 = !DILocation(line: 242, column: 17, scope: !918)
!921 = !DILocation(line: 242, column: 22, scope: !922)
!922 = distinct !DILexicalBlock(scope: !923, file: !40, line: 242, column: 13)
!923 = distinct !DILexicalBlock(scope: !918, file: !40, line: 242, column: 17)
!924 = !DILocation(line: 242, column: 13, scope: !923)
!925 = !DILocation(line: 242, column: 11, scope: !926)
!926 = distinct !DILexicalBlock(scope: !922, file: !40, line: 242, column: 28)
!927 = !DILocalVariable(name: "tmp___1", scope: !697, file: !40, line: 159, type: !29)
!928 = !DILocation(line: 243, column: 15, scope: !923)
!929 = !DILocation(line: 243, column: 19, scope: !930)
!930 = distinct !DILexicalBlock(scope: !923, file: !40, line: 243, column: 13)
!931 = !DILocation(line: 243, column: 13, scope: !930)
!932 = !DILocation(line: 243, column: 28, scope: !930)
!933 = !DILocation(line: 243, column: 13, scope: !923)
!934 = !DILocation(line: 246, column: 17, scope: !935)
!935 = distinct !DILexicalBlock(scope: !936, file: !40, line: 246, column: 15)
!936 = distinct !DILexicalBlock(scope: !930, file: !40, line: 243, column: 34)
!937 = !DILocation(line: 246, column: 15, scope: !936)
!938 = !DILocation(line: 247, column: 13, scope: !939)
!939 = distinct !DILexicalBlock(scope: !935, file: !40, line: 246, column: 27)
!940 = !DILocation(line: 246, column: 34, scope: !941)
!941 = distinct !DILexicalBlock(scope: !935, file: !40, line: 246, column: 15)
!942 = !DILocation(line: 246, column: 41, scope: !941)
!943 = !DILocation(line: 246, column: 15, scope: !935)
!944 = !DILocation(line: 247, column: 13, scope: !945)
!945 = distinct !DILexicalBlock(scope: !941, file: !40, line: 246, column: 48)
!946 = !DILocation(line: 249, column: 13, scope: !947)
!947 = distinct !DILexicalBlock(scope: !941, file: !40, line: 248, column: 18)
!948 = !DILocation(line: 242, column: 15, scope: !923)
!949 = distinct !{!949, !917, !950}
!950 = !DILocation(line: 243, column: 7, scope: !918)
!951 = !DILocation(line: 247, column: 3, scope: !870)
!952 = !DILocation(line: 255, column: 3, scope: !707)
!953 = !DILocation(line: 257, column: 1, scope: !697)
!954 = distinct !DISubprogram(name: "bc_is_neg", scope: !40, file: !40, line: 270, type: !955, scopeLine: 271, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !489)
!955 = !DISubroutineType(types: !956)
!956 = !{!30, !17}
!957 = !DILocalVariable(name: "num", arg: 1, scope: !954, file: !40, line: 270, type: !17)
!958 = !DILocation(line: 0, scope: !954)
!959 = !DILocation(line: 274, column: 39, scope: !960)
!960 = distinct !DILexicalBlock(scope: !954, file: !40, line: 274, column: 3)
!961 = !DILocation(line: 274, column: 46, scope: !960)
!962 = !DILocation(line: 274, column: 11, scope: !960)
!963 = !DILocation(line: 274, column: 3, scope: !960)
!964 = distinct !DISubprogram(name: "bc_is_zero", scope: !40, file: !40, line: 279, type: !955, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !489)
!965 = !DILocalVariable(name: "num", arg: 1, scope: !964, file: !40, line: 279, type: !17)
!966 = !DILocation(line: 0, scope: !964)
!967 = !DILocation(line: 287, column: 7, scope: !968)
!968 = distinct !DILexicalBlock(scope: !969, file: !40, line: 287, column: 7)
!969 = distinct !DILexicalBlock(scope: !964, file: !40, line: 285, column: 3)
!970 = !DILocation(line: 287, column: 46, scope: !968)
!971 = !DILocation(line: 287, column: 30, scope: !968)
!972 = !DILocation(line: 287, column: 27, scope: !968)
!973 = !DILocation(line: 287, column: 7, scope: !969)
!974 = !DILocation(line: 287, column: 5, scope: !975)
!975 = distinct !DILexicalBlock(scope: !968, file: !40, line: 287, column: 54)
!976 = !DILocation(line: 290, column: 16, scope: !969)
!977 = !DILocation(line: 290, column: 29, scope: !969)
!978 = !DILocation(line: 290, column: 22, scope: !969)
!979 = !DILocalVariable(name: "count", scope: !964, file: !40, line: 281, type: !24)
!980 = !DILocation(line: 291, column: 15, scope: !969)
!981 = !DILocalVariable(name: "nptr", scope: !964, file: !40, line: 282, type: !29)
!982 = !DILocation(line: 294, column: 3, scope: !983)
!983 = distinct !DILexicalBlock(scope: !969, file: !40, line: 292, column: 3)
!984 = !DILocation(line: 0, scope: !969)
!985 = !DILocation(line: 294, column: 13, scope: !983)
!986 = !DILocation(line: 294, column: 15, scope: !987)
!987 = distinct !DILexicalBlock(scope: !988, file: !40, line: 294, column: 9)
!988 = distinct !DILexicalBlock(scope: !983, file: !40, line: 294, column: 13)
!989 = !DILocation(line: 294, column: 9, scope: !988)
!990 = !DILocalVariable(name: "tmp", scope: !964, file: !40, line: 283, type: !29)
!991 = !DILocation(line: 294, column: 12, scope: !992)
!992 = distinct !DILexicalBlock(scope: !987, file: !40, line: 294, column: 20)
!993 = !DILocation(line: 294, column: 20, scope: !994)
!994 = distinct !DILexicalBlock(scope: !992, file: !40, line: 294, column: 11)
!995 = !DILocation(line: 294, column: 14, scope: !994)
!996 = !DILocation(line: 294, column: 25, scope: !994)
!997 = !DILocation(line: 294, column: 11, scope: !992)
!998 = !DILocation(line: 294, column: 9, scope: !999)
!999 = distinct !DILexicalBlock(scope: !994, file: !40, line: 294, column: 32)
!1000 = !DILocation(line: 296, column: 5, scope: !992)
!1001 = !DILocation(line: 294, column: 7, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !987, file: !40, line: 296, column: 12)
!1003 = !DILocation(line: 294, column: 11, scope: !988)
!1004 = distinct !{!1004, !982, !1005}
!1005 = !DILocation(line: 295, column: 3, scope: !983)
!1006 = !DILocation(line: 296, column: 13, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !969, file: !40, line: 296, column: 7)
!1008 = !DILocation(line: 296, column: 7, scope: !969)
!1009 = !DILocation(line: 297, column: 5, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1007, file: !40, line: 296, column: 19)
!1011 = !DILocation(line: 299, column: 5, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1007, file: !40, line: 298, column: 10)
!1013 = !DILocation(line: 302, column: 1, scope: !964)
!1014 = distinct !DISubprogram(name: "bc_is_near_zero", scope: !40, file: !40, line: 306, type: !1015, scopeLine: 307, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !489)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!30, !17, !24}
!1017 = !DILocalVariable(name: "num", arg: 1, scope: !1014, file: !40, line: 306, type: !17)
!1018 = !DILocation(line: 0, scope: !1014)
!1019 = !DILocalVariable(name: "scale___0", arg: 2, scope: !1014, file: !40, line: 306, type: !24)
!1020 = !DILocation(line: 315, column: 24, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !40, line: 315, column: 7)
!1022 = distinct !DILexicalBlock(scope: !1014, file: !40, line: 312, column: 3)
!1023 = !DILocation(line: 315, column: 17, scope: !1021)
!1024 = !DILocation(line: 315, column: 7, scope: !1022)
!1025 = !DILocation(line: 316, column: 22, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1021, file: !40, line: 315, column: 33)
!1027 = !DILocation(line: 317, column: 3, scope: !1026)
!1028 = !DILocation(line: 319, column: 16, scope: !1022)
!1029 = !DILocation(line: 319, column: 22, scope: !1022)
!1030 = !DILocalVariable(name: "count", scope: !1014, file: !40, line: 308, type: !24)
!1031 = !DILocation(line: 320, column: 15, scope: !1022)
!1032 = !DILocalVariable(name: "nptr", scope: !1014, file: !40, line: 309, type: !29)
!1033 = !DILocation(line: 323, column: 3, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1022, file: !40, line: 321, column: 3)
!1035 = !DILocation(line: 0, scope: !1022)
!1036 = !DILocation(line: 323, column: 13, scope: !1034)
!1037 = !DILocation(line: 323, column: 15, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !40, line: 323, column: 9)
!1039 = distinct !DILexicalBlock(scope: !1034, file: !40, line: 323, column: 13)
!1040 = !DILocation(line: 323, column: 9, scope: !1039)
!1041 = !DILocalVariable(name: "tmp", scope: !1014, file: !40, line: 310, type: !29)
!1042 = !DILocation(line: 323, column: 12, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1038, file: !40, line: 323, column: 20)
!1044 = !DILocation(line: 323, column: 20, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1043, file: !40, line: 323, column: 11)
!1046 = !DILocation(line: 323, column: 14, scope: !1045)
!1047 = !DILocation(line: 323, column: 25, scope: !1045)
!1048 = !DILocation(line: 323, column: 11, scope: !1043)
!1049 = !DILocation(line: 323, column: 9, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1045, file: !40, line: 323, column: 32)
!1051 = !DILocation(line: 325, column: 5, scope: !1043)
!1052 = !DILocation(line: 323, column: 7, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1038, file: !40, line: 325, column: 12)
!1054 = !DILocation(line: 323, column: 11, scope: !1039)
!1055 = distinct !{!1055, !1033, !1056}
!1056 = !DILocation(line: 324, column: 3, scope: !1034)
!1057 = !DILocation(line: 325, column: 13, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1022, file: !40, line: 325, column: 7)
!1059 = !DILocation(line: 325, column: 7, scope: !1022)
!1060 = !DILocation(line: 325, column: 15, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !40, line: 325, column: 9)
!1062 = distinct !DILexicalBlock(scope: !1058, file: !40, line: 325, column: 19)
!1063 = !DILocation(line: 325, column: 9, scope: !1062)
!1064 = !DILocation(line: 326, column: 7, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1061, file: !40, line: 325, column: 21)
!1066 = !DILocation(line: 325, column: 12, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1061, file: !40, line: 327, column: 12)
!1068 = !DILocation(line: 325, column: 17, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1067, file: !40, line: 325, column: 11)
!1070 = !DILocation(line: 325, column: 11, scope: !1069)
!1071 = !DILocation(line: 325, column: 23, scope: !1069)
!1072 = !DILocation(line: 325, column: 11, scope: !1067)
!1073 = !DILocation(line: 326, column: 9, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !1069, file: !40, line: 325, column: 29)
!1075 = !DILocation(line: 328, column: 9, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1069, file: !40, line: 327, column: 14)
!1077 = !DILocation(line: 328, column: 5, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1058, file: !40, line: 331, column: 10)
!1079 = !DILocation(line: 0, scope: !1058)
!1080 = !DILocation(line: 331, column: 1, scope: !1014)
!1081 = distinct !DISubprogram(name: "bc_sub", scope: !40, file: !40, line: 528, type: !1082, scopeLine: 529, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !489)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{null, !17, !17, !34, !24}
!1084 = !DILocalVariable(name: "n1", arg: 1, scope: !1081, file: !40, line: 528, type: !17)
!1085 = !DILocation(line: 0, scope: !1081)
!1086 = !DILocalVariable(name: "n2", arg: 2, scope: !1081, file: !40, line: 528, type: !17)
!1087 = !DILocalVariable(name: "result", arg: 3, scope: !1081, file: !40, line: 528, type: !34)
!1088 = !DILocalVariable(name: "scale_min", arg: 4, scope: !1081, file: !40, line: 528, type: !24)
!1089 = !DILocalVariable(name: "diff", scope: !1081, file: !40, line: 530, type: !17)
!1090 = !DILocation(line: 537, column: 26, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1092, file: !40, line: 537, column: 7)
!1092 = distinct !DILexicalBlock(scope: !1081, file: !40, line: 536, column: 3)
!1093 = !DILocation(line: 537, column: 55, scope: !1091)
!1094 = !DILocation(line: 537, column: 33, scope: !1091)
!1095 = !DILocation(line: 537, column: 7, scope: !1092)
!1096 = !DILocation(line: 539, column: 12, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1098, file: !40, line: 538, column: 5)
!1098 = distinct !DILexicalBlock(scope: !1091, file: !40, line: 537, column: 63)
!1099 = !DILocation(line: 540, column: 24, scope: !1097)
!1100 = !DILocation(line: 540, column: 11, scope: !1097)
!1101 = !DILocation(line: 540, column: 18, scope: !1097)
!1102 = !DILocation(line: 542, column: 3, scope: !1098)
!1103 = !DILocation(line: 546, column: 15, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !40, line: 543, column: 5)
!1105 = distinct !DILexicalBlock(scope: !1091, file: !40, line: 542, column: 10)
!1106 = !DILocalVariable(name: "cmp_res", scope: !1081, file: !40, line: 531, type: !24)
!1107 = !DILocation(line: 549, column: 17, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1109, file: !40, line: 549, column: 9)
!1109 = distinct !DILexicalBlock(scope: !1105, file: !40, line: 548, column: 5)
!1110 = !DILocation(line: 549, column: 9, scope: !1109)
!1111 = !DILocation(line: 549, column: 7, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1108, file: !40, line: 549, column: 24)
!1113 = !DILocation(line: 554, column: 17, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1109, file: !40, line: 554, column: 9)
!1115 = !DILocation(line: 554, column: 9, scope: !1109)
!1116 = !DILocation(line: 554, column: 7, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1114, file: !40, line: 554, column: 23)
!1118 = !DILocation(line: 560, column: 17, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1109, file: !40, line: 560, column: 9)
!1120 = !DILocation(line: 560, column: 9, scope: !1109)
!1121 = !DILocation(line: 560, column: 7, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1119, file: !40, line: 560, column: 23)
!1123 = !DILocation(line: 547, column: 5, scope: !1109)
!1124 = !DILocation(line: 551, column: 12, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1109, file: !40, line: 549, column: 5)
!1126 = !DILocation(line: 552, column: 28, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1109, file: !40, line: 552, column: 9)
!1128 = !DILocation(line: 552, column: 35, scope: !1127)
!1129 = !DILocation(line: 552, column: 9, scope: !1109)
!1130 = !DILocation(line: 552, column: 13, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1127, file: !40, line: 552, column: 42)
!1132 = !DILocation(line: 552, column: 20, scope: !1131)
!1133 = !DILocation(line: 553, column: 5, scope: !1131)
!1134 = !DILocation(line: 552, column: 13, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1127, file: !40, line: 553, column: 12)
!1136 = !DILocation(line: 552, column: 20, scope: !1135)
!1137 = !DILocation(line: 553, column: 5, scope: !1109)
!1138 = !DILocation(line: 556, column: 13, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1109, file: !40, line: 556, column: 9)
!1140 = !DILocation(line: 556, column: 27, scope: !1139)
!1141 = !DILocation(line: 556, column: 21, scope: !1139)
!1142 = !DILocation(line: 556, column: 9, scope: !1109)
!1143 = !DILocation(line: 556, column: 21, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1139, file: !40, line: 556, column: 36)
!1145 = !DILocalVariable(name: "tmp___1", scope: !1081, file: !40, line: 534, type: !24)
!1146 = !DILocation(line: 557, column: 5, scope: !1144)
!1147 = !DILocation(line: 556, column: 21, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1139, file: !40, line: 557, column: 12)
!1149 = !DILocation(line: 0, scope: !1139)
!1150 = !DILocation(line: 556, column: 19, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1109, file: !40, line: 556, column: 9)
!1152 = !DILocalVariable(name: "res_scale", scope: !1081, file: !40, line: 532, type: !24)
!1153 = !DILocation(line: 557, column: 5, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1151, file: !40, line: 556, column: 30)
!1155 = !DILocation(line: 556, column: 15, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1157, file: !40, line: 556, column: 11)
!1157 = distinct !DILexicalBlock(scope: !1151, file: !40, line: 557, column: 12)
!1158 = !DILocation(line: 556, column: 29, scope: !1156)
!1159 = !DILocation(line: 556, column: 23, scope: !1156)
!1160 = !DILocation(line: 556, column: 11, scope: !1157)
!1161 = !DILocation(line: 556, column: 23, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1156, file: !40, line: 556, column: 38)
!1163 = !DILocalVariable(name: "tmp___0", scope: !1081, file: !40, line: 533, type: !24)
!1164 = !DILocation(line: 557, column: 7, scope: !1162)
!1165 = !DILocation(line: 556, column: 23, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1156, file: !40, line: 557, column: 14)
!1167 = !DILocation(line: 0, scope: !1156)
!1168 = !DILocation(line: 0, scope: !1151)
!1169 = !DILocation(line: 557, column: 12, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1109, file: !40, line: 558, column: 5)
!1171 = !DILocation(line: 558, column: 18, scope: !1170)
!1172 = !DILocation(line: 558, column: 40, scope: !1170)
!1173 = !DILocation(line: 558, column: 5, scope: !1170)
!1174 = !DILocation(line: 559, column: 5, scope: !1109)
!1175 = !DILocation(line: 562, column: 12, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1109, file: !40, line: 561, column: 5)
!1177 = !DILocation(line: 563, column: 24, scope: !1176)
!1178 = !DILocation(line: 563, column: 11, scope: !1176)
!1179 = !DILocation(line: 563, column: 18, scope: !1176)
!1180 = !DILocation(line: 564, column: 5, scope: !1109)
!1181 = !DILocation(line: 0, scope: !1092)
!1182 = !DILocation(line: 0, scope: !1091)
!1183 = !DILocation(line: 569, column: 3, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1092, file: !40, line: 568, column: 3)
!1185 = !DILocation(line: 570, column: 11, scope: !1184)
!1186 = !DILocation(line: 571, column: 3, scope: !1092)
!1187 = distinct !DISubprogram(name: "_bc_do_add", scope: !40, file: !40, line: 336, type: !1188, scopeLine: 337, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !489)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!17, !17, !17, !24}
!1190 = !DILocalVariable(name: "n1", arg: 1, scope: !1187, file: !40, line: 336, type: !17)
!1191 = !DILocation(line: 0, scope: !1187)
!1192 = !DILocalVariable(name: "n2", arg: 2, scope: !1187, file: !40, line: 336, type: !17)
!1193 = !DILocalVariable(name: "scale_min", arg: 3, scope: !1187, file: !40, line: 336, type: !24)
!1194 = !DILocation(line: 348, column: 11, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1196, file: !40, line: 348, column: 7)
!1196 = distinct !DILexicalBlock(scope: !1187, file: !40, line: 360, column: 3)
!1197 = !DILocation(line: 348, column: 25, scope: !1195)
!1198 = !DILocation(line: 348, column: 19, scope: !1195)
!1199 = !DILocation(line: 348, column: 7, scope: !1196)
!1200 = !DILocation(line: 348, column: 21, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1195, file: !40, line: 348, column: 34)
!1202 = !DILocalVariable(name: "sum_scale", scope: !1187, file: !40, line: 339, type: !24)
!1203 = !DILocation(line: 349, column: 3, scope: !1201)
!1204 = !DILocation(line: 348, column: 21, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1195, file: !40, line: 349, column: 10)
!1206 = !DILocation(line: 0, scope: !1195)
!1207 = !DILocation(line: 349, column: 11, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1196, file: !40, line: 349, column: 7)
!1209 = !DILocation(line: 349, column: 23, scope: !1208)
!1210 = !DILocation(line: 349, column: 17, scope: !1208)
!1211 = !DILocation(line: 349, column: 7, scope: !1196)
!1212 = !DILocation(line: 349, column: 15, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1208, file: !40, line: 349, column: 30)
!1214 = !DILocalVariable(name: "tmp", scope: !1187, file: !40, line: 348, type: !24)
!1215 = !DILocation(line: 350, column: 3, scope: !1213)
!1216 = !DILocation(line: 349, column: 15, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1208, file: !40, line: 350, column: 10)
!1218 = !DILocation(line: 0, scope: !1208)
!1219 = !DILocation(line: 349, column: 20, scope: !1196)
!1220 = !DILocalVariable(name: "sum_digits", scope: !1187, file: !40, line: 340, type: !24)
!1221 = !DILocation(line: 350, column: 17, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1196, file: !40, line: 350, column: 7)
!1223 = !DILocation(line: 350, column: 7, scope: !1196)
!1224 = !DILocalVariable(name: "tmp___0", scope: !1187, file: !40, line: 349, type: !24)
!1225 = !DILocation(line: 351, column: 3, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1222, file: !40, line: 350, column: 30)
!1227 = !DILocation(line: 0, scope: !1222)
!1228 = !DILocation(line: 350, column: 9, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1196, file: !40, line: 352, column: 3)
!1230 = !DILocalVariable(name: "sum", scope: !1187, file: !40, line: 338, type: !17)
!1231 = !DILocation(line: 353, column: 17, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1196, file: !40, line: 353, column: 7)
!1233 = !DILocation(line: 353, column: 7, scope: !1196)
!1234 = !DILocation(line: 355, column: 20, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1232, file: !40, line: 353, column: 30)
!1236 = !DILocation(line: 355, column: 28, scope: !1235)
!1237 = !DILocation(line: 355, column: 41, scope: !1235)
!1238 = !DILocalVariable(name: "sumptr", scope: !1187, file: !40, line: 343, type: !29)
!1239 = !DILocation(line: 356, column: 23, scope: !1235)
!1240 = !DILocalVariable(name: "count", scope: !1187, file: !40, line: 347, type: !24)
!1241 = !DILocation(line: 356, column: 5, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1235, file: !40, line: 357, column: 5)
!1243 = !DILocation(line: 0, scope: !1235)
!1244 = !DILocation(line: 356, column: 15, scope: !1242)
!1245 = !DILocation(line: 356, column: 20, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1247, file: !40, line: 356, column: 11)
!1247 = distinct !DILexicalBlock(scope: !1242, file: !40, line: 356, column: 15)
!1248 = !DILocation(line: 356, column: 11, scope: !1247)
!1249 = !DILocation(line: 356, column: 9, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !1246, file: !40, line: 356, column: 26)
!1251 = !DILocalVariable(name: "tmp___1", scope: !1187, file: !40, line: 350, type: !29)
!1252 = !DILocation(line: 357, column: 14, scope: !1247)
!1253 = !DILocation(line: 357, column: 16, scope: !1247)
!1254 = !DILocation(line: 356, column: 13, scope: !1247)
!1255 = distinct !{!1255, !1241, !1256}
!1256 = !DILocation(line: 357, column: 5, scope: !1242)
!1257 = !DILocation(line: 360, column: 3, scope: !1235)
!1258 = !DILocation(line: 361, column: 17, scope: !1196)
!1259 = !DILocalVariable(name: "n1bytes", scope: !1187, file: !40, line: 345, type: !24)
!1260 = !DILocation(line: 362, column: 17, scope: !1196)
!1261 = !DILocalVariable(name: "n2bytes", scope: !1187, file: !40, line: 346, type: !24)
!1262 = !DILocation(line: 363, column: 17, scope: !1196)
!1263 = !DILocation(line: 363, column: 31, scope: !1196)
!1264 = !DILocation(line: 363, column: 25, scope: !1196)
!1265 = !DILocation(line: 363, column: 38, scope: !1196)
!1266 = !DILocation(line: 363, column: 49, scope: !1196)
!1267 = !DILocalVariable(name: "n1ptr", scope: !1187, file: !40, line: 341, type: !29)
!1268 = !DILocation(line: 364, column: 17, scope: !1196)
!1269 = !DILocation(line: 364, column: 31, scope: !1196)
!1270 = !DILocation(line: 364, column: 25, scope: !1196)
!1271 = !DILocation(line: 364, column: 38, scope: !1196)
!1272 = !DILocation(line: 364, column: 49, scope: !1196)
!1273 = !DILocalVariable(name: "n2ptr", scope: !1187, file: !40, line: 342, type: !29)
!1274 = !DILocation(line: 365, column: 19, scope: !1196)
!1275 = !DILocation(line: 365, column: 27, scope: !1196)
!1276 = !DILocation(line: 365, column: 40, scope: !1196)
!1277 = !DILocation(line: 365, column: 54, scope: !1196)
!1278 = !DILocation(line: 368, column: 15, scope: !1279)
!1279 = distinct !DILexicalBlock(scope: !1196, file: !40, line: 368, column: 7)
!1280 = !DILocation(line: 368, column: 7, scope: !1196)
!1281 = !DILocation(line: 370, column: 17, scope: !1282)
!1282 = distinct !DILexicalBlock(scope: !1283, file: !40, line: 370, column: 9)
!1283 = distinct !DILexicalBlock(scope: !1279, file: !40, line: 368, column: 27)
!1284 = !DILocation(line: 370, column: 9, scope: !1283)
!1285 = !DILocation(line: 371, column: 7, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1287, file: !40, line: 371, column: 7)
!1287 = distinct !DILexicalBlock(scope: !1282, file: !40, line: 370, column: 28)
!1288 = !DILocation(line: 0, scope: !1196)
!1289 = !DILocation(line: 371, column: 17, scope: !1286)
!1290 = !DILocation(line: 371, column: 24, scope: !1291)
!1291 = distinct !DILexicalBlock(scope: !1292, file: !40, line: 371, column: 13)
!1292 = distinct !DILexicalBlock(scope: !1286, file: !40, line: 371, column: 17)
