; ModuleID = '/tmp/tmp.ll'
source_filename = "c/beep-1.2.2.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.beep_parms_t = type { float, i32, i32, i32, i32, i32, %struct.beep_parms_t* }
%struct.option = type { i8*, i32, i32*, i32 }

@.str = private unnamed_addr constant [129 x i8] c"Copyright (C) Johnathan Nightingale, 2002.  Use and Distribution subject to GPL.  For information: http://www.gnu.org/copyleft/.\00", align 1
@copyright = global i8* getelementptr inbounds ([129 x i8], [129 x i8]* @.str, i32 0, i32 0), align 8, !dbg !0
@console_fd = global i32 -1, align 4, !dbg !101
@.str.1 = private unnamed_addr constant [75 x i8] c"Usage:\0A%s [-f freq] [-l length] [-r reps] [-d delay] [-D delay] [-s] [-c]\0A\00", align 1
@.str.2 = private unnamed_addr constant [48 x i8] c"%s [Options...] [-n] [--new] [Options...] ... \0A\00", align 1
@.str.3 = private unnamed_addr constant [18 x i8] c"%s [-h] [--help]\0A\00", align 1
@.str.4 = private unnamed_addr constant [26 x i8] c"%s [-v] [-V] [--version]\0A\00", align 1
@.str.5 = private unnamed_addr constant [5 x i8] c"help\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "copyright", scope: !2, file: !30, line: 51, type: !14, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !100, nameTableKind: GNU)
!3 = !DIFile(filename: "c/beep-1.2.2.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !9, !11, !12, !15, !24, !25, !28, !40, !41, !10, !99, !14}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !18, line: 106, size: 256, elements: !19)
!18 = !DIFile(filename: "/usr/include/getopt.h", directory: "")
!19 = !{!20, !21, !22, !23}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !17, file: !18, line: 107, baseType: !6, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !17, file: !18, line: 108, baseType: !10, size: 32, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !17, file: !18, line: 109, baseType: !9, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !17, file: !18, line: 110, baseType: !10, size: 32, offset: 192)
!24 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !26, line: 211, baseType: !27)
!26 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!27 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "beep_parms_t", file: !30, line: 72, baseType: !31)
!30 = !DIFile(filename: "/home/wslee/benchmarks/sound/beep-1.2.2/beep.c", directory: "")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "beep_parms_t", file: !30, line: 72, size: 256, elements: !32)
!32 = !{!33, !34, !35, !36, !37, !38, !39}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !31, file: !30, line: 73, baseType: !24, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !31, file: !30, line: 74, baseType: !10, size: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "reps", scope: !31, file: !30, line: 75, baseType: !10, size: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !31, file: !30, line: 76, baseType: !10, size: 32, offset: 96)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "end_delay", scope: !31, file: !30, line: 77, baseType: !10, size: 32, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_beep", scope: !31, file: !30, line: 78, baseType: !10, size: 32, offset: 160)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !31, file: !30, line: 79, baseType: !40, size: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !43, line: 49, baseType: !44)
!43 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !45, line: 271, size: 1728, elements: !46)
!45 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !67, !68, !69, !70, !74, !76, !78, !82, !85, !89, !90, !91, !92, !93, !94, !95}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !44, file: !45, line: 272, baseType: !10, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !44, file: !45, line: 273, baseType: !14, size: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !44, file: !45, line: 274, baseType: !14, size: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !44, file: !45, line: 275, baseType: !14, size: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !44, file: !45, line: 276, baseType: !14, size: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !44, file: !45, line: 277, baseType: !14, size: 64, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !44, file: !45, line: 278, baseType: !14, size: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !44, file: !45, line: 279, baseType: !14, size: 64, offset: 448)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !44, file: !45, line: 280, baseType: !14, size: 64, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !44, file: !45, line: 281, baseType: !14, size: 64, offset: 576)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !44, file: !45, line: 282, baseType: !14, size: 64, offset: 640)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !44, file: !45, line: 283, baseType: !14, size: 64, offset: 704)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !44, file: !45, line: 284, baseType: !60, size: 64, offset: 768)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !45, line: 186, size: 192, elements: !62)
!62 = !{!63, !64, !66}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !61, file: !45, line: 187, baseType: !60, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !61, file: !45, line: 188, baseType: !65, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !61, file: !45, line: 189, baseType: !10, size: 32, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !44, file: !45, line: 285, baseType: !65, size: 64, offset: 832)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !44, file: !45, line: 286, baseType: !10, size: 32, offset: 896)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !44, file: !45, line: 287, baseType: !10, size: 32, offset: 928)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !44, file: !45, line: 288, baseType: !71, size: 64, offset: 960)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !72, line: 141, baseType: !73)
!72 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!73 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !44, file: !45, line: 289, baseType: !75, size: 16, offset: 1024)
!75 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !44, file: !45, line: 290, baseType: !77, size: 8, offset: 1040)
!77 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !44, file: !45, line: 291, baseType: !79, size: 8, offset: 1048)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 1)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !44, file: !45, line: 292, baseType: !83, size: 64, offset: 1088)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !45, line: 180, baseType: null)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !44, file: !45, line: 293, baseType: !86, size: 64, offset: 1152)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !72, line: 142, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !72, line: 56, baseType: !88)
!88 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !44, file: !45, line: 294, baseType: !11, size: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !44, file: !45, line: 295, baseType: !11, size: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !44, file: !45, line: 296, baseType: !11, size: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !44, file: !45, line: 297, baseType: !11, size: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !44, file: !45, line: 298, baseType: !25, size: 32, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !44, file: !45, line: 299, baseType: !10, size: 32, offset: 1504)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !44, file: !45, line: 300, baseType: !96, size: 192, offset: 1536)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 192, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 24)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__useconds_t", file: !72, line: 150, baseType: !27)
!100 = !{!0, !101}
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "console_fd", scope: !2, file: !30, line: 91, type: !10, isLocal: false, isDefinition: true)
!103 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!104 = !{i32 2, !"Dwarf Version", i32 4}
!105 = !{i32 2, !"Debug Info Version", i32 3}
!106 = !{i32 1, !"wchar_size", i32 4}
!107 = !{i32 7, !"PIC Level", i32 2}
!108 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!109 = distinct !DISubprogram(name: "handle_signal", scope: !30, file: !30, line: 95, type: !110, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !10}
!112 = !DILocalVariable(name: "signum", arg: 1, scope: !109, file: !30, line: 95, type: !10)
!113 = !DILocation(line: 0, scope: !109)
!114 = !DILocation(line: 97, column: 14, scope: !115)
!115 = distinct !DILexicalBlock(scope: !116, file: !30, line: 97, column: 7)
!116 = distinct !DILexicalBlock(scope: !117, file: !30, line: 100, column: 3)
!117 = distinct !DILexicalBlock(scope: !109, file: !30, line: 99, column: 3)
!118 = !DILocation(line: 97, column: 7, scope: !116)
!119 = !DILocation(line: 97, column: 5, scope: !120)
!120 = distinct !DILexicalBlock(scope: !115, file: !30, line: 97, column: 20)
!121 = !DILocation(line: 96, column: 3, scope: !116)
!122 = !DILocation(line: 98, column: 7, scope: !123)
!123 = distinct !DILexicalBlock(scope: !116, file: !30, line: 98, column: 7)
!124 = !DILocation(line: 98, column: 18, scope: !123)
!125 = !DILocation(line: 98, column: 7, scope: !116)
!126 = !DILocation(line: 100, column: 11, scope: !127)
!127 = distinct !DILexicalBlock(scope: !128, file: !30, line: 100, column: 5)
!128 = distinct !DILexicalBlock(scope: !129, file: !30, line: 99, column: 5)
!129 = distinct !DILexicalBlock(scope: !123, file: !30, line: 98, column: 24)
!130 = !DILocation(line: 100, column: 5, scope: !127)
!131 = !DILocation(line: 101, column: 11, scope: !132)
!132 = distinct !DILexicalBlock(scope: !128, file: !30, line: 102, column: 5)
!133 = !DILocation(line: 101, column: 5, scope: !132)
!134 = !DILocation(line: 102, column: 5, scope: !135)
!135 = distinct !DILexicalBlock(scope: !128, file: !30, line: 103, column: 5)
!136 = !DILocation(line: 105, column: 5, scope: !137)
!137 = distinct !DILexicalBlock(scope: !138, file: !30, line: 107, column: 5)
!138 = distinct !DILexicalBlock(scope: !139, file: !30, line: 106, column: 5)
!139 = distinct !DILexicalBlock(scope: !123, file: !30, line: 105, column: 10)
!140 = !DILocation(line: 108, column: 3, scope: !117)
!141 = distinct !DISubprogram(name: "usage_bail", scope: !30, file: !30, line: 111, type: !142, scopeLine: 112, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !6}
!144 = !DILocalVariable(name: "executable_name", arg: 1, scope: !141, file: !30, line: 111, type: !6)
!145 = !DILocation(line: 0, scope: !141)
!146 = !DILocalVariable(name: "__cil_tmp2", scope: !141, file: !30, line: 113, type: !14)
!147 = !DILocation(line: 113, column: 9, scope: !141)
!148 = !DILocalVariable(name: "__cil_tmp3", scope: !141, file: !30, line: 114, type: !14)
!149 = !DILocation(line: 114, column: 9, scope: !141)
!150 = !DILocalVariable(name: "__cil_tmp4", scope: !141, file: !30, line: 115, type: !14)
!151 = !DILocation(line: 115, column: 9, scope: !141)
!152 = !DILocalVariable(name: "__cil_tmp5", scope: !141, file: !30, line: 116, type: !14)
!153 = !DILocation(line: 116, column: 9, scope: !141)
