; ModuleID = '/tmp/tmp.ll'
source_filename = "c/bottlerocket-0.05b3.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.timeval = type { i64, i64 }
%struct.__anonstruct_fd_set_10 = type { [16 x i64] }
%struct.__anonstruct_br_control_info_28 = type { i32, i32, i32, i32, %struct.__anonstruct_br_unit_list_27**, i32* }
%struct.__anonstruct_br_unit_list_27 = type { i32, i32, i32*, i32* }
%struct.timezone = type { i32, i32 }

@br_pre_cmd_delay = global i32 350000, align 4, !dbg !0
@br_post_cmd_delay = global i32 350000, align 4, !dbg !133
@br_inter_bit_delay = global i32 1400, align 4, !dbg !136
@br_verbose = global i32 0, align 4, !dbg !138
@.str = private unnamed_addr constant [3 x i8] c"ON\00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c"OFF\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"DIM\00", align 1
@.str.3 = private unnamed_addr constant [7 x i8] c"BRIGHT\00", align 1
@.str.4 = private unnamed_addr constant [8 x i8] c"ALL OFF\00", align 1
@.str.5 = private unnamed_addr constant [7 x i8] c"ALL ON\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "br_pre_cmd_delay", scope: !2, file: !135, line: 80, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !132, nameTableKind: GNU)
!3 = !DIFile(filename: "c/bottlerocket-0.05b3.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !7, !8, !11, !12, !13, !14, !62, !74, !75, !85, !86, !97, !99, !10, !67, !83, !95, !108, !118, !126}
!6 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!12 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!13 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !16, line: 49, baseType: !17)
!16 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !18, line: 271, size: 1728, elements: !19)
!18 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !40, !41, !42, !43, !46, !48, !50, !54, !57, !61, !63, !64, !65, !66, !69, !70}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !17, file: !18, line: 272, baseType: !7, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !17, file: !18, line: 273, baseType: !11, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !17, file: !18, line: 274, baseType: !11, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !17, file: !18, line: 275, baseType: !11, size: 64, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !17, file: !18, line: 276, baseType: !11, size: 64, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !17, file: !18, line: 277, baseType: !11, size: 64, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !17, file: !18, line: 278, baseType: !11, size: 64, offset: 384)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !17, file: !18, line: 279, baseType: !11, size: 64, offset: 448)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !17, file: !18, line: 280, baseType: !11, size: 64, offset: 512)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !17, file: !18, line: 281, baseType: !11, size: 64, offset: 576)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !17, file: !18, line: 282, baseType: !11, size: 64, offset: 640)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !17, file: !18, line: 283, baseType: !11, size: 64, offset: 704)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !17, file: !18, line: 284, baseType: !33, size: 64, offset: 768)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !18, line: 186, size: 192, elements: !35)
!35 = !{!36, !37, !39}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !34, file: !18, line: 187, baseType: !33, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !34, file: !18, line: 188, baseType: !38, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !34, file: !18, line: 189, baseType: !7, size: 32, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !17, file: !18, line: 285, baseType: !38, size: 64, offset: 832)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !17, file: !18, line: 286, baseType: !7, size: 32, offset: 896)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !17, file: !18, line: 287, baseType: !7, size: 32, offset: 928)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !17, file: !18, line: 288, baseType: !44, size: 64, offset: 960)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !45, line: 141, baseType: !12)
!45 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !17, file: !18, line: 289, baseType: !47, size: 16, offset: 1024)
!47 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !17, file: !18, line: 290, baseType: !49, size: 8, offset: 1040)
!49 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !17, file: !18, line: 291, baseType: !51, size: 8, offset: 1048)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 1)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !17, file: !18, line: 292, baseType: !55, size: 64, offset: 1088)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !18, line: 180, baseType: null)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !17, file: !18, line: 293, baseType: !58, size: 64, offset: 1152)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !45, line: 142, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !45, line: 56, baseType: !60)
!60 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !17, file: !18, line: 294, baseType: !62, size: 64, offset: 1216)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !17, file: !18, line: 295, baseType: !62, size: 64, offset: 1280)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !17, file: !18, line: 296, baseType: !62, size: 64, offset: 1344)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !17, file: !18, line: 297, baseType: !62, size: 64, offset: 1408)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !17, file: !18, line: 298, baseType: !67, size: 32, offset: 1472)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !68, line: 211, baseType: !13)
!68 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !17, file: !18, line: 299, baseType: !7, size: 32, offset: 1504)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !17, file: !18, line: 300, baseType: !71, size: 192, offset: 1536)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 192, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 24)
!74 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_unit_list", file: !77, line: 7, baseType: !78)
!77 = !DIFile(filename: "/home/wslee/benchmarks/bottlerocket-0.05b3/./br_cmd_engine.h", directory: "")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_br_unit_list_27", file: !77, line: 7, size: 192, elements: !79)
!79 = !{!80, !81, !82, !84}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "numunits", scope: !78, file: !77, line: 8, baseType: !7, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "allocatedunits", scope: !78, file: !77, line: 9, baseType: !7, size: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "devs", scope: !78, file: !77, line: 10, baseType: !83, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "houses", scope: !78, file: !77, line: 11, baseType: !83, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_control_info", file: !77, line: 14, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_br_control_info_28", file: !77, line: 14, size: 256, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !96}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !88, file: !77, line: 15, baseType: !7, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !88, file: !77, line: 16, baseType: !7, size: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "numcmds", scope: !88, file: !77, line: 17, baseType: !7, size: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "allocatedcmds", scope: !88, file: !77, line: 18, baseType: !7, size: 32, offset: 96)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !88, file: !77, line: 19, baseType: !95, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "cmds", scope: !88, file: !77, line: 20, baseType: !83, size: 64, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !102, line: 106, size: 256, elements: !103)
!102 = !DIFile(filename: "/usr/include/getopt.h", directory: "")
!103 = !{!104, !105, !106, !107}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !101, file: !102, line: 107, baseType: !8, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !101, file: !102, line: 108, baseType: !7, size: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !101, file: !102, line: 109, baseType: !83, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !101, file: !102, line: 110, baseType: !7, size: 32, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !110, line: 67, baseType: !111)
!110 = !DIFile(filename: "/usr/include/sys/select.h", directory: "")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_fd_set_10", file: !110, line: 67, size: 1024, elements: !112)
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__fds_bits", scope: !111, file: !110, line: 68, baseType: !114, size: 1024)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 1024, elements: !116)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !110, line: 55, baseType: !12)
!116 = !{!117}
!117 = !DISubrange(count: 16)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !120, line: 69, size: 128, elements: !121)
!120 = !DIFile(filename: "/usr/include/bits/time.h", directory: "")
!121 = !{!122, !124}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !119, file: !120, line: 70, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !45, line: 149, baseType: !12)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !119, file: !120, line: 71, baseType: !125, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !45, line: 151, baseType: !12)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timezone", file: !128, line: 57, size: 64, elements: !129)
!128 = !DIFile(filename: "/usr/include/sys/time.h", directory: "")
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tz_minuteswest", scope: !127, file: !128, line: 58, baseType: !7, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tz_dsttime", scope: !127, file: !128, line: 59, baseType: !7, size: 32, offset: 32)
!132 = !{!0, !133, !136, !138, !140, !145, !150, !153, !156, !158, !160, !164, !169, !172}
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "br_post_cmd_delay", scope: !2, file: !135, line: 81, type: !7, isLocal: false, isDefinition: true)
!135 = !DIFile(filename: "/home/wslee/benchmarks/bottlerocket-0.05b3/./br_cmd.c", directory: "")
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "br_inter_bit_delay", scope: !2, file: !135, line: 82, type: !7, isLocal: false, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "br_verbose", scope: !2, file: !135, line: 84, type: !7, isLocal: false, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "br_cmd_list", scope: !2, file: !135, line: 86, type: !142, isLocal: false, isDefinition: true)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 576, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 9)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "br_error_handler", scope: !2, file: !135, line: 107, type: !147, isLocal: false, isDefinition: true)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !11, !11}
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "Verbose", scope: !2, file: !152, line: 60, type: !7, isLocal: false, isDefinition: true)
!152 = !DIFile(filename: "/home/wslee/benchmarks/bottlerocket-0.05b3/./br.c", directory: "")
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "br_default_house", scope: !2, file: !155, line: 46, type: !7, isLocal: false, isDefinition: true)
!155 = !DIFile(filename: "/home/wslee/benchmarks/bottlerocket-0.05b3/./br_cmd_engine.c", directory: "")
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "MyName", scope: !2, file: !152, line: 61, type: !11, isLocal: false, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "saved_br_error_handler", scope: !2, file: !152, line: 62, type: !147, isLocal: false, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "housecode_table", scope: !2, file: !162, line: 27, type: !163, isLocal: true, isDefinition: true)
!162 = !DIFile(filename: "/home/wslee/benchmarks/bottlerocket-0.05b3/./br_translate.h", directory: "")
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 128, elements: !116)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "device_table", scope: !2, file: !162, line: 38, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 256, elements: !167)
!167 = !{!117, !168}
!168 = !DISubrange(count: 2)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "cmd_table", scope: !2, file: !162, line: 49, type: !171, isLocal: true, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 72, elements: !143)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !152, line: 515, type: !174, isLocal: true, isDefinition: true)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 3840, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 15)
