; ModuleID = '/tmp/tmp.ll'
source_filename = "c/brutefir-1.0f.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [7 x i8] c"-quiet\00", align 1
@.str.1 = private unnamed_addr constant [11 x i8] c"-nodefault\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c"-daemon\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.3 = private unnamed_addr constant [83 x i8] c"\0ABruteFIR v1.0f (August 2005)                                  (c) Anders Torger\0A\0A\00", align 1
@.str.4 = private unnamed_addr constant [64 x i8] c"Usage: %s [-quiet] [-nodefault] [-daemon] [configuration file]\0A\00", align 1
@.str.5 = private unnamed_addr constant [16 x i8] c"fork failed: %s\00", align 1
@.str.6 = private unnamed_addr constant [18 x i8] c"setsid failed: %s\00", align 1
@.str.7 = private unnamed_addr constant [2 x i8] c"/\00", align 1
@.str.8 = private unnamed_addr constant [17 x i8] c"chdir failed: %s\00", align 1
@.str.9 = private unnamed_addr constant [28 x i8] c"Could not start filtering.\0A\00", align 1

; Function Attrs: noinline nounwind ssp uwtable

!0 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"PIC Level", i32 2}
!5 = distinct !DICompileUnit(language: DW_LANG_C99, file: !6, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !8, nameTableKind: GNU)
!6 = !DIFile(filename: "c/brutefir-1.0f.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!7 = !{}
!8 = !{!9, !11, !12, !14, !15, !77}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!14 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !17, line: 49, baseType: !18)
!17 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !19, line: 271, size: 1728, elements: !20)
!19 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!20 = !{!21, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !42, !43, !44, !45, !49, !51, !53, !57, !60, !64, !65, !66, !67, !68, !72, !73}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !18, file: !19, line: 272, baseType: !22, size: 32)
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !18, file: !19, line: 273, baseType: !9, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !18, file: !19, line: 274, baseType: !9, size: 64, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !18, file: !19, line: 275, baseType: !9, size: 64, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !18, file: !19, line: 276, baseType: !9, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !18, file: !19, line: 277, baseType: !9, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !18, file: !19, line: 278, baseType: !9, size: 64, offset: 384)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !18, file: !19, line: 279, baseType: !9, size: 64, offset: 448)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !18, file: !19, line: 280, baseType: !9, size: 64, offset: 512)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !18, file: !19, line: 281, baseType: !9, size: 64, offset: 576)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !18, file: !19, line: 282, baseType: !9, size: 64, offset: 640)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !18, file: !19, line: 283, baseType: !9, size: 64, offset: 704)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !18, file: !19, line: 284, baseType: !35, size: 64, offset: 768)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !19, line: 186, size: 192, elements: !37)
!37 = !{!38, !39, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !36, file: !19, line: 187, baseType: !35, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !36, file: !19, line: 188, baseType: !40, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !36, file: !19, line: 189, baseType: !22, size: 32, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !18, file: !19, line: 285, baseType: !40, size: 64, offset: 832)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !18, file: !19, line: 286, baseType: !22, size: 32, offset: 896)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !18, file: !19, line: 287, baseType: !22, size: 32, offset: 928)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !18, file: !19, line: 288, baseType: !46, size: 64, offset: 960)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !47, line: 141, baseType: !48)
!47 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!48 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !18, file: !19, line: 289, baseType: !50, size: 16, offset: 1024)
!50 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !18, file: !19, line: 290, baseType: !52, size: 8, offset: 1040)
!52 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !18, file: !19, line: 291, baseType: !54, size: 8, offset: 1048)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 1)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !18, file: !19, line: 292, baseType: !58, size: 64, offset: 1088)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !19, line: 180, baseType: null)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !18, file: !19, line: 293, baseType: !61, size: 64, offset: 1152)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !47, line: 142, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !47, line: 56, baseType: !63)
!63 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !18, file: !19, line: 294, baseType: !11, size: 64, offset: 1216)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !18, file: !19, line: 295, baseType: !11, size: 64, offset: 1280)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !18, file: !19, line: 296, baseType: !11, size: 64, offset: 1344)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !18, file: !19, line: 297, baseType: !11, size: 64, offset: 1408)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !18, file: !19, line: 298, baseType: !69, size: 32, offset: 1472)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 211, baseType: !71)
!70 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!71 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !18, file: !19, line: 299, baseType: !22, size: 32, offset: 1504)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !18, file: !19, line: 300, baseType: !74, size: 192, offset: 1536)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 192, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 24)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !47, line: 139, baseType: !71)
!78 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!79 = distinct !DISubprogram(name: "main", scope: !80, file: !80, line: 29, type: !81, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, retainedNodes: !7)
!80 = !DIFile(filename: "/home/wslee/benchmarks/sound/brutefir-1.0f/brutefir.c", directory: "")
!81 = !DISubroutineType(types: !82)
!82 = !{!22, !22, !83}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!84 = !DILocalVariable(name: "argc", arg: 1, scope: !79, file: !80, line: 29, type: !22)
!85 = !DILocation(line: 0, scope: !79)
!86 = !DILocalVariable(name: "argv", arg: 2, scope: !79, file: !80, line: 29, type: !83)
!87 = !DILocalVariable(name: "__cil_tmp20", scope: !79, file: !80, line: 48, type: !9)
!88 = !DILocation(line: 48, column: 9, scope: !79)
!89 = !DILocalVariable(name: "__cil_tmp21", scope: !79, file: !80, line: 49, type: !9)
!90 = !DILocation(line: 49, column: 9, scope: !79)
!91 = !DILocalVariable(name: "__cil_tmp22", scope: !79, file: !80, line: 50, type: !9)
!92 = !DILocation(line: 50, column: 9, scope: !79)
!93 = !DILocalVariable(name: "__cil_tmp23", scope: !79, file: !80, line: 51, type: !9)
!94 = !DILocation(line: 51, column: 9, scope: !79)
!95 = !DILocalVariable(name: "__cil_tmp24", scope: !79, file: !80, line: 52, type: !9)
!96 = !DILocation(line: 52, column: 9, scope: !79)
!97 = !DILocalVariable(name: "__cil_tmp25", scope: !79, file: !80, line: 53, type: !9)
!98 = !DILocation(line: 53, column: 9, scope: !79)
!99 = !DILocalVariable(name: "__cil_tmp26", scope: !79, file: !80, line: 54, type: !9)
!100 = !DILocation(line: 54, column: 9, scope: !79)
!101 = !DILocalVariable(name: "__cil_tmp27", scope: !79, file: !80, line: 55, type: !9)
!102 = !DILocation(line: 55, column: 9, scope: !79)
!103 = !DILocalVariable(name: "__cil_tmp28", scope: !79, file: !80, line: 56, type: !9)
!104 = !DILocation(line: 56, column: 9, scope: !79)
!105 = !DILocalVariable(name: "__cil_tmp29", scope: !79, file: !80, line: 57, type: !9)
!106 = !DILocation(line: 57, column: 9, scope: !79)
!107 = !DILocalVariable(name: "__cil_tmp30", scope: !79, file: !80, line: 58, type: !9)
!108 = !DILocation(line: 58, column: 9, scope: !79)
!109 = !DILocalVariable(name: "__cil_tmp31", scope: !79, file: !80, line: 59, type: !9)
!110 = !DILocation(line: 59, column: 9, scope: !79)
!111 = !DILocalVariable(name: "__cil_tmp32", scope: !79, file: !80, line: 60, type: !9)
!112 = !DILocation(line: 60, column: 9, scope: !79)
!113 = !DILocalVariable(name: "config_filename", scope: !79, file: !80, line: 31, type: !9)
!114 = !DILocalVariable(name: "quiet", scope: !79, file: !80, line: 32, type: !115)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool_t", file: !116, line: 14, baseType: !22)
!116 = !DIFile(filename: "/home/wslee/benchmarks/sound/brutefir-1.0f/defs.h", directory: "")
!117 = !DILocalVariable(name: "nodefault", scope: !79, file: !80, line: 33, type: !115)
!118 = !DILocalVariable(name: "run_as_daemon", scope: !79, file: !80, line: 34, type: !115)
!119 = !DILocalVariable(name: "n", scope: !79, file: !80, line: 35, type: !22)
!120 = !DILocation(line: 48, column: 3, scope: !121)
!121 = distinct !DILexicalBlock(scope: !122, file: !80, line: 50, column: 3)
!122 = distinct !DILexicalBlock(scope: !123, file: !80, line: 49, column: 3)
!123 = distinct !DILexicalBlock(scope: !79, file: !80, line: 62, column: 3)
!124 = !DILocation(line: 35, column: 13, scope: !123)
!125 = !DILocation(line: 0, scope: !123)
!126 = !DILocation(line: 33, column: 19, scope: !123)
!127 = !DILocation(line: 36, column: 17, scope: !123)
!128 = !DILocation(line: 48, column: 13, scope: !121)
