; ModuleID = '/tmp/tmp.ll'
source_filename = "c/buthead-1.0.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [17 x i8] c"Usage: %s count\0A\00", align 1
@.str.1 = private unnamed_addr constant [40 x i8] c"buthead error: invalid line count '%s'\0A\00", align 1
@stdin = external global %struct._IO_FILE*, align 8
@.str.2 = private unnamed_addr constant [51 x i8] c"buthead error: EOF on line %ld while skipping %ld\0A\00", align 1

; Function Attrs: noinline nounwind ssp uwtable
define i32 @main(i32 %argc, i8** %argv) #0 !dbg !78 {
entry:
  %p = alloca i8*, align 8
  call void @llvm.dbg.value(metadata i32 %argc, metadata !82, metadata !DIExpression()), !dbg !83
  call void @llvm.dbg.value(metadata i8** %argv, metadata !84, metadata !DIExpression()), !dbg !83
  call void @llvm.dbg.declare(metadata i8** %p, metadata !85, metadata !DIExpression()), !dbg !86
  call void @llvm.dbg.declare(metadata !7, metadata !87, metadata !DIExpression()), !dbg !88
  call void @llvm.dbg.declare(metadata !7, metadata !89, metadata !DIExpression()), !dbg !90

!0 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"PIC Level", i32 2}
!5 = distinct !DICompileUnit(language: DW_LANG_C99, file: !6, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !8, nameTableKind: GNU)
!6 = !DIFile(filename: "c/buthead-1.0.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!7 = !{}
!8 = !{!9, !74, !76, !16}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !11, line: 49, baseType: !12)
!11 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !13, line: 271, size: 1728, elements: !14)
!13 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!14 = !{!15, !17, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !38, !39, !40, !41, !45, !47, !49, !53, !56, !60, !62, !63, !64, !65, !69, !70}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !12, file: !13, line: 272, baseType: !16, size: 32)
!16 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !12, file: !13, line: 273, baseType: !18, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !12, file: !13, line: 274, baseType: !18, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !12, file: !13, line: 275, baseType: !18, size: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !12, file: !13, line: 276, baseType: !18, size: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !12, file: !13, line: 277, baseType: !18, size: 64, offset: 320)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !12, file: !13, line: 278, baseType: !18, size: 64, offset: 384)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !12, file: !13, line: 279, baseType: !18, size: 64, offset: 448)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !12, file: !13, line: 280, baseType: !18, size: 64, offset: 512)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !12, file: !13, line: 281, baseType: !18, size: 64, offset: 576)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !12, file: !13, line: 282, baseType: !18, size: 64, offset: 640)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !12, file: !13, line: 283, baseType: !18, size: 64, offset: 704)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !12, file: !13, line: 284, baseType: !31, size: 64, offset: 768)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !13, line: 186, size: 192, elements: !33)
!33 = !{!34, !35, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !32, file: !13, line: 187, baseType: !31, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !32, file: !13, line: 188, baseType: !36, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !32, file: !13, line: 189, baseType: !16, size: 32, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !12, file: !13, line: 285, baseType: !36, size: 64, offset: 832)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !12, file: !13, line: 286, baseType: !16, size: 32, offset: 896)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !12, file: !13, line: 287, baseType: !16, size: 32, offset: 928)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !12, file: !13, line: 288, baseType: !42, size: 64, offset: 960)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !43, line: 141, baseType: !44)
!43 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!44 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !12, file: !13, line: 289, baseType: !46, size: 16, offset: 1024)
!46 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !12, file: !13, line: 290, baseType: !48, size: 8, offset: 1040)
!48 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !12, file: !13, line: 291, baseType: !50, size: 8, offset: 1048)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 1)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !12, file: !13, line: 292, baseType: !54, size: 64, offset: 1088)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !13, line: 180, baseType: null)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !12, file: !13, line: 293, baseType: !57, size: 64, offset: 1152)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !43, line: 142, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !43, line: 56, baseType: !59)
!59 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !12, file: !13, line: 294, baseType: !61, size: 64, offset: 1216)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !12, file: !13, line: 295, baseType: !61, size: 64, offset: 1280)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !12, file: !13, line: 296, baseType: !61, size: 64, offset: 1344)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !12, file: !13, line: 297, baseType: !61, size: 64, offset: 1408)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !12, file: !13, line: 298, baseType: !66, size: 32, offset: 1472)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !67, line: 211, baseType: !68)
!67 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!68 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !12, file: !13, line: 299, baseType: !16, size: 32, offset: 1504)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !12, file: !13, line: 300, baseType: !71, size: 192, offset: 1536)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 192, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 24)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!77 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!78 = distinct !DISubprogram(name: "main", scope: !79, file: !79, line: 14, type: !80, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, retainedNodes: !7)
!79 = !DIFile(filename: "/home/wslee/benchmarks/textformat/buthead-1.0/buthead.c", directory: "")
!80 = !DISubroutineType(types: !81)
!81 = !{!16, !16, !76}
!82 = !DILocalVariable(name: "argc", arg: 1, scope: !78, file: !79, line: 14, type: !16)
!83 = !DILocation(line: 0, scope: !78)
!84 = !DILocalVariable(name: "argv", arg: 2, scope: !78, file: !79, line: 14, type: !76)
!85 = !DILocalVariable(name: "p", scope: !78, file: !79, line: 19, type: !18)
!86 = !DILocation(line: 19, column: 9, scope: !78)
!87 = !DILocalVariable(name: "__cil_tmp8", scope: !78, file: !79, line: 21, type: !18)
!88 = !DILocation(line: 21, column: 9, scope: !78)
!89 = !DILocalVariable(name: "__cil_tmp9", scope: !78, file: !79, line: 22, type: !18)
!90 = !DILocation(line: 22, column: 9, scope: !78)
!91 = !DILocalVariable(name: "__cil_tmp10", scope: !78, file: !79, line: 23, type: !18)
!92 = !DILocation(line: 23, column: 9, scope: !78)
!93 = !DILocalVariable(name: "__cil_tmp11", scope: !78, file: !79, line: 24, type: !18)
!94 = !DILocation(line: 24, column: 9, scope: !78)
!95 = !DILocalVariable(name: "__cil_tmp12", scope: !78, file: !79, line: 25, type: !18)
!96 = !DILocation(line: 25, column: 9, scope: !78)
!97 = !DILocalVariable(name: "__cil_tmp13", scope: !78, file: !79, line: 26, type: !18)
!98 = !DILocation(line: 26, column: 9, scope: !78)
!99 = !DILocation(line: 20, column: 12, scope: !100)
!100 = distinct !DILexicalBlock(scope: !101, file: !79, line: 20, column: 7)
!101 = distinct !DILexicalBlock(scope: !78, file: !79, line: 28, column: 3)
!102 = !DILocation(line: 20, column: 7, scope: !101)
!103 = !DILocation(line: 21, column: 38, scope: !104)
!104 = distinct !DILexicalBlock(scope: !105, file: !79, line: 22, column: 5)
!105 = distinct !DILexicalBlock(scope: !106, file: !79, line: 21, column: 5)
!106 = distinct !DILexicalBlock(scope: !100, file: !79, line: 20, column: 18)
!107 = !DILocation(line: 22, column: 20, scope: !104)
!108 = !DILocation(line: 22, column: 13, scope: !104)
!109 = !DILocation(line: 21, column: 5, scope: !104)
!110 = !DILocation(line: 22, column: 5, scope: !111)
!111 = distinct !DILexicalBlock(scope: !105, file: !79, line: 24, column: 5)
!112 = !DILocation(line: 25, column: 66, scope: !113)
!113 = distinct !DILexicalBlock(scope: !114, file: !79, line: 27, column: 3)
!114 = distinct !DILexicalBlock(scope: !101, file: !79, line: 26, column: 3)
!115 = !DILocation(line: 25, column: 59, scope: !113)
!116 = !DILocation(line: 25, column: 19, scope: !113)
!117 = !DILocalVariable(name: "lines_to_skip", scope: !78, file: !79, line: 16, type: !44)
!118 = !DILocation(line: 27, column: 9, scope: !119)
!119 = distinct !DILexicalBlock(scope: !114, file: !79, line: 28, column: 3)
!120 = !DILocalVariable(name: "tmp", scope: !78, file: !79, line: 20, type: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!122 = !DILocation(line: 27, column: 7, scope: !123)
!123 = distinct !DILexicalBlock(scope: !101, file: !79, line: 27, column: 7)
!124 = !DILocation(line: 27, column: 7, scope: !101)
!125 = !DILocation(line: 28, column: 38, scope: !126)
!126 = distinct !DILexicalBlock(scope: !127, file: !79, line: 29, column: 5)
!127 = distinct !DILexicalBlock(scope: !128, file: !79, line: 28, column: 5)
