; ModuleID = '/tmp/tmp.ll'
source_filename = "c/cd-discid-1.1.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.cdrom_tochdr = type { i8, i8 }
%struct.cdrom_tocentry = type { i8, i8, i8, %union.cdrom_addr, i8 }
%union.cdrom_addr = type { i32 }

@.str = private unnamed_addr constant [11 x i8] c"/dev/cdrom\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.1 = private unnamed_addr constant [24 x i8] c"Usage: %s [devicename]\0A\00", align 1
@.str.2 = private unnamed_addr constant [9 x i8] c"%s: %s: \00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"open\00", align 1
@.str.4 = private unnamed_addr constant [16 x i8] c"CDROMREADTOCHDR\00", align 1
@.str.5 = private unnamed_addr constant [47 x i8] c"%s: %s: Can't allocate memory for TOC entries\0A\00", align 1
@.str.6 = private unnamed_addr constant [18 x i8] c"CDROMREADTOCENTRY\00", align 1
@.str.7 = private unnamed_addr constant [6 x i8] c"%08lx\00", align 1
@.str.8 = private unnamed_addr constant [4 x i8] c" %d\00", align 1
@.str.9 = private unnamed_addr constant [5 x i8] c" %d\0A\00", align 1

; Function Attrs: noinline nounwind ssp uwtable

!0 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"PIC Level", i32 2}
!5 = distinct !DICompileUnit(language: DW_LANG_C99, file: !6, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !8, nameTableKind: GNU)
!6 = !DIFile(filename: "c/cd-discid-1.1.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!7 = !{}
!8 = !{!9, !10, !12, !75, !19, !77, !67, !78, !83, !45, !62}
!9 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 49, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !16, line: 271, size: 1728, elements: !17)
!16 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!17 = !{!18, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !39, !40, !41, !42, !46, !48, !50, !54, !57, !61, !63, !64, !65, !66, !70, !71}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !15, file: !16, line: 272, baseType: !19, size: 32)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !15, file: !16, line: 273, baseType: !10, size: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !15, file: !16, line: 274, baseType: !10, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !15, file: !16, line: 275, baseType: !10, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !15, file: !16, line: 276, baseType: !10, size: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !15, file: !16, line: 277, baseType: !10, size: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !15, file: !16, line: 278, baseType: !10, size: 64, offset: 384)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !15, file: !16, line: 279, baseType: !10, size: 64, offset: 448)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !15, file: !16, line: 280, baseType: !10, size: 64, offset: 512)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !15, file: !16, line: 281, baseType: !10, size: 64, offset: 576)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !15, file: !16, line: 282, baseType: !10, size: 64, offset: 640)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !15, file: !16, line: 283, baseType: !10, size: 64, offset: 704)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !15, file: !16, line: 284, baseType: !32, size: 64, offset: 768)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !16, line: 186, size: 192, elements: !34)
!34 = !{!35, !36, !38}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !33, file: !16, line: 187, baseType: !32, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !33, file: !16, line: 188, baseType: !37, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !33, file: !16, line: 189, baseType: !19, size: 32, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !15, file: !16, line: 285, baseType: !37, size: 64, offset: 832)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !15, file: !16, line: 286, baseType: !19, size: 32, offset: 896)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !15, file: !16, line: 287, baseType: !19, size: 32, offset: 928)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !15, file: !16, line: 288, baseType: !43, size: 64, offset: 960)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !44, line: 141, baseType: !45)
!44 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !15, file: !16, line: 289, baseType: !47, size: 16, offset: 1024)
!47 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !15, file: !16, line: 290, baseType: !49, size: 8, offset: 1040)
!49 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !15, file: !16, line: 291, baseType: !51, size: 8, offset: 1048)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 1)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !15, file: !16, line: 292, baseType: !55, size: 64, offset: 1088)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !16, line: 180, baseType: null)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !15, file: !16, line: 293, baseType: !58, size: 64, offset: 1152)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !44, line: 142, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !44, line: 56, baseType: !60)
!60 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !15, file: !16, line: 294, baseType: !62, size: 64, offset: 1216)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !15, file: !16, line: 295, baseType: !62, size: 64, offset: 1280)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !15, file: !16, line: 296, baseType: !62, size: 64, offset: 1344)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !15, file: !16, line: 297, baseType: !62, size: 64, offset: 1408)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !15, file: !16, line: 298, baseType: !67, size: 32, offset: 1472)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !68, line: 211, baseType: !69)
!68 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!69 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !15, file: !16, line: 299, baseType: !19, size: 32, offset: 1504)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !15, file: !16, line: 300, baseType: !72, size: 192, offset: 1536)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 192, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 24)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!77 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cdrom_tocentry", file: !80, line: 219, size: 96, elements: !81)
!80 = !DIFile(filename: "/usr/include/linux/cdrom.h", directory: "")
!81 = !{!82, !85, !86, !87, !88, !98}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "cdte_track", scope: !79, file: !80, line: 220, baseType: !83, size: 8)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !84, line: 20, baseType: !9)
!84 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!85 = !DIDerivedType(tag: DW_TAG_member, name: "cdte_adr", scope: !79, file: !80, line: 221, baseType: !83, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "cdte_ctrl", scope: !79, file: !80, line: 222, baseType: !83, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 8)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "cdte_format", scope: !79, file: !80, line: 223, baseType: !83, size: 8, offset: 16)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "cdte_addr", scope: !79, file: !80, line: 224, baseType: !89, size: 32, offset: 32)
!89 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cdrom_addr", file: !80, line: 162, size: 32, elements: !90)
!90 = !{!91, !97}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "msf", scope: !89, file: !80, line: 163, baseType: !92, size: 24)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cdrom_msf0", file: !80, line: 154, size: 24, elements: !93)
!93 = !{!94, !95, !96}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "minute", scope: !92, file: !80, line: 155, baseType: !83, size: 8)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: !92, file: !80, line: 156, baseType: !83, size: 8, offset: 8)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !92, file: !80, line: 157, baseType: !83, size: 8, offset: 16)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "lba", scope: !89, file: !80, line: 164, baseType: !19, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "cdte_datamode", scope: !79, file: !80, line: 225, baseType: !83, size: 8, offset: 64)
!99 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!100 = distinct !DISubprogram(name: "cddb_sum", scope: !101, file: !101, line: 101, type: !102, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, retainedNodes: !7)
!101 = !DIFile(filename: "/home/wslee/benchmarks/sound/cd-discid-1.1/cd-discid.c", directory: "")
!102 = !DISubroutineType(types: !103)
!103 = !{!19, !19}
!104 = !DILocalVariable(name: "n", arg: 1, scope: !100, file: !101, line: 101, type: !19)
!105 = !DILocation(line: 0, scope: !100)
!106 = !DILocalVariable(name: "ret", scope: !100, file: !101, line: 103, type: !19)
!107 = !DILocation(line: 106, column: 3, scope: !108)
!108 = distinct !DILexicalBlock(scope: !109, file: !101, line: 106, column: 3)
!109 = distinct !DILexicalBlock(scope: !110, file: !101, line: 105, column: 3)
!110 = distinct !DILexicalBlock(scope: !100, file: !101, line: 105, column: 3)
!111 = !DILocation(line: 0, scope: !110)
!112 = !DILocation(line: 106, column: 13, scope: !108)
!113 = !DILocation(line: 106, column: 14, scope: !114)
!114 = distinct !DILexicalBlock(scope: !115, file: !101, line: 106, column: 9)
!115 = distinct !DILexicalBlock(scope: !108, file: !101, line: 106, column: 13)
!116 = !DILocation(line: 106, column: 9, scope: !115)
!117 = !DILocation(line: 106, column: 7, scope: !118)
!118 = distinct !DILexicalBlock(scope: !114, file: !101, line: 106, column: 20)
!119 = !DILocation(line: 107, column: 14, scope: !115)
!120 = !DILocation(line: 107, column: 9, scope: !115)
!121 = !DILocation(line: 108, column: 7, scope: !115)
!122 = distinct !{!122, !107, !123}
!123 = !DILocation(line: 109, column: 3, scope: !108)
!124 = !DILocation(line: 111, column: 3, scope: !108)
!125 = !DILocation(line: 111, column: 3, scope: !110)
!126 = distinct !DISubprogram(name: "main", scope: !101, file: !101, line: 114, type: !127, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, retainedNodes: !7)
!127 = !DISubroutineType(types: !128)
!128 = !{!19, !19, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!130 = !DILocalVariable(name: "argc", arg: 1, scope: !126, file: !101, line: 114, type: !19)
!131 = !DILocation(line: 0, scope: !126)
!132 = !DILocalVariable(name: "argv", arg: 2, scope: !126, file: !101, line: 114, type: !129)
!133 = !DILocalVariable(name: "hdr", scope: !126, file: !101, line: 124, type: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cdrom_tochdr", file: !80, line: 189, size: 16, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "cdth_trk0", scope: !134, file: !80, line: 190, baseType: !83, size: 8)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "cdth_trk1", scope: !134, file: !80, line: 191, baseType: !83, size: 8, offset: 8)
!138 = !DILocation(line: 124, column: 23, scope: !126)
!139 = !DILocalVariable(name: "__cil_tmp18", scope: !126, file: !101, line: 131, type: !10)
!140 = !DILocation(line: 131, column: 9, scope: !126)
!141 = !DILocalVariable(name: "__cil_tmp19", scope: !126, file: !101, line: 132, type: !10)
!142 = !DILocation(line: 132, column: 9, scope: !126)
!143 = !DILocalVariable(name: "__cil_tmp20", scope: !126, file: !101, line: 133, type: !10)
!144 = !DILocation(line: 133, column: 9, scope: !126)
!145 = !DILocalVariable(name: "__cil_tmp21", scope: !126, file: !101, line: 134, type: !10)
!146 = !DILocation(line: 134, column: 9, scope: !126)
!147 = !DILocalVariable(name: "__cil_tmp22", scope: !126, file: !101, line: 135, type: !10)
!148 = !DILocation(line: 135, column: 9, scope: !126)
!149 = !DILocalVariable(name: "__cil_tmp23", scope: !126, file: !101, line: 136, type: !10)
!150 = !DILocation(line: 136, column: 9, scope: !126)
!151 = !DILocalVariable(name: "__cil_tmp24", scope: !126, file: !101, line: 137, type: !10)
!152 = !DILocation(line: 137, column: 9, scope: !126)
!153 = !DILocalVariable(name: "__cil_tmp25", scope: !126, file: !101, line: 138, type: !10)
!154 = !DILocation(line: 138, column: 9, scope: !126)
!155 = !DILocalVariable(name: "__cil_tmp26", scope: !126, file: !101, line: 139, type: !10)
!156 = !DILocation(line: 139, column: 9, scope: !126)
!157 = !DILocalVariable(name: "__cil_tmp27", scope: !126, file: !101, line: 140, type: !10)
!158 = !DILocation(line: 140, column: 9, scope: !126)
!159 = !DILocalVariable(name: "__cil_tmp28", scope: !126, file: !101, line: 141, type: !10)
!160 = !DILocation(line: 141, column: 9, scope: !126)
!161 = !DILocalVariable(name: "__cil_tmp29", scope: !126, file: !101, line: 142, type: !10)
!162 = !DILocation(line: 142, column: 9, scope: !126)
!163 = !DILocalVariable(name: "__cil_tmp30", scope: !126, file: !101, line: 143, type: !10)
!164 = !DILocation(line: 143, column: 9, scope: !126)
!165 = !DILocalVariable(name: "__cil_tmp31", scope: !126, file: !101, line: 144, type: !10)
!166 = !DILocation(line: 144, column: 9, scope: !126)
!167 = !DILocalVariable(name: "__cil_tmp32", scope: !126, file: !101, line: 145, type: !10)
!168 = !DILocation(line: 145, column: 9, scope: !126)
!169 = !DILocalVariable(name: "cksum", scope: !126, file: !101, line: 120, type: !45)
!170 = !DILocalVariable(name: "first", scope: !126, file: !101, line: 121, type: !9)
!171 = !DILocalVariable(name: "last", scope: !126, file: !101, line: 122, type: !9)
!172 = !DILocalVariable(name: "devicename", scope: !126, file: !101, line: 123, type: !10)
!173 = !DILocation(line: 129, column: 12, scope: !174)
!174 = distinct !DILexicalBlock(scope: !175, file: !101, line: 129, column: 7)
!175 = distinct !DILexicalBlock(scope: !126, file: !101, line: 147, column: 3)
!176 = !DILocation(line: 129, column: 7, scope: !175)
!177 = !DILocation(line: 130, column: 25, scope: !178)
!178 = distinct !DILexicalBlock(scope: !174, file: !101, line: 129, column: 18)
!179 = !DILocation(line: 130, column: 18, scope: !178)
!180 = !DILocation(line: 131, column: 3, scope: !178)
!181 = !DILocation(line: 131, column: 12, scope: !182)
!182 = distinct !DILexicalBlock(scope: !174, file: !101, line: 131, column: 7)
!183 = !DILocation(line: 131, column: 7, scope: !174)
!184 = !DILocation(line: 132, column: 38, scope: !185)
!185 = distinct !DILexicalBlock(scope: !186, file: !101, line: 133, column: 5)
!186 = distinct !DILexicalBlock(scope: !187, file: !101, line: 132, column: 5)
!187 = distinct !DILexicalBlock(scope: !182, file: !101, line: 131, column: 17)
!188 = !DILocation(line: 133, column: 20, scope: !185)
!189 = !DILocation(line: 133, column: 13, scope: !185)
!190 = !DILocation(line: 132, column: 5, scope: !185)
!191 = !DILocation(line: 133, column: 5, scope: !192)
!192 = distinct !DILexicalBlock(scope: !186, file: !101, line: 135, column: 5)
