; ModuleID = '/tmp/tmp.ll'
source_filename = "c/confget-1.02.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct.real_pcre = type opaque
%struct.pcre_extra = type { i64, i8*, i64, i8*, i8*, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.__anonstruct_confget_backend_31 = type { i8*, i32 ()*, i32 ()*, i32 ()* }

@lflag = internal global i32 0, align 4, !dbg !0
@margc = internal global i32 0, align 4, !dbg !108
@Lflag = internal global i32 0, align 4, !dbg !142
@xflag = internal global i32 0, align 4, !dbg !146
@x_margv = internal global %struct.real_pcre** null, align 8, !dbg !150
@x_margv_extra = internal global %struct.pcre_extra** null, align 8, !dbg !154
@.str = private unnamed_addr constant [46 x i8] c"Could not match '%s' against the '%s' pattern\00", align 1
@margv = internal global i8** null, align 8, !dbg !111
@morevars = common global i32 0, align 4, !dbg !106
@matchvalue = internal global i8* null, align 8, !dbg !119
@x_matchvalue = internal global %struct.real_pcre* null, align 8, !dbg !148
@x_matchvalue_extra = internal global %struct.pcre_extra* null, align 8, !dbg !152
@cflag = common global i32 0, align 4, !dbg !138

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "lflag", scope: !2, file: !110, line: 91, type: !27, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !98, nameTableKind: GNU)
!3 = !DIFile(filename: "c/confget-1.02.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !11, !27, !28, !19, !29, !17, !32, !86, !23, !94, !95, !96}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcre", file: !9, line: 200, baseType: !10)
!9 = !DIFile(filename: "/usr/include/pcre.h", directory: "")
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_pcre", file: !9, line: 199, flags: DIFlagFwdDecl)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcre_extra", file: !9, line: 214, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcre_extra", file: !9, line: 214, size: 384, elements: !15)
!15 = !{!16, !18, !20, !21, !22, !26}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !14, file: !9, line: 215, baseType: !17, size: 64)
!17 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "study_data", scope: !14, file: !9, line: 216, baseType: !19, size: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "match_limit", scope: !14, file: !9, line: 217, baseType: !17, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "callout_data", scope: !14, file: !9, line: 218, baseType: !19, size: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "tables", scope: !14, file: !9, line: 219, baseType: !23, size: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "match_limit_recursion", scope: !14, file: !9, line: 220, baseType: !17, size: 64, offset: 320)
!27 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !34, line: 49, baseType: !35)
!34 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !36, line: 271, size: 1728, elements: !37)
!36 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!37 = !{!38, !39, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !59, !60, !61, !62, !66, !68, !70, !74, !77, !81, !82, !83, !84, !85, !89, !90}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !35, file: !36, line: 272, baseType: !27, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !35, file: !36, line: 273, baseType: !40, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !35, file: !36, line: 274, baseType: !40, size: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !35, file: !36, line: 275, baseType: !40, size: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !35, file: !36, line: 276, baseType: !40, size: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !35, file: !36, line: 277, baseType: !40, size: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !35, file: !36, line: 278, baseType: !40, size: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !35, file: !36, line: 279, baseType: !40, size: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !35, file: !36, line: 280, baseType: !40, size: 64, offset: 512)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !35, file: !36, line: 281, baseType: !40, size: 64, offset: 576)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !35, file: !36, line: 282, baseType: !40, size: 64, offset: 640)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !35, file: !36, line: 283, baseType: !40, size: 64, offset: 704)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !35, file: !36, line: 284, baseType: !52, size: 64, offset: 768)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !36, line: 186, size: 192, elements: !54)
!54 = !{!55, !56, !58}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !53, file: !36, line: 187, baseType: !52, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !53, file: !36, line: 188, baseType: !57, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !53, file: !36, line: 189, baseType: !27, size: 32, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !35, file: !36, line: 285, baseType: !57, size: 64, offset: 832)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !35, file: !36, line: 286, baseType: !27, size: 32, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !35, file: !36, line: 287, baseType: !27, size: 32, offset: 928)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !35, file: !36, line: 288, baseType: !63, size: 64, offset: 960)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !64, line: 141, baseType: !65)
!64 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!65 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !35, file: !36, line: 289, baseType: !67, size: 16, offset: 1024)
!67 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !35, file: !36, line: 290, baseType: !69, size: 8, offset: 1040)
!69 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !35, file: !36, line: 291, baseType: !71, size: 8, offset: 1048)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 1)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !35, file: !36, line: 292, baseType: !75, size: 64, offset: 1088)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !36, line: 180, baseType: null)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !35, file: !36, line: 293, baseType: !78, size: 64, offset: 1152)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !64, line: 142, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !64, line: 56, baseType: !80)
!80 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !35, file: !36, line: 294, baseType: !19, size: 64, offset: 1216)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !35, file: !36, line: 295, baseType: !19, size: 64, offset: 1280)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !35, file: !36, line: 296, baseType: !19, size: 64, offset: 1344)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !35, file: !36, line: 297, baseType: !19, size: 64, offset: 1408)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !35, file: !36, line: 298, baseType: !86, size: 32, offset: 1472)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !87, line: 211, baseType: !88)
!87 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!88 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !35, file: !36, line: 299, baseType: !27, size: 32, offset: 1504)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !35, file: !36, line: 300, baseType: !91, size: 192, offset: 1536)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 192, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 24)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!98 = !{!99, !102, !104, !106, !108, !111, !115, !117, !119, !121, !123, !125, !138, !140, !0, !142, !144, !146, !148, !150, !152, !154, !156}
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "conffile", scope: !2, file: !101, line: 48, type: !32, isLocal: false, isDefinition: true)
!101 = !DIFile(filename: "/home/wslee/benchmarks/textformat/confget-1.02/confget.h", directory: "")
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "filename", scope: !2, file: !101, line: 51, type: !29, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "section", scope: !2, file: !101, line: 53, type: !29, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "morevars", scope: !2, file: !101, line: 56, type: !27, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "margc", scope: !2, file: !110, line: 52, type: !27, isLocal: true, isDefinition: true)
!110 = !DIFile(filename: "/home/wslee/benchmarks/textformat/confget-1.02/confget.c", directory: "")
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "margv", scope: !2, file: !110, line: 54, type: !113, isLocal: true, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "showvarname", scope: !2, file: !110, line: 56, type: !27, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "manyvars", scope: !2, file: !110, line: 58, type: !27, isLocal: true, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "matchvalue", scope: !2, file: !110, line: 60, type: !29, isLocal: true, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "output_prefix", scope: !2, file: !110, line: 62, type: !29, isLocal: true, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "output_postfix", scope: !2, file: !110, line: 64, type: !29, isLocal: true, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "backend", scope: !2, file: !110, line: 81, type: !127, isLocal: false, isDefinition: true)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "confget_backend", file: !101, line: 40, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_confget_backend_31", file: !101, line: 40, size: 256, elements: !130)
!130 = !{!131, !132, !136, !137}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !129, file: !101, line: 41, baseType: !29, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "openfile", scope: !129, file: !101, line: 42, baseType: !133, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!27}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "readfile", scope: !129, file: !101, line: 43, baseType: !133, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "closefile", scope: !129, file: !101, line: 44, baseType: !133, size: 64, offset: 192)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "cflag", scope: !2, file: !110, line: 87, type: !27, isLocal: false, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "cfound", scope: !2, file: !110, line: 89, type: !27, isLocal: false, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "Lflag", scope: !2, file: !110, line: 93, type: !27, isLocal: true, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "Sflag", scope: !2, file: !110, line: 95, type: !27, isLocal: true, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "xflag", scope: !2, file: !110, line: 98, type: !27, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "x_matchvalue", scope: !2, file: !110, line: 100, type: !94, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "x_margv", scope: !2, file: !110, line: 100, type: !95, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "x_matchvalue_extra", scope: !2, file: !110, line: 101, type: !97, isLocal: true, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "x_margv_extra", scope: !2, file: !110, line: 101, type: !96, isLocal: true, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "backends", scope: !2, file: !110, line: 69, type: !158, isLocal: true, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 128, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 2)
!161 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!162 = !{i32 2, !"Dwarf Version", i32 4}
!163 = !{i32 2, !"Debug Info Version", i32 3}
!164 = !{i32 1, !"wchar_size", i32 4}
!165 = !{i32 7, !"PIC Level", i32 2}
!166 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!167 = distinct !DISubprogram(name: "foundvar", scope: !110, file: !110, line: 481, type: !168, scopeLine: 483, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!168 = !DISubroutineType(types: !169)
!169 = !{!27, !29, !29, !29}
!170 = !DILocalVariable(name: "sec", arg: 1, scope: !167, file: !110, line: 481, type: !29)
!171 = !DILocation(line: 0, scope: !167)
!172 = !DILocalVariable(name: "name", arg: 2, scope: !167, file: !110, line: 481, type: !29)
!173 = !DILocalVariable(name: "value", arg: 3, scope: !167, file: !110, line: 482, type: !29)
!174 = !DILocalVariable(name: "__cil_tmp14", scope: !167, file: !110, line: 494, type: !40)
!175 = !DILocation(line: 494, column: 9, scope: !167)
!176 = !DILocalVariable(name: "__cil_tmp15", scope: !167, file: !110, line: 495, type: !40)
!177 = !DILocation(line: 495, column: 9, scope: !167)
!178 = !DILocalVariable(name: "__cil_tmp16", scope: !167, file: !110, line: 496, type: !40)
!179 = !DILocation(line: 496, column: 9, scope: !167)
!180 = !DILocalVariable(name: "__cil_tmp17", scope: !167, file: !110, line: 497, type: !40)
!181 = !DILocation(line: 497, column: 9, scope: !167)
!182 = !DILocalVariable(name: "__cil_tmp18", scope: !167, file: !110, line: 498, type: !40)
!183 = !DILocation(line: 498, column: 9, scope: !167)
!184 = !DILocalVariable(name: "__cil_tmp19", scope: !167, file: !110, line: 499, type: !40)
!185 = !DILocation(line: 499, column: 9, scope: !167)
