; ModuleID = '/tmp/tmp.ll'
source_filename = "c/dancer-xml-0.8.2.1.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.dxml_element = type { i8*, i32, %struct.dxml_attribute*, %struct.dxml_element*, %struct.dxml_element* }
%struct.dxml_attribute = type { i8*, i8*, %struct.dxml_attribute* }

@.str = private unnamed_addr constant [7 x i8] c"letter\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"report\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"p\00", align 1
@.str.3 = private unnamed_addr constant [8 x i8] c"jreport\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"a4j\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.5 = private unnamed_addr constant [25 x i8] c"Unknown option -%c used\0A\00", align 1
@.str.6 = private unnamed_addr constant [6 x i8] c"%s%s\0A\00", align 1
@.str.7 = private unnamed_addr constant [29 x i8] c"%%Generated by dxml-db2latex\00", align 1
@.str.8 = private unnamed_addr constant [8 x i8] c"0.8.2.1\00", align 1
@stdin = external global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "counter_chapter", scope: !2, file: !102, line: 33, type: !110, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !99, nameTableKind: GNU)
!3 = !DIFile(filename: "c/dancer-xml-0.8.2.1.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "element_type", file: !6, line: 53, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/home/wslee/benchmarks/textformat/dancer-xml-0.8.2.1/dancer-xml.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "element_type_element", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "element_type_pcdata", value: 1, isUnsigned: true)
!11 = !{!12, !16, !78, !14, !66, !80, !7, !98, !23, !71, !15, !87, !96, !5, !94}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !18, line: 49, baseType: !19)
!18 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !20, line: 271, size: 1728, elements: !21)
!20 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!21 = !{!22, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !43, !44, !45, !46, !50, !52, !54, !58, !61, !65, !67, !68, !69, !70, !73, !74}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !19, file: !20, line: 272, baseType: !23, size: 32)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !19, file: !20, line: 273, baseType: !14, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !19, file: !20, line: 274, baseType: !14, size: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !19, file: !20, line: 275, baseType: !14, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !19, file: !20, line: 276, baseType: !14, size: 64, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !19, file: !20, line: 277, baseType: !14, size: 64, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !19, file: !20, line: 278, baseType: !14, size: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !19, file: !20, line: 279, baseType: !14, size: 64, offset: 448)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !19, file: !20, line: 280, baseType: !14, size: 64, offset: 512)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !19, file: !20, line: 281, baseType: !14, size: 64, offset: 576)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !19, file: !20, line: 282, baseType: !14, size: 64, offset: 640)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !19, file: !20, line: 283, baseType: !14, size: 64, offset: 704)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !19, file: !20, line: 284, baseType: !36, size: 64, offset: 768)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !20, line: 186, size: 192, elements: !38)
!38 = !{!39, !40, !42}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !37, file: !20, line: 187, baseType: !36, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !37, file: !20, line: 188, baseType: !41, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !37, file: !20, line: 189, baseType: !23, size: 32, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !19, file: !20, line: 285, baseType: !41, size: 64, offset: 832)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !19, file: !20, line: 286, baseType: !23, size: 32, offset: 896)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !19, file: !20, line: 287, baseType: !23, size: 32, offset: 928)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !19, file: !20, line: 288, baseType: !47, size: 64, offset: 960)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !48, line: 141, baseType: !49)
!48 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!49 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !19, file: !20, line: 289, baseType: !51, size: 16, offset: 1024)
!51 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !19, file: !20, line: 290, baseType: !53, size: 8, offset: 1040)
!53 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !19, file: !20, line: 291, baseType: !55, size: 8, offset: 1048)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 1)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !19, file: !20, line: 292, baseType: !59, size: 64, offset: 1088)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !20, line: 180, baseType: null)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !19, file: !20, line: 293, baseType: !62, size: 64, offset: 1152)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !48, line: 142, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !48, line: 56, baseType: !64)
!64 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !19, file: !20, line: 294, baseType: !66, size: 64, offset: 1216)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !19, file: !20, line: 295, baseType: !66, size: 64, offset: 1280)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !19, file: !20, line: 296, baseType: !66, size: 64, offset: 1344)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !19, file: !20, line: 297, baseType: !66, size: 64, offset: 1408)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !19, file: !20, line: 298, baseType: !71, size: 32, offset: 1472)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !72, line: 211, baseType: !7)
!72 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !19, file: !20, line: 299, baseType: !23, size: 32, offset: 1504)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !19, file: !20, line: 300, baseType: !75, size: 192, offset: 1536)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 192, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 24)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "dxml_element", file: !6, line: 53, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dxml_element", file: !6, line: 53, size: 320, elements: !83)
!83 = !{!84, !85, !86, !95, !97}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "element_name", scope: !82, file: !6, line: 54, baseType: !14, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "element_type", scope: !82, file: !6, line: 55, baseType: !5, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "element_attribute", scope: !82, file: !6, line: 56, baseType: !87, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "dxml_attribute", file: !6, line: 35, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dxml_attribute", file: !6, line: 35, size: 192, elements: !90)
!90 = !{!91, !92, !93}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "attribute_name", scope: !89, file: !6, line: 36, baseType: !14, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "attribute_data", scope: !89, file: !6, line: 37, baseType: !14, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !89, file: !6, line: 38, baseType: !94, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !82, file: !6, line: 57, baseType: !96, size: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !82, file: !6, line: 58, baseType: !96, size: 64, offset: 256)
!98 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!99 = !{!0, !100, !104, !106, !108}
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "c_chapter", scope: !2, file: !102, line: 34, type: !103, isLocal: false, isDefinition: true)
!102 = !DIFile(filename: "/home/wslee/benchmarks/textformat/dancer-xml-0.8.2.1/db2html.c", directory: "")
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "c_sect1", scope: !2, file: !102, line: 35, type: !103, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "c_sect2", scope: !2, file: !102, line: 36, type: !103, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "c_sect3", scope: !2, file: !102, line: 37, type: !103, isLocal: false, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 160, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 5)
!113 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!114 = !{i32 2, !"Dwarf Version", i32 4}
!115 = !{i32 2, !"Debug Info Version", i32 3}
!116 = !{i32 1, !"wchar_size", i32 4}
!117 = !{i32 7, !"PIC Level", i32 2}
!118 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!119 = distinct !DISubprogram(name: "main", scope: !120, file: !120, line: 407, type: !121, scopeLine: 408, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !124)
!120 = !DIFile(filename: "/home/wslee/benchmarks/textformat/dancer-xml-0.8.2.1/db2latex.c", directory: "")
!121 = !DISubroutineType(types: !122)
!122 = !{!23, !23, !123}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!124 = !{}
!125 = !DILocalVariable(name: "argc", arg: 1, scope: !119, file: !120, line: 407, type: !23)
!126 = !DILocation(line: 0, scope: !119)
!127 = !DILocalVariable(name: "argv", arg: 2, scope: !119, file: !120, line: 407, type: !123)
!128 = !DILocalVariable(name: "__cil_tmp13", scope: !119, file: !120, line: 419, type: !14)
!129 = !DILocation(line: 419, column: 9, scope: !119)
!130 = !DILocalVariable(name: "__cil_tmp14", scope: !119, file: !120, line: 420, type: !14)
!131 = !DILocation(line: 420, column: 9, scope: !119)
!132 = !DILocalVariable(name: "__cil_tmp15", scope: !119, file: !120, line: 421, type: !14)
!133 = !DILocation(line: 421, column: 9, scope: !119)
!134 = !DILocalVariable(name: "__cil_tmp16", scope: !119, file: !120, line: 422, type: !14)
!135 = !DILocation(line: 422, column: 9, scope: !119)
!136 = !DILocalVariable(name: "__cil_tmp17", scope: !119, file: !120, line: 423, type: !14)
!137 = !DILocation(line: 423, column: 9, scope: !119)
!138 = !DILocalVariable(name: "__cil_tmp18", scope: !119, file: !120, line: 424, type: !14)
!139 = !DILocation(line: 424, column: 9, scope: !119)
!140 = !DILocalVariable(name: "__cil_tmp19", scope: !119, file: !120, line: 425, type: !14)
!141 = !DILocation(line: 425, column: 9, scope: !119)
!142 = !DILocalVariable(name: "__cil_tmp20", scope: !119, file: !120, line: 426, type: !14)
!143 = !DILocation(line: 426, column: 9, scope: !119)
!144 = !DILocalVariable(name: "__cil_tmp21", scope: !119, file: !120, line: 427, type: !14)
!145 = !DILocation(line: 427, column: 9, scope: !119)
!146 = !DILocalVariable(name: "__cil_tmp22", scope: !119, file: !120, line: 428, type: !14)
!147 = !DILocation(line: 428, column: 9, scope: !119)
!148 = !DILocalVariable(name: "__cil_tmp23", scope: !119, file: !120, line: 429, type: !14)
!149 = !DILocation(line: 429, column: 9, scope: !119)
!150 = !DILocalVariable(name: "__cil_tmp24", scope: !119, file: !120, line: 430, type: !14)
