; ModuleID = '/tmp/tmp.ll'
source_filename = "c/ecasound2.2-2.7.0.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.sigaction = type { %union.__anonunion___sigaction_handler_40, %struct.__anonstruct___sigset_t_21, i32, void ()* }
%union.__anonunion___sigaction_handler_40 = type { void (i32)* }
%struct.__anonstruct___sigset_t_21 = type { [16 x i64] }
%struct.eci_internal = type { i32, i32, i32, i32, [64 x i8], i32, %struct.eci_parser*, [32 x i8], [65536 x i8] }
%struct.eci_parser = type { i32, i32, double, i64, i32, i32, [4 x i8], %struct.eci_los_list*, %struct.eci_string_s, %struct.eci_string_s, %struct.eci_string_s, i32, i32, i32, i32, i8 }
%struct.eci_los_list = type { %struct.eci_los_list*, %struct.eci_los_list*, %struct.eci_string_s }
%struct.eci_string_s = type { i8*, i32, i32 }
%struct.pollfd = type { i32, i16, i16 }
%struct.stat = type { i64, i16, i64, i32, i32, i32, i32, i64, i16, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "eci_str_no_ecasound_env", scope: !2, file: !76, line: 202, type: !72, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !267, nameTableKind: GNU)
!3 = !DIFile(filename: "c/ecasound2.2-2.7.0.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !7, !8, !72, !74, !132, !133, !136, !220, !221, !64, !223, !225, !88, !123, !226, !228, !229, !15, !17, !66, !231, !103, !94, !18, !56, !232, !244, !266}
!6 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !10, line: 49, baseType: !11)
!10 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !12, line: 271, size: 1728, elements: !13)
!12 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!13 = !{!14, !16, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !37, !38, !39, !40, !44, !46, !48, !52, !55, !59, !60, !61, !62, !63, !67, !68}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !11, file: !12, line: 272, baseType: !15, size: 32)
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !11, file: !12, line: 273, baseType: !17, size: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !11, file: !12, line: 274, baseType: !17, size: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !11, file: !12, line: 275, baseType: !17, size: 64, offset: 192)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !11, file: !12, line: 276, baseType: !17, size: 64, offset: 256)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !11, file: !12, line: 277, baseType: !17, size: 64, offset: 320)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !11, file: !12, line: 278, baseType: !17, size: 64, offset: 384)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !11, file: !12, line: 279, baseType: !17, size: 64, offset: 448)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !11, file: !12, line: 280, baseType: !17, size: 64, offset: 512)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !11, file: !12, line: 281, baseType: !17, size: 64, offset: 576)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !11, file: !12, line: 282, baseType: !17, size: 64, offset: 640)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !11, file: !12, line: 283, baseType: !17, size: 64, offset: 704)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !11, file: !12, line: 284, baseType: !30, size: 64, offset: 768)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !12, line: 186, size: 192, elements: !32)
!32 = !{!33, !34, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !31, file: !12, line: 187, baseType: !30, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !31, file: !12, line: 188, baseType: !35, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !31, file: !12, line: 189, baseType: !15, size: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !11, file: !12, line: 285, baseType: !35, size: 64, offset: 832)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !11, file: !12, line: 286, baseType: !15, size: 32, offset: 896)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !11, file: !12, line: 287, baseType: !15, size: 32, offset: 928)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !11, file: !12, line: 288, baseType: !41, size: 64, offset: 960)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !42, line: 141, baseType: !43)
!42 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!43 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !11, file: !12, line: 289, baseType: !45, size: 16, offset: 1024)
!45 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !11, file: !12, line: 290, baseType: !47, size: 8, offset: 1040)
!47 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !11, file: !12, line: 291, baseType: !49, size: 8, offset: 1048)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 1)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !11, file: !12, line: 292, baseType: !53, size: 64, offset: 1088)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !12, line: 180, baseType: null)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !11, file: !12, line: 293, baseType: !56, size: 64, offset: 1152)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !42, line: 142, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !42, line: 56, baseType: !58)
!58 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !11, file: !12, line: 294, baseType: !7, size: 64, offset: 1216)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !11, file: !12, line: 295, baseType: !7, size: 64, offset: 1280)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !11, file: !12, line: 296, baseType: !7, size: 64, offset: 1344)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !11, file: !12, line: 297, baseType: !7, size: 64, offset: 1408)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !11, file: !12, line: 298, baseType: !64, size: 32, offset: 1472)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !65, line: 211, baseType: !66)
!65 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!66 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !11, file: !12, line: 299, baseType: !15, size: 32, offset: 1504)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !11, file: !12, line: 300, baseType: !69, size: 192, offset: 1536)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 192, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 24)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eci_internal", file: !76, line: 178, size: 525312, elements: !77)
!76 = !DIFile(filename: "/home/wslee/benchmarks/sound/ecasound2.2-2.7.0/libecasoundc/ecasoundc_sa.c", directory: "")
!77 = !{!78, !79, !80, !81, !82, !86, !87, !124, !128}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pid_of_child_rep", scope: !75, file: !76, line: 179, baseType: !15, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "pid_of_parent_rep", scope: !75, file: !76, line: 180, baseType: !15, size: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_read_fd_rep", scope: !75, file: !76, line: 181, baseType: !15, size: 32, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_write_fd_rep", scope: !75, file: !76, line: 182, baseType: !15, size: 32, offset: 96)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "last_command_repp", scope: !75, file: !76, line: 183, baseType: !83, size: 512, offset: 128)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 512, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "commands_counter_rep", scope: !75, file: !76, line: 184, baseType: !15, size: 32, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "parser_repp", scope: !75, file: !76, line: 185, baseType: !88, size: 64, offset: 704)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eci_parser", file: !76, line: 153, size: 960, elements: !90)
!90 = !{!91, !92, !93, !95, !96, !97, !98, !102, !115, !116, !117, !118, !119, !120, !121, !122}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "state_rep", scope: !89, file: !76, line: 154, baseType: !15, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "state_msg_rep", scope: !89, file: !76, line: 155, baseType: !15, size: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "last_f_rep", scope: !89, file: !76, line: 156, baseType: !94, size: 64, offset: 64)
!94 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "last_li_rep", scope: !89, file: !76, line: 157, baseType: !43, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "last_i_rep", scope: !89, file: !76, line: 158, baseType: !15, size: 32, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "last_counter_rep", scope: !89, file: !76, line: 159, baseType: !15, size: 32, offset: 224)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "last_type_repp", scope: !89, file: !76, line: 160, baseType: !99, size: 32, offset: 256)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 32, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 4)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "last_los_repp", scope: !89, file: !76, line: 161, baseType: !103, size: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eci_los_list", file: !76, line: 147, size: 256, elements: !105)
!105 = !{!106, !107, !108}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "prev_repp", scope: !104, file: !76, line: 148, baseType: !103, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next_repp", scope: !104, file: !76, line: 149, baseType: !103, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "data_repp", scope: !104, file: !76, line: 150, baseType: !109, size: 128, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "eci_string", file: !76, line: 145, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eci_string_s", file: !76, line: 140, size: 128, elements: !111)
!111 = !{!112, !113, !114}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !110, file: !76, line: 141, baseType: !17, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "slen", scope: !110, file: !76, line: 142, baseType: !15, size: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !110, file: !76, line: 143, baseType: !15, size: 32, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "last_error_repp", scope: !89, file: !76, line: 162, baseType: !109, size: 128, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "last_s_repp", scope: !89, file: !76, line: 163, baseType: !109, size: 128, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_rep", scope: !89, file: !76, line: 164, baseType: !109, size: 128, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "msgsize_rep", scope: !89, file: !76, line: 165, baseType: !15, size: 32, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "loglevel_rep", scope: !89, file: !76, line: 166, baseType: !15, size: 32, offset: 800)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "token_phase_rep", scope: !89, file: !76, line: 167, baseType: !15, size: 32, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_current_rep", scope: !89, file: !76, line: 168, baseType: !15, size: 32, offset: 864)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sync_lost_rep", scope: !89, file: !76, line: 169, baseType: !123, size: 8, offset: 896)
!123 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "farg_buf_repp", scope: !75, file: !76, line: 186, baseType: !125, size: 256, offset: 768)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 256, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "raw_buffer_repp", scope: !75, file: !76, line: 187, baseType: !129, size: 524288, offset: 1024)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 524288, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 65536)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !15}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !139, line: 25, size: 1216, elements: !140)
!139 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "")
!140 = !{!141, !206, !215, !216}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !138, file: !139, line: 26, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion___sigaction_handler_40", file: !139, line: 25, size: 64, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !142, file: !139, line: 26, baseType: !133, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !142, file: !139, line: 27, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !15, !149, !7}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !151, line: 51, baseType: !152)
!151 = !DIFile(filename: "/usr/include/bits/siginfo.h", directory: "")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "siginfo", file: !151, line: 51, size: 1088, elements: !153)
!153 = !{!154, !155, !156, !157}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !152, file: !151, line: 52, baseType: !15, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !152, file: !151, line: 53, baseType: !15, size: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !152, file: !151, line: 54, baseType: !15, size: 32, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !152, file: !151, line: 55, baseType: !158, size: 960, offset: 128)
!158 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion__sifields_22", file: !151, line: 51, size: 960, elements: !159)
!159 = !{!160, !164, !171, !182, !188, !197, !201}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !158, file: !151, line: 52, baseType: !161, size: 928)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 928, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 29)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !158, file: !151, line: 53, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct__kill_23", file: !151, line: 51, size: 64, elements: !166)
!166 = !{!167, !169}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !165, file: !151, line: 52, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !42, line: 143, baseType: !15)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !165, file: !151, line: 53, baseType: !170, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !42, line: 135, baseType: !66)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !158, file: !151, line: 54, baseType: !172, size: 128)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct__timer_24", file: !151, line: 51, size: 128, elements: !173)
!173 = !{!174, !175, !176}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !172, file: !151, line: 52, baseType: !15, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !172, file: !151, line: 53, baseType: !15, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !172, file: !151, line: 54, baseType: !177, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !151, line: 33, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !151, line: 33, size: 64, elements: !179)
!179 = !{!180, !181}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !178, file: !151, line: 34, baseType: !15, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !178, file: !151, line: 35, baseType: !7, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !158, file: !151, line: 55, baseType: !183, size: 128)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct__rt_25", file: !151, line: 51, size: 128, elements: !184)
!184 = !{!185, !186, !187}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !183, file: !151, line: 52, baseType: !168, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !183, file: !151, line: 53, baseType: !170, size: 32, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !183, file: !151, line: 54, baseType: !177, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !158, file: !151, line: 56, baseType: !189, size: 256)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct__sigchld_26", file: !151, line: 51, size: 256, elements: !190)
!190 = !{!191, !192, !193, !194, !196}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !189, file: !151, line: 52, baseType: !168, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !189, file: !151, line: 53, baseType: !170, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !189, file: !151, line: 54, baseType: !15, size: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !189, file: !151, line: 55, baseType: !195, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !42, line: 145, baseType: !43)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !189, file: !151, line: 56, baseType: !195, size: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !158, file: !151, line: 57, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct__sigfault_27", file: !151, line: 51, size: 64, elements: !199)
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !198, file: !151, line: 52, baseType: !7, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !158, file: !151, line: 58, baseType: !202, size: 128)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct__sigpoll_28", file: !151, line: 51, size: 128, elements: !203)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !202, file: !151, line: 52, baseType: !43, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !202, file: !151, line: 53, baseType: !15, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !138, file: !139, line: 27, baseType: !207, size: 1024, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !208, line: 29, baseType: !209)
!208 = !DIFile(filename: "/usr/include/bits/sigset.h", directory: "")
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct___sigset_t_21", file: !208, line: 29, size: 1024, elements: !210)
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !209, file: !208, line: 30, baseType: !212, size: 1024)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 1024, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 16)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !138, file: !139, line: 28, baseType: !15, size: 32, offset: 1088)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !138, file: !139, line: 29, baseType: !217, size: 64, offset: 1152)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "eci_handle_t", file: !227, line: 33, baseType: !7)
!227 = !DIFile(filename: "/home/wslee/benchmarks/sound/ecasound2.2-2.7.0/libecasoundc/ecasoundc.h", directory: "")
!228 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfds_t", file: !230, line: 37, baseType: !6)
!230 = !DIFile(filename: "/usr/include/sys/poll.h", directory: "")
!231 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !234, line: 43, size: 1088, elements: !235)
!234 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!235 = !{!236, !240, !241, !243, !245, !247, !248, !250, !251, !252, !253, !255, !257, !259, !260, !261, !262, !263, !264}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !233, file: !234, line: 44, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !42, line: 134, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_quad_t", file: !42, line: 57, baseType: !239)
!239 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !233, file: !234, line: 45, baseType: !45, size: 16, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino", scope: !233, file: !234, line: 46, baseType: !242, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !42, line: 137, baseType: !6)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !233, file: !234, line: 47, baseType: !244, size: 32, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !42, line: 139, baseType: !66)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !233, file: !234, line: 48, baseType: !246, size: 32, offset: 224)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !42, line: 140, baseType: !66)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !233, file: !234, line: 49, baseType: !170, size: 32, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !233, file: !234, line: 50, baseType: !249, size: 32, offset: 288)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !42, line: 136, baseType: !66)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !233, file: !234, line: 51, baseType: !237, size: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !233, file: !234, line: 52, baseType: !45, size: 16, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !233, file: !234, line: 53, baseType: !56, size: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !233, file: !234, line: 54, baseType: !254, size: 64, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !42, line: 164, baseType: !43)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !233, file: !234, line: 55, baseType: !256, size: 64, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !42, line: 170, baseType: !57)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "st_atime", scope: !233, file: !234, line: 56, baseType: !258, size: 64, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !42, line: 149, baseType: !43)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimensec", scope: !233, file: !234, line: 57, baseType: !6, size: 64, offset: 704)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtime", scope: !233, file: !234, line: 58, baseType: !258, size: 64, offset: 768)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimensec", scope: !233, file: !234, line: 59, baseType: !6, size: 64, offset: 832)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctime", scope: !233, file: !234, line: 60, baseType: !258, size: 64, offset: 896)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimensec", scope: !233, file: !234, line: 61, baseType: !6, size: 64, offset: 960)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !233, file: !234, line: 62, baseType: !265, size: 64, offset: 1024)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !42, line: 138, baseType: !238)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!267 = !{!0, !268, !270, !272, !274, !277, !279, !281, !286, !288, !290, !292, !294, !299}
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "eci_str_null_handle", scope: !2, file: !76, line: 212, type: !72, isLocal: false, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "eci_str_sync_lost", scope: !2, file: !76, line: 223, type: !72, isLocal: false, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "static_eci_rep", scope: !2, file: !76, line: 197, type: !226, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "ecaplay_output", scope: !2, file: !276, line: 92, type: !72, isLocal: true, isDefinition: true)
!276 = !DIFile(filename: "/home/wslee/benchmarks/sound/ecasound2.2-2.7.0/ecatools/ecaplay.c", directory: "")
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "ecaplay_mode", scope: !2, file: !276, line: 95, type: !15, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "ecaplay_skip", scope: !2, file: !276, line: 94, type: !15, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "ecaplay_next", scope: !2, file: !276, line: 90, type: !283, isLocal: true, isDefinition: true)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 32768, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 4096)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "ecaplay_initialized", scope: !2, file: !276, line: 97, type: !15, isLocal: true, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "ecaplay_debuglevel", scope: !2, file: !276, line: 93, type: !15, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "ecaplay_audio_format", scope: !2, file: !276, line: 91, type: !83, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "once", scope: !2, file: !276, line: 209, type: !15, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "ecaplay_skip_flag", scope: !2, file: !276, line: 98, type: !296, isLocal: true, isDefinition: true)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !297, line: 41, baseType: !298)
!297 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !208, line: 24, baseType: !15)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "ecaplay_version", scope: !2, file: !276, line: 89, type: !72, isLocal: true, isDefinition: true)
!301 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!302 = !{i32 2, !"Dwarf Version", i32 4}
!303 = !{i32 2, !"Debug Info Version", i32 3}
!304 = !{i32 1, !"wchar_size", i32 4}
!305 = !{i32 7, !"PIC Level", i32 2}
!306 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!307 = distinct !DISubprogram(name: "eci_init", scope: !76, file: !76, line: 262, type: !218, scopeLine: 263, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!308 = !DILocalVariable(name: "__cil_tmp1", scope: !307, file: !76, line: 264, type: !17)
!309 = !DILocation(line: 264, column: 9, scope: !307)
!310 = !DILocalVariable(name: "__cil_tmp2", scope: !307, file: !76, line: 265, type: !17)
!311 = !DILocation(line: 265, column: 9, scope: !307)
!312 = !DILocalVariable(name: "__cil_tmp3", scope: !307, file: !76, line: 266, type: !17)
!313 = !DILocation(line: 266, column: 9, scope: !307)
!314 = !DILocation(line: 264, column: 26, scope: !315)
!315 = distinct !DILexicalBlock(scope: !316, file: !76, line: 264, column: 7)
!316 = distinct !DILexicalBlock(scope: !307, file: !76, line: 268, column: 3)
!317 = !DILocation(line: 264, column: 10, scope: !315)
!318 = !DILocation(line: 264, column: 41, scope: !315)
!319 = !DILocation(line: 264, column: 7, scope: !316)
!320 = !DILocation(line: 264, column: 38, scope: !321)
!321 = distinct !DILexicalBlock(scope: !322, file: !76, line: 266, column: 5)
!322 = distinct !DILexicalBlock(scope: !323, file: !76, line: 265, column: 5)
!323 = distinct !DILexicalBlock(scope: !315, file: !76, line: 264, column: 74)
!324 = !DILocation(line: 264, column: 5, scope: !321)
!325 = !DILocation(line: 269, column: 3, scope: !323)
!326 = !DILocation(line: 265, column: 20, scope: !327)
!327 = distinct !DILexicalBlock(scope: !328, file: !76, line: 271, column: 3)
!328 = distinct !DILexicalBlock(scope: !316, file: !76, line: 270, column: 3)
!329 = !DILocation(line: 265, column: 18, scope: !327)
!330 = !DILocation(line: 266, column: 3, scope: !316)
!331 = distinct !DISubprogram(name: "eci_init_r", scope: !76, file: !76, line: 274, type: !332, scopeLine: 275, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!332 = !DISubroutineType(types: !333)
!333 = !{!226}
!334 = !DILocalVariable(name: "cmd_send_pipe", scope: !331, file: !76, line: 277, type: !335)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 2)
!338 = !DILocation(line: 277, column: 7, scope: !331)
!339 = !DILocalVariable(name: "cmd_receive_pipe", scope: !331, file: !76, line: 278, type: !335)
!340 = !DILocation(line: 278, column: 7, scope: !331)
!341 = !DILocalVariable(name: "args", scope: !331, file: !76, line: 283, type: !342)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 256, elements: !100)
!343 = !DILocation(line: 283, column: 17, scope: !331)
!344 = !DILocalVariable(name: "sa", scope: !331, file: !76, line: 285, type: !138)
!345 = !DILocation(line: 285, column: 20, scope: !331)
!346 = !DILocalVariable(name: "pid", scope: !331, file: !76, line: 286, type: !347)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !348, line: 100, baseType: !168)
!348 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!349 = !DILocation(line: 286, column: 9, scope: !331)
!350 = !DILocalVariable(name: "buf", scope: !331, file: !76, line: 289, type: !49)
!351 = !DILocation(line: 289, column: 8, scope: !331)
!352 = !DILocalVariable(name: "status", scope: !331, file: !76, line: 290, type: !15)
!353 = !DILocation(line: 290, column: 7, scope: !331)
!354 = !DILocalVariable(name: "pid___0", scope: !331, file: !76, line: 291, type: !15)
!355 = !DILocation(line: 291, column: 7, scope: !331)
!356 = !DILocalVariable(name: "ign_handler", scope: !331, file: !76, line: 292, type: !138)
!357 = !DILocation(line: 292, column: 20, scope: !331)
!358 = !DILocalVariable(name: "__cil_tmp25", scope: !331, file: !76, line: 300, type: !7)
!359 = !DILocation(line: 300, column: 9, scope: !331)
!360 = !DILocalVariable(name: "__cil_tmp26", scope: !331, file: !76, line: 301, type: !7)
!361 = !DILocation(line: 301, column: 9, scope: !331)
!362 = !DILocalVariable(name: "__cil_tmp27", scope: !331, file: !76, line: 302, type: !7)
!363 = !DILocation(line: 302, column: 9, scope: !331)
!364 = !DILocalVariable(name: "__cil_tmp28", scope: !331, file: !76, line: 303, type: !7)
!365 = !DILocation(line: 303, column: 9, scope: !331)
!366 = !DILocalVariable(name: "__cil_tmp29", scope: !331, file: !76, line: 304, type: !17)
!367 = !DILocation(line: 304, column: 9, scope: !331)
!368 = !DILocalVariable(name: "__cil_tmp30", scope: !331, file: !76, line: 305, type: !17)
!369 = !DILocation(line: 305, column: 9, scope: !331)
!370 = !DILocalVariable(name: "__cil_tmp31", scope: !331, file: !76, line: 306, type: !17)
!371 = !DILocation(line: 306, column: 9, scope: !331)
!372 = !DILocalVariable(name: "__cil_tmp32", scope: !331, file: !76, line: 307, type: !17)
!373 = !DILocation(line: 307, column: 9, scope: !331)
!374 = !DILocalVariable(name: "__cil_tmp33", scope: !331, file: !76, line: 308, type: !17)
!375 = !DILocation(line: 308, column: 9, scope: !331)
!376 = !DILocalVariable(name: "__cil_tmp34", scope: !331, file: !76, line: 309, type: !17)
!377 = !DILocation(line: 309, column: 9, scope: !331)
!378 = !DILocalVariable(name: "__cil_tmp35", scope: !331, file: !76, line: 310, type: !17)
!379 = !DILocation(line: 310, column: 9, scope: !331)
!380 = !DILocalVariable(name: "__cil_tmp36", scope: !331, file: !76, line: 311, type: !17)
!381 = !DILocation(line: 311, column: 9, scope: !331)
!382 = !DILocalVariable(name: "__cil_tmp37", scope: !331, file: !76, line: 312, type: !17)
!383 = !DILocation(line: 312, column: 9, scope: !331)
!384 = !DILocalVariable(name: "__cil_tmp38", scope: !331, file: !76, line: 313, type: !17)
!385 = !DILocation(line: 313, column: 9, scope: !331)
!386 = !DILocalVariable(name: "__cil_tmp39", scope: !331, file: !76, line: 314, type: !17)
!387 = !DILocation(line: 314, column: 9, scope: !331)
!388 = !DILocalVariable(name: "eci_rep", scope: !331, file: !76, line: 276, type: !74)
!389 = !DILocation(line: 0, scope: !331)
!390 = !DILocation(line: 278, column: 9, scope: !391)
!391 = distinct !DILexicalBlock(scope: !392, file: !76, line: 277, column: 3)
!392 = distinct !DILexicalBlock(scope: !393, file: !76, line: 317, column: 3)
!393 = distinct !DILexicalBlock(scope: !331, file: !76, line: 316, column: 3)
!394 = !DILocalVariable(name: "tmp", scope: !331, file: !76, line: 280, type: !72)
!395 = !DILocalVariable(name: "ecasound_exec", scope: !331, file: !76, line: 279, type: !72)
!396 = !DILocation(line: 281, column: 7, scope: !397)
!397 = distinct !DILexicalBlock(scope: !393, file: !76, line: 281, column: 7)
!398 = !DILocation(line: 281, column: 37, scope: !397)
!399 = !DILocation(line: 281, column: 7, scope: !393)
!400 = !DILocation(line: 281, column: 27, scope: !401)
!401 = distinct !DILexicalBlock(scope: !402, file: !76, line: 283, column: 5)
!402 = distinct !DILexicalBlock(scope: !403, file: !76, line: 282, column: 5)
!403 = distinct !DILexicalBlock(scope: !397, file: !76, line: 281, column: 69)
!404 = !DILocation(line: 281, column: 15, scope: !401)
!405 = !DILocalVariable(name: "tmp___7", scope: !331, file: !76, line: 298, type: !15)
!406 = !DILocation(line: 281, column: 17, scope: !407)
!407 = distinct !DILexicalBlock(scope: !403, file: !76, line: 281, column: 9)
!408 = !DILocation(line: 281, column: 9, scope: !403)
!409 = !DILocation(line: 281, column: 29, scope: !410)
!410 = distinct !DILexicalBlock(scope: !411, file: !76, line: 283, column: 7)
!411 = distinct !DILexicalBlock(scope: !412, file: !76, line: 282, column: 7)
!412 = distinct !DILexicalBlock(scope: !407, file: !76, line: 281, column: 23)
!413 = !DILocation(line: 281, column: 17, scope: !410)
!414 = !DILocalVariable(name: "tmp___8", scope: !331, file: !76, line: 299, type: !15)
!415 = !DILocation(line: 281, column: 19, scope: !416)
!416 = distinct !DILexicalBlock(scope: !412, file: !76, line: 281, column: 11)
!417 = !DILocation(line: 281, column: 11, scope: !412)
!418 = !DILocation(line: 283, column: 19, scope: !419)
!419 = distinct !DILexicalBlock(scope: !420, file: !76, line: 283, column: 9)
!420 = distinct !DILexicalBlock(scope: !421, file: !76, line: 282, column: 9)
!421 = distinct !DILexicalBlock(scope: !416, file: !76, line: 281, column: 25)
!422 = !DILocalVariable(name: "tmp___0", scope: !331, file: !76, line: 282, type: !168)
!423 = !DILocalVariable(name: "fork_pid", scope: !331, file: !76, line: 281, type: !15)
!424 = !DILocation(line: 285, column: 22, scope: !425)
!425 = distinct !DILexicalBlock(scope: !421, file: !76, line: 285, column: 13)
!426 = !DILocation(line: 285, column: 13, scope: !421)
!427 = !DILocation(line: 289, column: 11, scope: !428)
!428 = distinct !DILexicalBlock(scope: !429, file: !76, line: 286, column: 11)
!429 = distinct !DILexicalBlock(scope: !425, file: !76, line: 285, column: 28)
!430 = !DILocation(line: 289, column: 19, scope: !428)
!431 = !DILocalVariable(name: "res", scope: !331, file: !76, line: 284, type: !15)
!432 = !DILocation(line: 294, column: 14, scope: !428)
!433 = !DILocation(line: 294, column: 34, scope: !428)
!434 = !DILocation(line: 294, column: 45, scope: !428)
!435 = !DILocation(line: 295, column: 28, scope: !436)
!436 = distinct !DILexicalBlock(scope: !428, file: !76, line: 295, column: 11)
!437 = !DILocation(line: 295, column: 11, scope: !436)
!438 = !DILocation(line: 296, column: 14, scope: !428)
!439 = !DILocation(line: 296, column: 23, scope: !428)
!440 = !DILocation(line: 297, column: 11, scope: !441)
!441 = distinct !DILexicalBlock(scope: !428, file: !76, line: 297, column: 11)
!442 = !DILocation(line: 298, column: 11, scope: !443)
!443 = distinct !DILexicalBlock(scope: !428, file: !76, line: 299, column: 11)
!444 = !DILocation(line: 301, column: 21, scope: !445)
!445 = distinct !DILexicalBlock(scope: !428, file: !76, line: 300, column: 11)
!446 = !DILocalVariable(name: "tmp___1", scope: !331, file: !76, line: 287, type: !168)
!447 = !DILocation(line: 301, column: 23, scope: !448)
!448 = distinct !DILexicalBlock(scope: !429, file: !76, line: 301, column: 15)
!449 = !DILocation(line: 301, column: 15, scope: !429)
!450 = !DILocation(line: 302, column: 13, scope: !451)
!451 = distinct !DILexicalBlock(scope: !452, file: !76, line: 303, column: 13)
!452 = distinct !DILexicalBlock(scope: !453, file: !76, line: 302, column: 13)
!453 = distinct !DILexicalBlock(scope: !448, file: !76, line: 301, column: 29)
!454 = !DILocation(line: 306, column: 11, scope: !455)
!455 = distinct !DILexicalBlock(scope: !429, file: !76, line: 306, column: 11)
!456 = !DILocation(line: 306, column: 19, scope: !455)
!457 = !DILocation(line: 310, column: 11, scope: !458)
!458 = distinct !DILexicalBlock(scope: !455, file: !76, line: 307, column: 11)
!459 = !DILocation(line: 311, column: 11, scope: !460)
!460 = distinct !DILexicalBlock(scope: !455, file: !76, line: 312, column: 11)
!461 = !DILocation(line: 313, column: 16, scope: !462)
!462 = distinct !DILexicalBlock(scope: !455, file: !76, line: 313, column: 11)
!463 = !DILocation(line: 313, column: 11, scope: !462)
!464 = !DILocation(line: 314, column: 16, scope: !465)
!465 = distinct !DILexicalBlock(scope: !455, file: !76, line: 315, column: 11)
!466 = !DILocation(line: 314, column: 11, scope: !465)
!467 = !DILocation(line: 316, column: 17, scope: !468)
!468 = distinct !DILexicalBlock(scope: !455, file: !76, line: 316, column: 11)
!469 = !DILocation(line: 316, column: 11, scope: !468)
!470 = !DILocation(line: 317, column: 17, scope: !471)
!471 = distinct !DILexicalBlock(scope: !455, file: !76, line: 318, column: 11)
!472 = !DILocation(line: 317, column: 11, scope: !471)
!473 = !DILocation(line: 318, column: 17, scope: !474)
!474 = distinct !DILexicalBlock(scope: !455, file: !76, line: 319, column: 11)
!475 = !DILocation(line: 318, column: 11, scope: !474)
!476 = !DILocation(line: 319, column: 17, scope: !477)
!477 = distinct !DILexicalBlock(scope: !455, file: !76, line: 320, column: 11)
!478 = !DILocation(line: 319, column: 11, scope: !477)
!479 = !DILocation(line: 322, column: 44, scope: !480)
!480 = distinct !DILexicalBlock(scope: !455, file: !76, line: 321, column: 11)
!481 = !DILocation(line: 321, column: 11, scope: !480)
!482 = !DILocation(line: 324, column: 17, scope: !483)
!483 = distinct !DILexicalBlock(scope: !455, file: !76, line: 324, column: 11)
!484 = !DILocation(line: 324, column: 15, scope: !483)
!485 = !DILocation(line: 325, column: 20, scope: !486)
!486 = distinct !DILexicalBlock(scope: !455, file: !76, line: 326, column: 11)
!487 = !DILocation(line: 325, column: 11, scope: !486)
!488 = !DILocation(line: 328, column: 42, scope: !489)
!489 = distinct !DILexicalBlock(scope: !455, file: !76, line: 327, column: 11)
!490 = !DILocation(line: 328, column: 26, scope: !489)
!491 = !DILocation(line: 328, column: 17, scope: !489)
!492 = !DILocation(line: 330, column: 24, scope: !493)
!493 = distinct !DILexicalBlock(scope: !455, file: !76, line: 330, column: 11)
!494 = !DILocation(line: 330, column: 60, scope: !493)
!495 = !DILocation(line: 330, column: 17, scope: !493)
!496 = !DILocation(line: 331, column: 19, scope: !497)
!497 = distinct !DILexicalBlock(scope: !429, file: !76, line: 331, column: 15)
!498 = !DILocation(line: 331, column: 15, scope: !429)
!499 = !DILocation(line: 331, column: 13, scope: !500)
!500 = distinct !DILexicalBlock(scope: !501, file: !76, line: 333, column: 13)
!501 = distinct !DILexicalBlock(scope: !502, file: !76, line: 332, column: 13)
!502 = distinct !DILexicalBlock(scope: !497, file: !76, line: 331, column: 24)
!503 = !DILocation(line: 334, column: 11, scope: !502)
!504 = !DILocation(line: 333, column: 11, scope: !505)
!505 = distinct !DILexicalBlock(scope: !506, file: !76, line: 336, column: 11)
!506 = distinct !DILexicalBlock(scope: !429, file: !76, line: 335, column: 11)
!507 = !DILocation(line: 334, column: 11, scope: !508)
!508 = distinct !DILexicalBlock(scope: !506, file: !76, line: 335, column: 11)
!509 = !DILocation(line: 336, column: 11, scope: !510)
!510 = distinct !DILexicalBlock(scope: !506, file: !76, line: 336, column: 11)
!511 = !DILocation(line: 348, column: 23, scope: !512)
!512 = distinct !DILexicalBlock(scope: !513, file: !76, line: 340, column: 11)
!513 = distinct !DILexicalBlock(scope: !425, file: !76, line: 339, column: 16)
!514 = !DILocation(line: 348, column: 43, scope: !512)
!515 = !DILocation(line: 348, column: 54, scope: !512)
!516 = !DILocation(line: 349, column: 37, scope: !517)
!517 = distinct !DILexicalBlock(scope: !512, file: !76, line: 349, column: 11)
!518 = !DILocation(line: 349, column: 11, scope: !517)
!519 = !DILocation(line: 350, column: 23, scope: !512)
!520 = !DILocation(line: 350, column: 32, scope: !512)
!521 = !DILocation(line: 352, column: 11, scope: !522)
!522 = distinct !DILexicalBlock(scope: !512, file: !76, line: 351, column: 11)
!523 = !DILocation(line: 353, column: 11, scope: !524)
!524 = distinct !DILexicalBlock(scope: !512, file: !76, line: 355, column: 11)
!525 = !DILocation(line: 355, column: 21, scope: !526)
!526 = distinct !DILexicalBlock(scope: !512, file: !76, line: 356, column: 11)
!527 = !DILocalVariable(name: "tmp___2", scope: !331, file: !76, line: 293, type: !7)
!528 = !DILocation(line: 355, column: 21, scope: !512)
!529 = !DILocation(line: 356, column: 21, scope: !530)
!530 = distinct !DILexicalBlock(scope: !512, file: !76, line: 356, column: 11)
!531 = !DILocalVariable(name: "tmp___3", scope: !331, file: !76, line: 294, type: !7)
!532 = !DILocation(line: 356, column: 34, scope: !512)
!533 = !DILocation(line: 356, column: 20, scope: !512)
!534 = !DILocation(line: 356, column: 32, scope: !512)
!535 = !DILocation(line: 359, column: 20, scope: !512)
!536 = !DILocation(line: 359, column: 37, scope: !512)
!537 = !DILocation(line: 360, column: 20, scope: !512)
!538 = !DILocation(line: 360, column: 41, scope: !512)
!539 = !DILocation(line: 361, column: 21, scope: !512)
!540 = !DILocation(line: 361, column: 35, scope: !512)
!541 = !DILocation(line: 361, column: 52, scope: !512)
!542 = !DILocation(line: 362, column: 21, scope: !512)
!543 = !DILocation(line: 362, column: 35, scope: !512)
!544 = !DILocation(line: 362, column: 51, scope: !512)
!545 = !DILocation(line: 363, column: 21, scope: !512)
!546 = !DILocation(line: 363, column: 35, scope: !512)
!547 = !DILocation(line: 363, column: 54, scope: !512)
!548 = !DILocation(line: 364, column: 21, scope: !512)
!549 = !DILocation(line: 364, column: 35, scope: !512)
!550 = !DILocation(line: 364, column: 49, scope: !512)
!551 = !DILocation(line: 365, column: 47, scope: !552)
!552 = distinct !DILexicalBlock(scope: !512, file: !76, line: 365, column: 11)
!553 = !DILocation(line: 365, column: 11, scope: !552)
!554 = !DILocation(line: 371, column: 28, scope: !555)
!555 = distinct !DILexicalBlock(scope: !512, file: !76, line: 367, column: 11)
!556 = !DILocation(line: 371, column: 11, scope: !555)
!557 = !DILocation(line: 372, column: 26, scope: !558)
!558 = distinct !DILexicalBlock(scope: !512, file: !76, line: 373, column: 11)
!559 = !DILocation(line: 372, column: 47, scope: !558)
!560 = !DILocation(line: 372, column: 21, scope: !558)
!561 = !DILocalVariable(name: "res___0", scope: !331, file: !76, line: 288, type: !15)
!562 = !DILocation(line: 373, column: 15, scope: !563)
!563 = distinct !DILexicalBlock(scope: !513, file: !76, line: 373, column: 15)
!564 = !DILocation(line: 373, column: 39, scope: !563)
!565 = !DILocation(line: 373, column: 15, scope: !513)
!566 = !DILocation(line: 375, column: 13, scope: !567)
!567 = distinct !DILexicalBlock(scope: !568, file: !76, line: 375, column: 13)
!568 = distinct !DILexicalBlock(scope: !569, file: !76, line: 374, column: 13)
!569 = distinct !DILexicalBlock(scope: !563, file: !76, line: 373, column: 59)
!570 = !DILocation(line: 376, column: 18, scope: !571)
!571 = distinct !DILexicalBlock(scope: !568, file: !76, line: 377, column: 13)
!572 = !DILocation(line: 376, column: 13, scope: !571)
!573 = !DILocation(line: 379, column: 11, scope: !569)
!574 = !DILocation(line: 0, scope: !513)
!575 = !DILocation(line: 379, column: 39, scope: !576)
!576 = distinct !DILexicalBlock(scope: !513, file: !76, line: 380, column: 11)
!577 = !DILocation(line: 379, column: 20, scope: !576)
!578 = !DILocation(line: 379, column: 37, scope: !576)
!579 = !DILocation(line: 380, column: 40, scope: !580)
!580 = distinct !DILexicalBlock(scope: !576, file: !76, line: 380, column: 11)
!581 = !DILocation(line: 380, column: 20, scope: !580)
!582 = !DILocation(line: 380, column: 38, scope: !580)
!583 = !DILocation(line: 382, column: 38, scope: !576)
!584 = !DILocation(line: 382, column: 20, scope: !576)
!585 = !DILocation(line: 382, column: 36, scope: !576)
!586 = !DILocation(line: 383, column: 17, scope: !587)
!587 = distinct !DILexicalBlock(scope: !576, file: !76, line: 383, column: 11)
!588 = !DILocation(line: 383, column: 11, scope: !587)
!589 = !DILocation(line: 384, column: 39, scope: !576)
!590 = !DILocation(line: 384, column: 20, scope: !576)
!591 = !DILocation(line: 384, column: 37, scope: !576)
!592 = !DILocation(line: 385, column: 17, scope: !593)
!593 = distinct !DILexicalBlock(scope: !576, file: !76, line: 385, column: 11)
!594 = !DILocation(line: 385, column: 11, scope: !593)
!595 = !DILocation(line: 388, column: 26, scope: !596)
!596 = distinct !DILexicalBlock(scope: !576, file: !76, line: 387, column: 11)
!597 = !DILocation(line: 388, column: 11, scope: !596)
!598 = !DILocation(line: 389, column: 26, scope: !599)
!599 = distinct !DILexicalBlock(scope: !576, file: !76, line: 390, column: 11)
!600 = !DILocation(line: 389, column: 11, scope: !599)
!601 = !DILocation(line: 392, column: 47, scope: !602)
!602 = distinct !DILexicalBlock(scope: !576, file: !76, line: 391, column: 11)
!603 = !DILocation(line: 392, column: 72, scope: !602)
!604 = !DILocation(line: 392, column: 21, scope: !602)
!605 = !DILocation(line: 393, column: 23, scope: !606)
!606 = distinct !DILexicalBlock(scope: !513, file: !76, line: 393, column: 15)
!607 = !DILocation(line: 393, column: 15, scope: !513)
!608 = !DILocation(line: 395, column: 13, scope: !609)
!609 = distinct !DILexicalBlock(scope: !610, file: !76, line: 395, column: 13)
!610 = distinct !DILexicalBlock(scope: !611, file: !76, line: 394, column: 13)
!611 = distinct !DILexicalBlock(scope: !606, file: !76, line: 393, column: 29)
!612 = !DILocation(line: 396, column: 18, scope: !613)
!613 = distinct !DILexicalBlock(scope: !610, file: !76, line: 397, column: 13)
!614 = !DILocation(line: 396, column: 13, scope: !613)
!615 = !DILocation(line: 399, column: 11, scope: !611)
!616 = !DILocation(line: 400, column: 23, scope: !617)
!617 = distinct !DILexicalBlock(scope: !618, file: !76, line: 401, column: 13)
!618 = distinct !DILexicalBlock(scope: !619, file: !76, line: 400, column: 13)
!619 = distinct !DILexicalBlock(scope: !606, file: !76, line: 399, column: 18)
!620 = !DILocalVariable(name: "tmp___4", scope: !331, file: !76, line: 295, type: !64)
!621 = !DILocation(line: 400, column: 28, scope: !622)
!622 = distinct !DILexicalBlock(scope: !618, file: !76, line: 402, column: 13)
!623 = !DILocation(line: 400, column: 13, scope: !622)
!624 = !DILocation(line: 401, column: 23, scope: !625)
!625 = distinct !DILexicalBlock(scope: !618, file: !76, line: 402, column: 13)
!626 = !DILocalVariable(name: "tmp___5", scope: !331, file: !76, line: 296, type: !64)
!627 = !DILocation(line: 401, column: 28, scope: !628)
!628 = distinct !DILexicalBlock(scope: !618, file: !76, line: 403, column: 13)
!629 = !DILocation(line: 401, column: 13, scope: !628)
!630 = !DILocation(line: 402, column: 23, scope: !631)
!631 = distinct !DILexicalBlock(scope: !618, file: !76, line: 404, column: 13)
!632 = !DILocalVariable(name: "tmp___6", scope: !331, file: !76, line: 297, type: !64)
!633 = !DILocation(line: 402, column: 28, scope: !634)
!634 = distinct !DILexicalBlock(scope: !618, file: !76, line: 404, column: 13)
!635 = !DILocation(line: 402, column: 13, scope: !634)
!636 = !DILocation(line: 403, column: 23, scope: !618)
!637 = !DILocation(line: 403, column: 45, scope: !618)
!638 = !DILocation(line: 406, column: 13, scope: !639)
!639 = distinct !DILexicalBlock(scope: !618, file: !76, line: 404, column: 13)
!640 = !DILocation(line: 407, column: 26, scope: !641)
!641 = distinct !DILexicalBlock(scope: !619, file: !76, line: 407, column: 17)
!642 = !DILocation(line: 407, column: 60, scope: !641)
!643 = !DILocation(line: 407, column: 74, scope: !641)
!644 = !DILocation(line: 407, column: 47, scope: !641)
!645 = !DILocation(line: 407, column: 17, scope: !619)
!646 = !DILocation(line: 409, column: 15, scope: !647)
!647 = distinct !DILexicalBlock(scope: !648, file: !76, line: 409, column: 15)
!648 = distinct !DILexicalBlock(scope: !649, file: !76, line: 408, column: 15)
!649 = distinct !DILexicalBlock(scope: !641, file: !76, line: 407, column: 92)
!650 = !DILocation(line: 410, column: 20, scope: !651)
!651 = distinct !DILexicalBlock(scope: !648, file: !76, line: 411, column: 15)
!652 = !DILocation(line: 410, column: 15, scope: !651)
!653 = !DILocation(line: 413, column: 13, scope: !649)
!654 = !DILocation(line: 0, scope: !606)
!655 = !DILocation(line: 416, column: 7, scope: !421)
!656 = !DILocation(line: 0, scope: !393)
!657 = !DILocation(line: 417, column: 5, scope: !412)
!658 = !DILocation(line: 418, column: 3, scope: !403)
!659 = !DILocation(line: 417, column: 11, scope: !393)
!660 = !DILocation(line: 417, column: 3, scope: !393)
!661 = distinct !DISubprogram(name: "eci_impl_get_ecasound_path", scope: !76, file: !76, line: 946, type: !662, scopeLine: 947, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!662 = !DISubroutineType(types: !663)
!663 = !{!72}
!664 = !DILocalVariable(name: "__cil_tmp3", scope: !661, file: !76, line: 950, type: !17)
!665 = !DILocation(line: 950, column: 9, scope: !661)
!666 = !DILocalVariable(name: "__cil_tmp4", scope: !661, file: !76, line: 951, type: !17)
!667 = !DILocation(line: 951, column: 9, scope: !661)
!668 = !DILocalVariable(name: "__cil_tmp5", scope: !661, file: !76, line: 952, type: !17)
!669 = !DILocation(line: 952, column: 9, scope: !661)
!670 = !DILocation(line: 948, column: 9, scope: !671)
!671 = distinct !DILexicalBlock(scope: !672, file: !76, line: 956, column: 3)
!672 = distinct !DILexicalBlock(scope: !673, file: !76, line: 955, column: 3)
!673 = distinct !DILexicalBlock(scope: !661, file: !76, line: 954, column: 3)
!674 = !DILocalVariable(name: "tmp", scope: !661, file: !76, line: 949, type: !17)
!675 = !DILocation(line: 0, scope: !661)
!676 = !DILocalVariable(name: "result", scope: !661, file: !76, line: 948, type: !72)
!677 = !DILocation(line: 950, column: 7, scope: !678)
!678 = distinct !DILexicalBlock(scope: !673, file: !76, line: 950, column: 7)
!679 = !DILocation(line: 950, column: 30, scope: !678)
!680 = !DILocation(line: 950, column: 7, scope: !673)
!681 = !DILocation(line: 951, column: 38, scope: !682)
!682 = distinct !DILexicalBlock(scope: !683, file: !76, line: 952, column: 5)
!683 = distinct !DILexicalBlock(scope: !684, file: !76, line: 951, column: 5)
!684 = distinct !DILexicalBlock(scope: !678, file: !76, line: 950, column: 62)
!685 = !DILocation(line: 952, column: 13, scope: !682)
!686 = !DILocation(line: 951, column: 5, scope: !682)
!687 = !DILocation(line: 954, column: 3, scope: !684)
!688 = !DILocation(line: 0, scope: !673)
!689 = !DILocation(line: 955, column: 3, scope: !673)
!690 = distinct !DISubprogram(name: "eci_impl_clean_last_values", scope: !76, file: !76, line: 889, type: !691, scopeLine: 890, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!691 = !DISubroutineType(types: !692)
!692 = !{null, !88}
!693 = !DILocalVariable(name: "parser", arg: 1, scope: !690, file: !76, line: 889, type: !88)
!694 = !DILocation(line: 0, scope: !690)
!695 = !DILocalVariable(name: "__cil_tmp2", scope: !690, file: !76, line: 891, type: !17)
!696 = !DILocation(line: 891, column: 9, scope: !690)
!697 = !DILocalVariable(name: "__cil_tmp3", scope: !690, file: !76, line: 892, type: !17)
!698 = !DILocation(line: 892, column: 9, scope: !690)
!699 = !DILocalVariable(name: "__cil_tmp4", scope: !690, file: !76, line: 893, type: !17)
!700 = !DILocation(line: 893, column: 9, scope: !690)
!701 = !DILocation(line: 891, column: 10, scope: !702)
!702 = distinct !DILexicalBlock(scope: !703, file: !76, line: 891, column: 7)
!703 = distinct !DILexicalBlock(scope: !690, file: !76, line: 895, column: 3)
!704 = !DILocation(line: 891, column: 33, scope: !702)
!705 = !DILocation(line: 891, column: 7, scope: !703)
!706 = !DILocation(line: 891, column: 38, scope: !707)
!707 = distinct !DILexicalBlock(scope: !708, file: !76, line: 893, column: 5)
!708 = distinct !DILexicalBlock(scope: !709, file: !76, line: 892, column: 5)
!709 = distinct !DILexicalBlock(scope: !702, file: !76, line: 891, column: 79)
!710 = !DILocation(line: 891, column: 5, scope: !707)
!711 = !DILocation(line: 896, column: 3, scope: !709)
!712 = !DILocation(line: 893, column: 35, scope: !713)
!713 = distinct !DILexicalBlock(scope: !714, file: !76, line: 898, column: 3)
!714 = distinct !DILexicalBlock(scope: !703, file: !76, line: 897, column: 3)
!715 = !DILocation(line: 893, column: 3, scope: !713)
!716 = !DILocation(line: 894, column: 11, scope: !714)
!717 = !DILocation(line: 894, column: 25, scope: !714)
!718 = !DILocation(line: 895, column: 11, scope: !714)
!719 = !DILocation(line: 895, column: 22, scope: !714)
!720 = !DILocation(line: 896, column: 11, scope: !714)
!721 = !DILocation(line: 896, column: 23, scope: !714)
!722 = !DILocation(line: 897, column: 11, scope: !714)
!723 = !DILocation(line: 897, column: 22, scope: !714)
!724 = !DILocation(line: 898, column: 30, scope: !725)
!725 = distinct !DILexicalBlock(scope: !714, file: !76, line: 898, column: 3)
!726 = !DILocation(line: 898, column: 3, scope: !725)
!727 = !DILocation(line: 899, column: 30, scope: !728)
!728 = distinct !DILexicalBlock(scope: !714, file: !76, line: 900, column: 3)
!729 = !DILocation(line: 899, column: 3, scope: !728)
!730 = !DILocation(line: 900, column: 3, scope: !703)
!731 = distinct !DISubprogram(name: "eci_impl_free_parser", scope: !76, file: !76, line: 879, type: !732, scopeLine: 880, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !74}
!734 = !DILocalVariable(name: "eci_rep", arg: 1, scope: !731, file: !76, line: 879, type: !74)
!735 = !DILocation(line: 0, scope: !731)
!736 = !DILocalVariable(name: "__cil_tmp2", scope: !731, file: !76, line: 881, type: !17)
!737 = !DILocation(line: 881, column: 9, scope: !731)
!738 = !DILocalVariable(name: "__cil_tmp3", scope: !731, file: !76, line: 882, type: !17)
!739 = !DILocation(line: 882, column: 9, scope: !731)
!740 = !DILocalVariable(name: "__cil_tmp4", scope: !731, file: !76, line: 883, type: !17)
!741 = !DILocation(line: 883, column: 9, scope: !731)
!742 = !DILocation(line: 881, column: 9, scope: !743)
!743 = distinct !DILexicalBlock(scope: !744, file: !76, line: 881, column: 7)
!744 = distinct !DILexicalBlock(scope: !731, file: !76, line: 885, column: 3)
!745 = !DILocation(line: 881, column: 7, scope: !744)
!746 = !DILocation(line: 881, column: 38, scope: !747)
!747 = distinct !DILexicalBlock(scope: !748, file: !76, line: 883, column: 5)
!748 = distinct !DILexicalBlock(scope: !749, file: !76, line: 882, column: 5)
!749 = distinct !DILexicalBlock(scope: !743, file: !76, line: 881, column: 18)
!750 = !DILocation(line: 881, column: 5, scope: !747)
!751 = !DILocation(line: 886, column: 3, scope: !749)
!752 = !DILocation(line: 882, column: 31, scope: !753)
!753 = distinct !DILexicalBlock(scope: !754, file: !76, line: 888, column: 3)
!754 = distinct !DILexicalBlock(scope: !744, file: !76, line: 887, column: 3)
!755 = !DILocation(line: 882, column: 45, scope: !753)
!756 = !DILocation(line: 882, column: 3, scope: !753)
!757 = !DILocation(line: 883, column: 31, scope: !758)
!758 = distinct !DILexicalBlock(scope: !754, file: !76, line: 884, column: 3)
!759 = !DILocation(line: 883, column: 45, scope: !758)
!760 = !DILocation(line: 883, column: 3, scope: !758)
!761 = !DILocation(line: 884, column: 31, scope: !762)
!762 = distinct !DILexicalBlock(scope: !754, file: !76, line: 885, column: 3)
!763 = !DILocation(line: 884, column: 45, scope: !762)
!764 = !DILocation(line: 884, column: 3, scope: !762)
!765 = !DILocation(line: 885, column: 25, scope: !766)
!766 = distinct !DILexicalBlock(scope: !754, file: !76, line: 886, column: 3)
!767 = !DILocation(line: 885, column: 8, scope: !766)
!768 = !DILocation(line: 885, column: 3, scope: !766)
!769 = !DILocation(line: 886, column: 12, scope: !754)
!770 = !DILocation(line: 886, column: 24, scope: !754)
!771 = !DILocation(line: 887, column: 3, scope: !744)
!772 = distinct !DISubprogram(name: "eci_impl_fd_read", scope: !76, file: !76, line: 921, type: !773, scopeLine: 922, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!773 = !DISubroutineType(types: !774)
!774 = !{!775, !15, !7, !64, !15}
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !348, line: 110, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !42, line: 180, baseType: !15)
!777 = !DILocalVariable(name: "fd", arg: 1, scope: !772, file: !76, line: 921, type: !15)
!778 = !DILocation(line: 0, scope: !772)
!779 = !DILocalVariable(name: "buf", arg: 2, scope: !772, file: !76, line: 921, type: !7)
!780 = !DILocalVariable(name: "count", arg: 3, scope: !772, file: !76, line: 921, type: !64)
!781 = !DILocalVariable(name: "timeout", arg: 4, scope: !772, file: !76, line: 921, type: !15)
!782 = !DILocalVariable(name: "ufds", scope: !772, file: !76, line: 924, type: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !230, line: 40, size: 64, elements: !784)
!784 = !{!785, !786, !787}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !783, file: !230, line: 41, baseType: !15, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !783, file: !230, line: 42, baseType: !228, size: 16, offset: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !783, file: !230, line: 43, baseType: !228, size: 16, offset: 48)
!788 = !DILocation(line: 924, column: 17, scope: !772)
!789 = !DILocalVariable(name: "nfds", scope: !772, file: !76, line: 923, type: !15)
!790 = !DILocalVariable(name: "rescount", scope: !772, file: !76, line: 925, type: !775)
!791 = !DILocation(line: 928, column: 8, scope: !792)
!792 = distinct !DILexicalBlock(scope: !793, file: !76, line: 929, column: 3)
!793 = distinct !DILexicalBlock(scope: !772, file: !76, line: 928, column: 3)
!794 = !DILocation(line: 928, column: 11, scope: !792)
!795 = !DILocation(line: 929, column: 8, scope: !792)
!796 = !DILocation(line: 929, column: 15, scope: !792)
!797 = !DILocation(line: 930, column: 8, scope: !792)
!798 = !DILocation(line: 930, column: 16, scope: !792)
!799 = !DILocation(line: 932, column: 22, scope: !800)
!800 = distinct !DILexicalBlock(scope: !792, file: !76, line: 931, column: 3)
!801 = !DILocation(line: 932, column: 9, scope: !800)
!802 = !DILocalVariable(name: "ret", scope: !772, file: !76, line: 926, type: !15)
!803 = !DILocation(line: 933, column: 11, scope: !804)
!804 = distinct !DILexicalBlock(scope: !793, file: !76, line: 933, column: 7)
!805 = !DILocation(line: 933, column: 7, scope: !793)
!806 = !DILocation(line: 934, column: 20, scope: !807)
!807 = distinct !DILexicalBlock(scope: !808, file: !76, line: 934, column: 9)
!808 = distinct !DILexicalBlock(scope: !804, file: !76, line: 933, column: 16)
!809 = !DILocation(line: 934, column: 9, scope: !807)
!810 = !DILocation(line: 934, column: 28, scope: !807)
!811 = !DILocation(line: 934, column: 9, scope: !808)
!812 = !DILocation(line: 936, column: 18, scope: !813)
!813 = distinct !DILexicalBlock(scope: !814, file: !76, line: 936, column: 7)
!814 = distinct !DILexicalBlock(scope: !815, file: !76, line: 935, column: 7)
!815 = distinct !DILexicalBlock(scope: !807, file: !76, line: 934, column: 33)
!816 = !DILocation(line: 939, column: 5, scope: !815)
!817 = !DILocation(line: 934, column: 20, scope: !818)
!818 = distinct !DILexicalBlock(scope: !807, file: !76, line: 934, column: 9)
!819 = !DILocation(line: 934, column: 9, scope: !818)
!820 = !DILocation(line: 934, column: 28, scope: !818)
!821 = !DILocation(line: 936, column: 18, scope: !822)
!822 = distinct !DILexicalBlock(scope: !823, file: !76, line: 936, column: 7)
!823 = distinct !DILexicalBlock(scope: !824, file: !76, line: 935, column: 7)
!824 = distinct !DILexicalBlock(scope: !818, file: !76, line: 934, column: 33)
!825 = !DILocation(line: 939, column: 5, scope: !824)
!826 = !DILocation(line: 0, scope: !793)
!827 = !DILocation(line: 0, scope: !807)
!828 = !DILocation(line: 940, column: 3, scope: !808)
!829 = !DILocation(line: 939, column: 11, scope: !830)
!830 = distinct !DILexicalBlock(scope: !804, file: !76, line: 939, column: 7)
!831 = !DILocation(line: 939, column: 7, scope: !804)
!832 = !DILocation(line: 942, column: 3, scope: !833)
!833 = distinct !DILexicalBlock(scope: !830, file: !76, line: 939, column: 17)
!834 = !DILocation(line: 0, scope: !804)
!835 = !DILocation(line: 943, column: 3, scope: !793)
!836 = distinct !DISubprogram(name: "eci_impl_read_return_value", scope: !76, file: !76, line: 1012, type: !837, scopeLine: 1013, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!837 = !DISubroutineType(types: !838)
!838 = !{null, !74, !15}
!839 = !DILocalVariable(name: "eci_rep", arg: 1, scope: !836, file: !76, line: 1012, type: !74)
!840 = !DILocation(line: 0, scope: !836)
!841 = !DILocalVariable(name: "timeout", arg: 2, scope: !836, file: !76, line: 1012, type: !15)
!842 = !DILocalVariable(name: "__cil_tmp8", scope: !836, file: !76, line: 1019, type: !17)
!843 = !DILocation(line: 1019, column: 9, scope: !836)
!844 = !DILocalVariable(name: "__cil_tmp9", scope: !836, file: !76, line: 1020, type: !17)
!845 = !DILocation(line: 1020, column: 9, scope: !836)
