; ModuleID = '/tmp/tmp.ll'
source_filename = "c/flexloader-0.03.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@debug = global i32 0, align 4, !dbg !0
@quiet = global i32 0, align 4, !dbg !89
@.str = private unnamed_addr constant [5 x i8] c"dhqv\00", align 1
@long_options = internal global [5 x %struct.option] [%struct.option { i8* getelementptr inbounds ([6 x i8], [6 x i8]* @.str.10, i32 0, i32 0), i32 0, i32* null, i32 100 }, %struct.option { i8* getelementptr inbounds ([5 x i8], [5 x i8]* @.str.11, i32 0, i32 0), i32 0, i32* null, i32 104 }, %struct.option { i8* getelementptr inbounds ([6 x i8], [6 x i8]* @.str.12, i32 0, i32 0), i32 0, i32* null, i32 113 }, %struct.option { i8* getelementptr inbounds ([8 x i8], [8 x i8]* @.str.13, i32 0, i32 0), i32 0, i32* null, i32 118 }, %struct.option zeroinitializer], align 16, !dbg !92
@.str.1 = private unnamed_addr constant [4 x i8] c"%c\0A\00", align 1
@optind = external global i32, align 4
@.str.2 = private unnamed_addr constant [34 x i8] c"Code NOT downloaded to the FPGA\0A\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "debug", scope: !2, file: !91, line: 41, type: !19, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !88, nameTableKind: GNU)
!3 = !DIFile(filename: "c/flexloader-0.03.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !10, !16, !23, !24, !19, !25, !26, !87, !75, !80}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 106, size: 256, elements: !14)
!13 = !DIFile(filename: "/usr/include/getopt.h", directory: "")
!14 = !{!15, !18, !20, !22}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !12, file: !13, line: 107, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !12, file: !13, line: 108, baseType: !19, size: 32, offset: 64)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !12, file: !13, line: 109, baseType: !21, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !12, file: !13, line: 110, baseType: !19, size: 32, offset: 192)
!23 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!24 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !28, line: 49, baseType: !29)
!28 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !30, line: 271, size: 1728, elements: !31)
!30 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !52, !53, !54, !55, !59, !61, !63, !67, !70, !74, !76, !77, !78, !79, !82, !83}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !29, file: !30, line: 272, baseType: !19, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !29, file: !30, line: 273, baseType: !8, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !29, file: !30, line: 274, baseType: !8, size: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !29, file: !30, line: 275, baseType: !8, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !29, file: !30, line: 276, baseType: !8, size: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !29, file: !30, line: 277, baseType: !8, size: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !29, file: !30, line: 278, baseType: !8, size: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !29, file: !30, line: 279, baseType: !8, size: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !29, file: !30, line: 280, baseType: !8, size: 64, offset: 512)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !29, file: !30, line: 281, baseType: !8, size: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !29, file: !30, line: 282, baseType: !8, size: 64, offset: 640)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !29, file: !30, line: 283, baseType: !8, size: 64, offset: 704)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !29, file: !30, line: 284, baseType: !45, size: 64, offset: 768)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !30, line: 186, size: 192, elements: !47)
!47 = !{!48, !49, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !46, file: !30, line: 187, baseType: !45, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !46, file: !30, line: 188, baseType: !50, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !46, file: !30, line: 189, baseType: !19, size: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !29, file: !30, line: 285, baseType: !50, size: 64, offset: 832)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !29, file: !30, line: 286, baseType: !19, size: 32, offset: 896)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !29, file: !30, line: 287, baseType: !19, size: 32, offset: 928)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !29, file: !30, line: 288, baseType: !56, size: 64, offset: 960)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !57, line: 141, baseType: !58)
!57 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!58 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !29, file: !30, line: 289, baseType: !60, size: 16, offset: 1024)
!60 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !29, file: !30, line: 290, baseType: !62, size: 8, offset: 1040)
!62 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !29, file: !30, line: 291, baseType: !64, size: 8, offset: 1048)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 1)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !29, file: !30, line: 292, baseType: !68, size: 64, offset: 1088)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !30, line: 180, baseType: null)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !29, file: !30, line: 293, baseType: !71, size: 64, offset: 1152)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !57, line: 142, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !57, line: 56, baseType: !73)
!73 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !29, file: !30, line: 294, baseType: !75, size: 64, offset: 1216)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !29, file: !30, line: 295, baseType: !75, size: 64, offset: 1280)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !29, file: !30, line: 296, baseType: !75, size: 64, offset: 1344)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !29, file: !30, line: 297, baseType: !75, size: 64, offset: 1408)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !29, file: !30, line: 298, baseType: !80, size: 32, offset: 1472)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !81, line: 211, baseType: !24)
!81 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !29, file: !30, line: 299, baseType: !19, size: 32, offset: 1504)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !29, file: !30, line: 300, baseType: !84, size: 192, offset: 1536)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 24)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__useconds_t", file: !57, line: 150, baseType: !24)
!88 = !{!0, !89, !92, !97}
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "quiet", scope: !2, file: !91, line: 42, type: !19, isLocal: false, isDefinition: true)
!91 = !DIFile(filename: "/home/wslee/benchmarks/flexloader-0.03/src/main.c", directory: "")
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !91, line: 77, type: !94, isLocal: true, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 1280, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 5)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "data", scope: !2, file: !99, line: 63, type: !25, isLocal: true, isDefinition: true)
!99 = !DIFile(filename: "/home/wslee/benchmarks/flexloader-0.03/src/byteblaster.c", directory: "")
!100 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!101 = !{i32 2, !"Dwarf Version", i32 4}
!102 = !{i32 2, !"Debug Info Version", i32 3}
!103 = !{i32 1, !"wchar_size", i32 4}
!104 = !{i32 7, !"PIC Level", i32 2}
!105 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!106 = distinct !DISubprogram(name: "main", scope: !91, file: !91, line: 72, type: !107, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!107 = !DISubroutineType(types: !108)
!108 = !{!19, !19, !109}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!110 = !DILocalVariable(name: "argc", arg: 1, scope: !106, file: !91, line: 72, type: !19)
!111 = !DILocation(line: 0, scope: !106)
!112 = !DILocalVariable(name: "argv", arg: 2, scope: !106, file: !91, line: 72, type: !109)
!113 = !DILocalVariable(name: "lindex", scope: !106, file: !91, line: 75, type: !19)
!114 = !DILocation(line: 75, column: 7, scope: !106)
!115 = !DILocalVariable(name: "__cil_tmp6", scope: !106, file: !91, line: 77, type: !8)
!116 = !DILocation(line: 77, column: 9, scope: !106)
!117 = !DILocalVariable(name: "__cil_tmp7", scope: !106, file: !91, line: 78, type: !8)
!118 = !DILocation(line: 78, column: 9, scope: !106)
!119 = !DILocalVariable(name: "__cil_tmp8", scope: !106, file: !91, line: 79, type: !8)
!120 = !DILocation(line: 79, column: 9, scope: !106)
!121 = !DILocalVariable(name: "__cil_tmp9", scope: !106, file: !91, line: 80, type: !8)
!122 = !DILocation(line: 80, column: 9, scope: !106)
!123 = !DILocation(line: 75, column: 10, scope: !124)
!124 = distinct !DILexicalBlock(scope: !106, file: !91, line: 82, column: 3)
!125 = !DILocation(line: 86, column: 3, scope: !126)
!126 = distinct !DILexicalBlock(scope: !127, file: !91, line: 77, column: 3)
!127 = distinct !DILexicalBlock(scope: !124, file: !91, line: 76, column: 3)
!128 = !DILocation(line: 86, column: 13, scope: !126)
!129 = !DILocation(line: 86, column: 9, scope: !130)
!130 = distinct !DILexicalBlock(scope: !131, file: !91, line: 90, column: 5)
!131 = distinct !DILexicalBlock(scope: !132, file: !91, line: 89, column: 5)
!132 = distinct !DILexicalBlock(scope: !126, file: !91, line: 86, column: 13)
!133 = !DILocalVariable(name: "c", scope: !106, file: !91, line: 74, type: !19)
!134 = !DILocation(line: 86, column: 14, scope: !135)
!135 = distinct !DILexicalBlock(scope: !132, file: !91, line: 86, column: 9)
!136 = !DILocation(line: 86, column: 9, scope: !132)
!137 = !DILocation(line: 86, column: 7, scope: !138)
!138 = distinct !DILexicalBlock(scope: !135, file: !91, line: 86, column: 22)
!139 = !DILocation(line: 88, column: 5, scope: !140)
