; ModuleID = '/tmp/tmp.ll'
source_filename = "c/fmtools-1.0.4.1.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.video_tuner = type { i32, [32 x i8], i64, i64, i32, i16, i16 }

@.str = private unnamed_addr constant [28 x i8] c"fmtools fmscan version %s\0A\0A\00", align 1
@.str.1 = private unnamed_addr constant [6 x i8] c"1.0.2\00", align 1
@.str.2 = private unnamed_addr constant [74 x i8] c"usage: %s [-h] [-d <dev>] [-s <freq>] [-e <freq>] [-i <freq>] [-t <%%>]\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [65 x i8] c"Auxiliary program to scan a frequency band for radio stations.\0A\0A\00", align 1
@.str.4 = private unnamed_addr constant [33 x i8] c"  -h        - display this help\0A\00", align 1
@.str.5 = private unnamed_addr constant [52 x i8] c"  -d <dev>  - select device (default: /dev/radio0)\0A\00", align 1
@.str.6 = private unnamed_addr constant [53 x i8] c"  -s <freq> - set start of scanning range to <freq>\0A\00", align 1
@.str.7 = private unnamed_addr constant [51 x i8] c"  -e <freq> - set end of scanning range to <freq>\0A\00", align 1

!0 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"PIC Level", i32 2}
!5 = distinct !DICompileUnit(language: DW_LANG_C99, file: !6, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !8, nameTableKind: GNU)
!6 = !DIFile(filename: "c/fmtools-1.0.4.1.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!7 = !{}
!8 = !{!9, !12, !13, !14, !15, !17, !79, !73, !80, !50, !81, !24, !11, !71}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!14 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !19, line: 49, baseType: !20)
!19 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 271, size: 1728, elements: !22)
!21 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!22 = !{!23, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !44, !45, !46, !47, !51, !53, !55, !59, !62, !66, !67, !68, !69, !70, !74, !75}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !20, file: !21, line: 272, baseType: !24, size: 32)
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !20, file: !21, line: 273, baseType: !12, size: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !20, file: !21, line: 274, baseType: !12, size: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !20, file: !21, line: 275, baseType: !12, size: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !20, file: !21, line: 276, baseType: !12, size: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !20, file: !21, line: 277, baseType: !12, size: 64, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !20, file: !21, line: 278, baseType: !12, size: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !20, file: !21, line: 279, baseType: !12, size: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !20, file: !21, line: 280, baseType: !12, size: 64, offset: 512)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !20, file: !21, line: 281, baseType: !12, size: 64, offset: 576)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !20, file: !21, line: 282, baseType: !12, size: 64, offset: 640)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !20, file: !21, line: 283, baseType: !12, size: 64, offset: 704)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !20, file: !21, line: 284, baseType: !37, size: 64, offset: 768)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !21, line: 186, size: 192, elements: !39)
!39 = !{!40, !41, !43}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !38, file: !21, line: 187, baseType: !37, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !38, file: !21, line: 188, baseType: !42, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !38, file: !21, line: 189, baseType: !24, size: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !20, file: !21, line: 285, baseType: !42, size: 64, offset: 832)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !20, file: !21, line: 286, baseType: !24, size: 32, offset: 896)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !20, file: !21, line: 287, baseType: !24, size: 32, offset: 928)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !20, file: !21, line: 288, baseType: !48, size: 64, offset: 960)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !49, line: 141, baseType: !50)
!49 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!50 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !20, file: !21, line: 289, baseType: !52, size: 16, offset: 1024)
!52 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !20, file: !21, line: 290, baseType: !54, size: 8, offset: 1040)
!54 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !20, file: !21, line: 291, baseType: !56, size: 8, offset: 1048)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 1)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !20, file: !21, line: 292, baseType: !60, size: 64, offset: 1088)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !21, line: 180, baseType: null)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !20, file: !21, line: 293, baseType: !63, size: 64, offset: 1152)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !49, line: 142, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !49, line: 56, baseType: !65)
!65 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !20, file: !21, line: 294, baseType: !13, size: 64, offset: 1216)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !20, file: !21, line: 295, baseType: !13, size: 64, offset: 1280)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !20, file: !21, line: 296, baseType: !13, size: 64, offset: 1344)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !20, file: !21, line: 297, baseType: !13, size: 64, offset: 1408)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !20, file: !21, line: 298, baseType: !71, size: 32, offset: 1472)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !72, line: 211, baseType: !73)
!72 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!73 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !20, file: !21, line: 299, baseType: !24, size: 32, offset: 1504)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !20, file: !21, line: 300, baseType: !76, size: 192, offset: 1536)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 192, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 24)
!79 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!80 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__useconds_t", file: !49, line: 150, baseType: !73)
!82 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!83 = distinct !DISubprogram(name: "help", scope: !84, file: !84, line: 37, type: !85, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, retainedNodes: !7)
!84 = !DIFile(filename: "/home/wslee/benchmarks/sound/fmtools-1.0.4.1/fmscan.c", directory: "")
!85 = !DISubroutineType(types: !86)
!86 = !{null, !12}
!87 = !DILocalVariable(name: "prog", arg: 1, scope: !83, file: !84, line: 37, type: !12)
!88 = !DILocation(line: 0, scope: !83)
!89 = !DILocalVariable(name: "__cil_tmp2", scope: !83, file: !84, line: 39, type: !12)
!90 = !DILocation(line: 39, column: 9, scope: !83)
!91 = !DILocalVariable(name: "__cil_tmp3", scope: !83, file: !84, line: 40, type: !12)
!92 = !DILocation(line: 40, column: 9, scope: !83)
!93 = !DILocalVariable(name: "__cil_tmp4", scope: !83, file: !84, line: 41, type: !12)
!94 = !DILocation(line: 41, column: 9, scope: !83)
!95 = !DILocalVariable(name: "__cil_tmp5", scope: !83, file: !84, line: 42, type: !12)
!96 = !DILocation(line: 42, column: 9, scope: !83)
!97 = !DILocalVariable(name: "__cil_tmp6", scope: !83, file: !84, line: 43, type: !12)
!98 = !DILocation(line: 43, column: 9, scope: !83)
!99 = !DILocalVariable(name: "__cil_tmp7", scope: !83, file: !84, line: 44, type: !12)
!100 = !DILocation(line: 44, column: 9, scope: !83)
!101 = !DILocalVariable(name: "__cil_tmp8", scope: !83, file: !84, line: 45, type: !12)
!102 = !DILocation(line: 45, column: 9, scope: !83)
!103 = !DILocalVariable(name: "__cil_tmp9", scope: !83, file: !84, line: 46, type: !12)
!104 = !DILocation(line: 46, column: 9, scope: !83)
!105 = !DILocalVariable(name: "__cil_tmp10", scope: !83, file: !84, line: 47, type: !12)
!106 = !DILocation(line: 47, column: 9, scope: !83)
!107 = !DILocalVariable(name: "__cil_tmp11", scope: !83, file: !84, line: 48, type: !12)
!108 = !DILocation(line: 48, column: 9, scope: !83)
!109 = !DILocalVariable(name: "__cil_tmp12", scope: !83, file: !84, line: 49, type: !12)
!110 = !DILocation(line: 49, column: 9, scope: !83)
!111 = !DILocation(line: 39, column: 3, scope: !112)
!112 = distinct !DILexicalBlock(scope: !113, file: !84, line: 53, column: 3)
!113 = distinct !DILexicalBlock(scope: !114, file: !84, line: 52, column: 3)
!114 = distinct !DILexicalBlock(scope: !83, file: !84, line: 51, column: 3)
!115 = !DILocation(line: 40, column: 3, scope: !116)
!116 = distinct !DILexicalBlock(scope: !113, file: !84, line: 41, column: 3)
!117 = !DILocation(line: 42, column: 3, scope: !118)
!118 = distinct !DILexicalBlock(scope: !113, file: !84, line: 43, column: 3)
!119 = !DILocation(line: 44, column: 3, scope: !120)
!120 = distinct !DILexicalBlock(scope: !113, file: !84, line: 44, column: 3)
!121 = !DILocation(line: 45, column: 3, scope: !122)
!122 = distinct !DILexicalBlock(scope: !113, file: !84, line: 46, column: 3)
!123 = !DILocation(line: 46, column: 3, scope: !124)
!124 = distinct !DILexicalBlock(scope: !113, file: !84, line: 47, column: 3)
!125 = !DILocation(line: 47, column: 3, scope: !126)
!126 = distinct !DILexicalBlock(scope: !113, file: !84, line: 48, column: 3)
!127 = !DILocation(line: 48, column: 3, scope: !128)
!128 = distinct !DILexicalBlock(scope: !113, file: !84, line: 49, column: 3)
!129 = !DILocation(line: 49, column: 3, scope: !130)
!130 = distinct !DILexicalBlock(scope: !113, file: !84, line: 50, column: 3)
!131 = !DILocation(line: 50, column: 3, scope: !132)
!132 = distinct !DILexicalBlock(scope: !113, file: !84, line: 51, column: 3)
!133 = !DILocation(line: 52, column: 3, scope: !134)
!134 = distinct !DILexicalBlock(scope: !113, file: !84, line: 52, column: 3)
!135 = !DILocation(line: 56, column: 1, scope: !83)
!136 = distinct !DISubprogram(name: "main", scope: !84, file: !84, line: 55, type: !137, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, retainedNodes: !7)
!137 = !DISubroutineType(types: !138)
!138 = !{!24, !24, !139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!140 = !DILocalVariable(name: "argc", arg: 1, scope: !136, file: !84, line: 55, type: !24)
!141 = !DILocation(line: 0, scope: !136)
!142 = !DILocalVariable(name: "argv", arg: 2, scope: !136, file: !84, line: 55, type: !139)
!143 = !DILocalVariable(name: "vt", scope: !136, file: !84, line: 61, type: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_tuner", file: !145, line: 53, size: 512, elements: !146)
!145 = !DIFile(filename: "/home/wslee/benchmarks/sound/fmtools-1.0.4.1/videodev.h", directory: "")
!146 = !{!147, !148, !152, !153, !154, !157, !159}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tuner", scope: !144, file: !145, line: 54, baseType: !24, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !144, file: !145, line: 55, baseType: !149, size: 256, offset: 32)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 256, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "rangelow", scope: !144, file: !145, line: 56, baseType: !79, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "rangehigh", scope: !144, file: !145, line: 57, baseType: !79, size: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !144, file: !145, line: 58, baseType: !155, size: 32, offset: 448)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !156, line: 52, baseType: !73)
!156 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !144, file: !145, line: 59, baseType: !158, size: 16, offset: 480)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !156, line: 50, baseType: !52)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !144, file: !145, line: 60, baseType: !158, size: 16, offset: 496)
!160 = !DILocation(line: 61, column: 22, scope: !136)
!161 = !DILocalVariable(name: "freq", scope: !136, file: !84, line: 69, type: !50)
!162 = !DILocation(line: 69, column: 8, scope: !136)
!163 = !DILocalVariable(name: "__cil_tmp31", scope: !136, file: !84, line: 85, type: !12)
!164 = !DILocation(line: 85, column: 9, scope: !136)
!165 = !DILocalVariable(name: "__cil_tmp32", scope: !136, file: !84, line: 86, type: !12)
!166 = !DILocation(line: 86, column: 9, scope: !136)
!167 = !DILocalVariable(name: "__cil_tmp33", scope: !136, file: !84, line: 87, type: !12)
!168 = !DILocation(line: 87, column: 9, scope: !136)
!169 = !DILocalVariable(name: "__cil_tmp34", scope: !136, file: !84, line: 88, type: !12)
!170 = !DILocation(line: 88, column: 9, scope: !136)
!171 = !DILocalVariable(name: "__cil_tmp35", scope: !136, file: !84, line: 89, type: !12)
!172 = !DILocation(line: 89, column: 9, scope: !136)
!173 = !DILocalVariable(name: "__cil_tmp36", scope: !136, file: !84, line: 90, type: !12)
!174 = !DILocation(line: 90, column: 9, scope: !136)
!175 = !DILocalVariable(name: "__cil_tmp37", scope: !136, file: !84, line: 91, type: !12)
!176 = !DILocation(line: 91, column: 9, scope: !136)
!177 = !DILocalVariable(name: "__cil_tmp38", scope: !136, file: !84, line: 92, type: !12)
!178 = !DILocation(line: 92, column: 9, scope: !136)
!179 = !DILocalVariable(name: "__cil_tmp39", scope: !136, file: !84, line: 93, type: !12)
!180 = !DILocation(line: 93, column: 9, scope: !136)
!181 = !DILocalVariable(name: "__cil_tmp40", scope: !136, file: !84, line: 94, type: !12)
!182 = !DILocation(line: 94, column: 9, scope: !136)
!183 = !DILocalVariable(name: "__cil_tmp41", scope: !136, file: !84, line: 95, type: !12)
!184 = !DILocation(line: 95, column: 9, scope: !136)
!185 = !DILocalVariable(name: "tries", scope: !136, file: !84, line: 60, type: !24)
!186 = !DILocalVariable(name: "dev", scope: !136, file: !84, line: 74, type: !12)
!187 = !DILocation(line: 63, column: 21, scope: !188)
!188 = distinct !DILexicalBlock(scope: !136, file: !84, line: 97, column: 3)
!189 = !DILocation(line: 63, column: 14, scope: !188)
!190 = !DILocalVariable(name: "progname", scope: !136, file: !84, line: 73, type: !12)
!191 = !DILocalVariable(name: "begval", scope: !136, file: !84, line: 63, type: !14)
!192 = !DILocalVariable(name: "incval", scope: !136, file: !84, line: 64, type: !14)
!193 = !DILocalVariable(name: "endval", scope: !136, file: !84, line: 65, type: !14)
!194 = !DILocalVariable(name: "threshold", scope: !136, file: !84, line: 66, type: !14)
!195 = !DILocation(line: 72, column: 3, scope: !196)
!196 = distinct !DILexicalBlock(scope: !197, file: !84, line: 72, column: 3)
!197 = distinct !DILexicalBlock(scope: !188, file: !84, line: 71, column: 3)
!198 = !DILocation(line: 67, column: 10, scope: !188)
!199 = !DILocation(line: 66, column: 10, scope: !188)
!200 = !DILocation(line: 68, column: 10, scope: !188)
!201 = !DILocation(line: 70, column: 13, scope: !188)
!202 = !DILocation(line: 0, scope: !188)
!203 = !DILocation(line: 72, column: 13, scope: !196)
!204 = !DILocation(line: 72, column: 9, scope: !205)
!205 = distinct !DILexicalBlock(scope: !206, file: !84, line: 76, column: 5)
!206 = distinct !DILexicalBlock(scope: !207, file: !84, line: 75, column: 5)
!207 = distinct !DILexicalBlock(scope: !196, file: !84, line: 72, column: 13)
!208 = !DILocalVariable(name: "i", scope: !136, file: !84, line: 59, type: !24)
!209 = !DILocation(line: 72, column: 14, scope: !210)
!210 = distinct !DILexicalBlock(scope: !207, file: !84, line: 72, column: 9)
!211 = !DILocation(line: 72, column: 9, scope: !207)
!212 = !DILocation(line: 72, column: 7, scope: !213)
!213 = distinct !DILexicalBlock(scope: !210, file: !84, line: 72, column: 22)
!214 = !DILocation(line: 74, column: 11, scope: !215)
!215 = distinct !DILexicalBlock(scope: !216, file: !84, line: 74, column: 9)
