; ModuleID = '/tmp/tmp.ll'
source_filename = "c/gbsplay-0.0.91.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.output_plugin = type { i8*, i8*, i64, i64 (i32, i64)*, i32 (i32)*, i32 (i64, i32, i8)*, i32 (i8*, i32)*, void ()* }
%union.__anonunion_gbcpu_regs_u_28 = type { %struct.__anonstruct_rn_29 }
%struct.__anonstruct_rn_29 = type { i8, i8, i8, i8, i8, i8, i8, i8, i16, i16 }
%struct.opinfo = type { void (i32, %struct.opinfo*)* }
%struct.gbhw_buffer = type { i16*, i64, i64, i64, i64, i64, i64 }
%struct.gbhw_channel = type { i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.termios = type { i32, i32, i32, i32, i8, [32 x i8], i32, i32 }
%struct.cfg_option = type { i8*, i8*, void (i8*)* }
%struct.gbs = type { i8*, i64, i64, i64, i16, i16, i16, i16, i8, i8, i8*, i8*, i8*, i64, i8*, i8*, i32, i32, i32, %struct.gbs_subsong_info*, i8*, [99 x i8], i8*, i64, i64, i16, i16, i16, i16, i16, i16, i64, i64, i64, i64, i64, i64, i64 (%struct.gbs*, i8*)*, i8* }
%struct.gbs_subsong_info = type { i32, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "c", scope: !2, file: !323, line: 60, type: !15, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !12, globals: !294, nameTableKind: GNU)
!3 = !DIFile(filename: "c/gbsplay-0.0.91.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "plugout_endian", file: !6, line: 6, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/home/wslee/benchmarks/sound/gbsplay-0.0.91/plugout.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PLUGOUT_ENDIAN_BIG", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PLUGOUT_ENDIAN_LITTLE", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PLUGOUT_ENDIAN_NATIVE", value: 2, isUnsigned: true)
!12 = !{!13, !14, !15, !16, !5, !17, !18, !20, !21, !22, !23, !24, !76, !83, !85, !86, !87, !89, !91, !90, !88, !70, !92, !94, !96, !120, !131, !151, !156, !163, !164, !183, !184, !7, !187, !274, !275, !277, !279, !281, !282, !285, !288, !291, !271}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!22 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !26, line: 49, baseType: !27)
!26 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !28, line: 271, size: 1728, elements: !29)
!28 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !50, !51, !52, !53, !56, !58, !60, !64, !67, !71, !72, !73, !74, !75, !78, !79}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !27, file: !28, line: 272, baseType: !14, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !27, file: !28, line: 273, baseType: !16, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !27, file: !28, line: 274, baseType: !16, size: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !27, file: !28, line: 275, baseType: !16, size: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !27, file: !28, line: 276, baseType: !16, size: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !27, file: !28, line: 277, baseType: !16, size: 64, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !27, file: !28, line: 278, baseType: !16, size: 64, offset: 384)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !27, file: !28, line: 279, baseType: !16, size: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !27, file: !28, line: 280, baseType: !16, size: 64, offset: 512)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !27, file: !28, line: 281, baseType: !16, size: 64, offset: 576)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !27, file: !28, line: 282, baseType: !16, size: 64, offset: 640)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !27, file: !28, line: 283, baseType: !16, size: 64, offset: 704)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !27, file: !28, line: 284, baseType: !43, size: 64, offset: 768)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !28, line: 186, size: 192, elements: !45)
!45 = !{!46, !47, !49}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !44, file: !28, line: 187, baseType: !43, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !44, file: !28, line: 188, baseType: !48, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !44, file: !28, line: 189, baseType: !14, size: 32, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !27, file: !28, line: 285, baseType: !48, size: 64, offset: 832)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !27, file: !28, line: 286, baseType: !14, size: 32, offset: 896)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !27, file: !28, line: 287, baseType: !14, size: 32, offset: 928)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !27, file: !28, line: 288, baseType: !54, size: 64, offset: 960)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !55, line: 141, baseType: !15)
!55 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !27, file: !28, line: 289, baseType: !57, size: 16, offset: 1024)
!57 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !27, file: !28, line: 290, baseType: !59, size: 8, offset: 1040)
!59 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !27, file: !28, line: 291, baseType: !61, size: 8, offset: 1048)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 1)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !27, file: !28, line: 292, baseType: !65, size: 64, offset: 1088)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !28, line: 180, baseType: null)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !27, file: !28, line: 293, baseType: !68, size: 64, offset: 1152)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !55, line: 142, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !55, line: 56, baseType: !70)
!70 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !27, file: !28, line: 294, baseType: !23, size: 64, offset: 1216)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !27, file: !28, line: 295, baseType: !23, size: 64, offset: 1280)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !27, file: !28, line: 296, baseType: !23, size: 64, offset: 1344)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !27, file: !28, line: 297, baseType: !23, size: 64, offset: 1408)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !27, file: !28, line: 298, baseType: !76, size: 32, offset: 1472)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !77, line: 211, baseType: !7)
!77 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !27, file: !28, line: 299, baseType: !14, size: 32, offset: 1504)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !27, file: !28, line: 300, baseType: !80, size: 192, offset: 1536)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 192, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 24)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !84, line: 52, baseType: !7)
!84 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !84, line: 50, baseType: !57)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !84, line: 49, baseType: !88)
!88 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!91 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !93, line: 196, baseType: !90)
!93 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gbs", file: !98, line: 26, size: 2688, elements: !99)
!98 = !DIFile(filename: "/home/wslee/benchmarks/sound/gbsplay-0.0.91/gbs.h", directory: "")
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !125, !126, !130, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !150}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !97, file: !98, line: 27, baseType: !16, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !97, file: !98, line: 28, baseType: !15, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "songs", scope: !97, file: !98, line: 29, baseType: !15, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "defaultsong", scope: !97, file: !98, line: 30, baseType: !15, size: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !97, file: !98, line: 31, baseType: !86, size: 16, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !97, file: !98, line: 32, baseType: !86, size: 16, offset: 272)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "play", scope: !97, file: !98, line: 33, baseType: !86, size: 16, offset: 288)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !97, file: !98, line: 34, baseType: !86, size: 16, offset: 304)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tma", scope: !97, file: !98, line: 35, baseType: !87, size: 8, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tmc", scope: !97, file: !98, line: 36, baseType: !87, size: 8, offset: 328)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !97, file: !98, line: 37, baseType: !16, size: 64, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "author", scope: !97, file: !98, line: 38, baseType: !16, size: 64, offset: 448)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "copyright", scope: !97, file: !98, line: 39, baseType: !16, size: 64, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "codelen", scope: !97, file: !98, line: 40, baseType: !22, size: 64, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !97, file: !98, line: 41, baseType: !16, size: 64, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "exthdr", scope: !97, file: !98, line: 42, baseType: !16, size: 64, offset: 704)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "filesize", scope: !97, file: !98, line: 43, baseType: !76, size: 32, offset: 768)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !97, file: !98, line: 44, baseType: !83, size: 32, offset: 800)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "crcnow", scope: !97, file: !98, line: 45, baseType: !83, size: 32, offset: 832)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "subsong_info", scope: !97, file: !98, line: 46, baseType: !120, size: 64, offset: 896)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gbs_subsong_info", file: !98, line: 21, size: 128, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !121, file: !98, line: 22, baseType: !83, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !121, file: !98, line: 23, baseType: !16, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "strings", scope: !97, file: !98, line: 47, baseType: !16, size: 64, offset: 960)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "v1strings", scope: !97, file: !98, line: 48, baseType: !127, size: 792, offset: 1024)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 792, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 99)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "rom", scope: !97, file: !98, line: 49, baseType: !131, size: 64, offset: 1856)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "romsize", scope: !97, file: !98, line: 50, baseType: !22, size: 64, offset: 1920)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !97, file: !98, line: 51, baseType: !70, size: 64, offset: 1984)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "lmin", scope: !97, file: !98, line: 52, baseType: !92, size: 16, offset: 2048)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "lmax", scope: !97, file: !98, line: 53, baseType: !92, size: 16, offset: 2064)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "lvol", scope: !97, file: !98, line: 54, baseType: !92, size: 16, offset: 2080)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "rmin", scope: !97, file: !98, line: 55, baseType: !92, size: 16, offset: 2096)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !97, file: !98, line: 56, baseType: !92, size: 16, offset: 2112)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "rvol", scope: !97, file: !98, line: 57, baseType: !92, size: 16, offset: 2128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "subsong_timeout", scope: !97, file: !98, line: 58, baseType: !15, size: 64, offset: 2176)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "silence_timeout", scope: !97, file: !98, line: 59, baseType: !15, size: 64, offset: 2240)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "fadeout", scope: !97, file: !98, line: 60, baseType: !15, size: 64, offset: 2304)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "gap", scope: !97, file: !98, line: 61, baseType: !15, size: 64, offset: 2368)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "silence_start", scope: !97, file: !98, line: 62, baseType: !70, size: 64, offset: 2432)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "subsong", scope: !97, file: !98, line: 63, baseType: !15, size: 64, offset: 2496)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nextsubsong_cb", scope: !97, file: !98, line: 64, baseType: !147, size: 64, offset: 2560)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!15, !96, !23}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nextsubsong_cb_priv", scope: !97, file: !98, line: 65, baseType: !23, size: 64, offset: 2624)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gbhw_buffer", file: !153, line: 16, size: 448, elements: !154)
!153 = !DIFile(filename: "/home/wslee/benchmarks/sound/gbsplay-0.0.91/gbhw.h", directory: "")
!154 = !{!155, !157, !158, !159, !160, !161, !162}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !152, file: !153, line: 17, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !152, file: !153, line: 18, baseType: !15, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "l_lvl", scope: !152, file: !153, line: 19, baseType: !15, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "r_lvl", scope: !152, file: !153, line: 20, baseType: !15, size: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !152, file: !153, line: 21, baseType: !15, size: 64, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !152, file: !153, line: 22, baseType: !15, size: 64, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "cycles", scope: !152, file: !153, line: 23, baseType: !15, size: 64, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__useconds_t", file: !55, line: 150, baseType: !7)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "termios", file: !167, line: 30, size: 480, elements: !168)
!167 = !DIFile(filename: "/usr/include/bits/termios.h", directory: "")
!168 = !{!169, !171, !172, !173, !174, !176, !180, !182}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "c_iflag", scope: !166, file: !167, line: 31, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcflag_t", file: !167, line: 27, baseType: !7)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "c_oflag", scope: !166, file: !167, line: 32, baseType: !170, size: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "c_cflag", scope: !166, file: !167, line: 33, baseType: !170, size: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "c_lflag", scope: !166, file: !167, line: 34, baseType: !170, size: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "c_line", scope: !166, file: !167, line: 35, baseType: !175, size: 8, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "cc_t", file: !167, line: 25, baseType: !88)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "c_cc", scope: !166, file: !167, line: 36, baseType: !177, size: 256, offset: 136)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 256, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "c_ispeed", scope: !166, file: !167, line: 37, baseType: !181, size: 32, offset: 416)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "speed_t", file: !167, line: 26, baseType: !7)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "c_ospeed", scope: !166, file: !167, line: 38, baseType: !181, size: 32, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !185, line: 76, baseType: !186)
!185 = !DIFile(filename: "/usr/include/time.h", directory: "")
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !55, line: 149, baseType: !15)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !190, line: 25, size: 1216, elements: !191)
!190 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "")
!191 = !{!192, !260, !269, !270}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !189, file: !190, line: 26, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion___sigaction_handler_47", file: !190, line: 25, size: 64, elements: !194)
!194 = !{!195, !199}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !193, file: !190, line: 26, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !14}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !193, file: !190, line: 27, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !14, !203, !23}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !205, line: 51, baseType: !206)
!205 = !DIFile(filename: "/usr/include/bits/siginfo.h", directory: "")
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "siginfo", file: !205, line: 51, size: 1088, elements: !207)
!207 = !{!208, !209, !210, !211}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !206, file: !205, line: 52, baseType: !14, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !206, file: !205, line: 53, baseType: !14, size: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !206, file: !205, line: 54, baseType: !14, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !206, file: !205, line: 55, baseType: !212, size: 960, offset: 128)
!212 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion__sifields_29", file: !205, line: 51, size: 960, elements: !213)
!213 = !{!214, !218, !225, !236, !242, !251, !255}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !212, file: !205, line: 52, baseType: !215, size: 928)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 928, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 29)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !212, file: !205, line: 53, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct__kill_30", file: !205, line: 51, size: 64, elements: !220)
!220 = !{!221, !223}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !219, file: !205, line: 52, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !55, line: 143, baseType: !14)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !219, file: !205, line: 53, baseType: !224, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !55, line: 135, baseType: !7)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !212, file: !205, line: 54, baseType: !226, size: 128)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct__timer_31", file: !205, line: 51, size: 128, elements: !227)
!227 = !{!228, !229, !230}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !226, file: !205, line: 52, baseType: !14, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !226, file: !205, line: 53, baseType: !14, size: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !226, file: !205, line: 54, baseType: !231, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !205, line: 33, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !205, line: 33, size: 64, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !232, file: !205, line: 34, baseType: !14, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !232, file: !205, line: 35, baseType: !23, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !212, file: !205, line: 55, baseType: !237, size: 128)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct__rt_32", file: !205, line: 51, size: 128, elements: !238)
!238 = !{!239, !240, !241}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !237, file: !205, line: 52, baseType: !222, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !237, file: !205, line: 53, baseType: !224, size: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !237, file: !205, line: 54, baseType: !231, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !212, file: !205, line: 56, baseType: !243, size: 256)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct__sigchld_33", file: !205, line: 51, size: 256, elements: !244)
!244 = !{!245, !246, !247, !248, !250}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !243, file: !205, line: 52, baseType: !222, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !243, file: !205, line: 53, baseType: !224, size: 32, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !243, file: !205, line: 54, baseType: !14, size: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !243, file: !205, line: 55, baseType: !249, size: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !55, line: 145, baseType: !15)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !243, file: !205, line: 56, baseType: !249, size: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !212, file: !205, line: 57, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct__sigfault_34", file: !205, line: 51, size: 64, elements: !253)
!253 = !{!254}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !252, file: !205, line: 52, baseType: !23, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !212, file: !205, line: 58, baseType: !256, size: 128)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct__sigpoll_35", file: !205, line: 51, size: 128, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !256, file: !205, line: 52, baseType: !15, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !256, file: !205, line: 53, baseType: !14, size: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !189, file: !190, line: 27, baseType: !261, size: 1024, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !262, line: 29, baseType: !263)
!262 = !DIFile(filename: "/usr/include/bits/sigset.h", directory: "")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct___sigset_t_7", file: !262, line: 29, size: 1024, elements: !264)
!264 = !{!265}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !263, file: !262, line: 30, baseType: !266, size: 1024)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1024, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 16)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !189, file: !190, line: 28, baseType: !14, size: 32, offset: 1088)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !189, file: !190, line: 29, baseType: !271, size: 64, offset: 1152)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{null}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !93, line: 110, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !55, line: 180, baseType: !14)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !93, line: 195, baseType: !59)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!15, !5, !15}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!14, !14}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!14, !15, !83, !87}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!279, !94, !76}
!294 = !{!295, !309, !313, !315, !318, !321, !324, !326, !328, !330, !332, !0, !334, !336, !359, !361, !363, !366, !372, !399, !401, !406, !408, !413, !415, !417, !419, !421, !423, !425, !427, !429, !431, !433, !438, !440, !445, !447, !449, !452, !454, !456, !458, !460, !463, !465, !467, !469, !471, !474, !477, !479, !486, !493, !504, !509, !515, !517, !519, !521, !523, !525, !528, !530, !532, !534, !536, !538, !540, !542, !544, !546, !548, !550, !552, !554, !556, !558, !560, !562, !564, !566, !568, !573, !586, !588, !590, !592, !594, !596, !598, !603, !608, !613, !615, !617, !619, !621, !623, !625, !627, !629, !631, !633, !635, !637, !642, !644, !646, !648, !651, !653}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "plugout_midi", scope: !2, file: !297, line: 308, type: !298, isLocal: false, isDefinition: true)
!297 = !DIFile(filename: "/home/wslee/benchmarks/sound/gbsplay-0.0.91/plugout_midi.c", directory: "")
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "output_plugin", file: !6, line: 20, size: 512, elements: !300)
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !299, file: !6, line: 21, baseType: !16, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !299, file: !6, line: 22, baseType: !16, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !299, file: !6, line: 23, baseType: !15, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !299, file: !6, line: 24, baseType: !282, size: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !299, file: !6, line: 25, baseType: !285, size: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !299, file: !6, line: 26, baseType: !288, size: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !299, file: !6, line: 27, baseType: !291, size: 64, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !299, file: !6, line: 28, baseType: !271, size: 64, offset: 448)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression(DW_OP_constu, 4194, DW_OP_stack_value))
!310 = distinct !DIGlobalVariable(name: "msec_cycles", scope: !2, file: !311, line: 47, type: !312, isLocal: true, isDefinition: true)
!311 = !DIFile(filename: "/home/wslee/benchmarks/sound/gbsplay-0.0.91/gbhw.c", directory: "")
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression(DW_OP_constu, 70256, DW_OP_stack_value))
!314 = distinct !DIGlobalVariable(name: "vblanktc", scope: !2, file: !311, line: 42, type: !312, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "plugout_devdsp", scope: !2, file: !317, line: 81, type: !298, isLocal: false, isDefinition: true)
!317 = !DIFile(filename: "/home/wslee/benchmarks/sound/gbsplay-0.0.91/plugout_devdsp.c", directory: "")
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "plugout_stdout", scope: !2, file: !320, line: 42, type: !298, isLocal: false, isDefinition: true)
!320 = !DIFile(filename: "/home/wslee/benchmarks/sound/gbsplay-0.0.91/plugout_stdout.c", directory: "")
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "cfg_line", scope: !2, file: !323, line: 21, type: !15, isLocal: true, isDefinition: true)
!323 = !DIFile(filename: "/home/wslee/benchmarks/sound/gbsplay-0.0.91/cfgparser.c", directory: "")
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "cfg_char", scope: !2, file: !323, line: 21, type: !15, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "cfg_file", scope: !2, file: !323, line: 22, type: !24, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "nextchar_state", scope: !2, file: !323, line: 24, type: !15, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "state", scope: !2, file: !323, line: 58, type: !15, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "nextstate", scope: !2, file: !323, line: 59, type: !15, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "filename", scope: !2, file: !323, line: 61, type: !18, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "gbcpu_regs", scope: !2, file: !338, line: 102, type: !339, isLocal: false, isDefinition: true)
!338 = !DIFile(filename: "/home/wslee/benchmarks/sound/gbsplay-0.0.91/gbcpu.h", directory: "")
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "gbcpu_regs_u", file: !338, line: 58, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_gbcpu_regs_u_28", file: !338, line: 58, size: 96, elements: !341)
!341 = !{!342, !346}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ri", scope: !340, file: !338, line: 59, baseType: !343, size: 96)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 96, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 12)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "rn", scope: !340, file: !338, line: 60, baseType: !347, size: 96)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_rn_29", file: !338, line: 58, size: 96, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354, !355, !356, !357, !358}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !347, file: !338, line: 59, baseType: !87, size: 8)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !347, file: !338, line: 60, baseType: !87, size: 8, offset: 8)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !347, file: !338, line: 61, baseType: !87, size: 8, offset: 16)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !347, file: !338, line: 62, baseType: !87, size: 8, offset: 24)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !347, file: !338, line: 63, baseType: !87, size: 8, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !347, file: !338, line: 64, baseType: !87, size: 8, offset: 40)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !347, file: !338, line: 65, baseType: !87, size: 8, offset: 48)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !347, file: !338, line: 66, baseType: !87, size: 8, offset: 56)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !347, file: !338, line: 67, baseType: !86, size: 16, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !347, file: !338, line: 68, baseType: !86, size: 16, offset: 80)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "gbcpu_halted", scope: !2, file: !338, line: 103, type: !15, isLocal: false, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "gbcpu_if", scope: !2, file: !338, line: 104, type: !15, isLocal: false, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "gbcpu_stopped", scope: !2, file: !365, line: 40, type: !15, isLocal: false, isDefinition: true)
!365 = !DIFile(filename: "/home/wslee/benchmarks/sound/gbsplay-0.0.91/gbcpu.c", directory: "")
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "crc_table", scope: !2, file: !368, line: 13, type: !369, isLocal: true, isDefinition: true)
!368 = !DIFile(filename: "/home/wslee/benchmarks/sound/gbsplay-0.0.91/crc32.c", directory: "")
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 16384, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 256)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "gbhw_ch", scope: !2, file: !153, line: 49, type: !374, isLocal: false, isDefinition: true)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 5120, elements: !397)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gbhw_channel", file: !153, line: 26, size: 1280, elements: !376)
!376 = !{!377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "mute", scope: !375, file: !153, line: 27, baseType: !15, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !375, file: !153, line: 28, baseType: !15, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "leftgate", scope: !375, file: !153, line: 29, baseType: !15, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "rightgate", scope: !375, file: !153, line: 30, baseType: !15, size: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "l_lvl", scope: !375, file: !153, line: 31, baseType: !15, size: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "r_lvl", scope: !375, file: !153, line: 32, baseType: !15, size: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !375, file: !153, line: 33, baseType: !15, size: 64, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "env_dir", scope: !375, file: !153, line: 34, baseType: !15, size: 64, offset: 448)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "env_tc", scope: !375, file: !153, line: 35, baseType: !15, size: 64, offset: 512)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "env_ctr", scope: !375, file: !153, line: 36, baseType: !15, size: 64, offset: 576)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "sweep_dir", scope: !375, file: !153, line: 37, baseType: !15, size: 64, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sweep_tc", scope: !375, file: !153, line: 38, baseType: !15, size: 64, offset: 704)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "sweep_ctr", scope: !375, file: !153, line: 39, baseType: !15, size: 64, offset: 768)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "sweep_shift", scope: !375, file: !153, line: 40, baseType: !15, size: 64, offset: 832)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !375, file: !153, line: 41, baseType: !15, size: 64, offset: 896)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "len_enable", scope: !375, file: !153, line: 42, baseType: !15, size: 64, offset: 960)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "div_tc", scope: !375, file: !153, line: 43, baseType: !15, size: 64, offset: 1024)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "div_ctr", scope: !375, file: !153, line: 44, baseType: !15, size: 64, offset: 1088)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "duty_tc", scope: !375, file: !153, line: 45, baseType: !15, size: 64, offset: 1152)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "duty_ctr", scope: !375, file: !153, line: 46, baseType: !15, size: 64, offset: 1216)
!397 = !{!398}
!398 = !DISubrange(count: 4)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "rom", scope: !2, file: !311, line: 20, type: !131, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "intram", scope: !2, file: !311, line: 21, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 65536, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 8192)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "extram", scope: !2, file: !311, line: 22, type: !403, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "ioregs", scope: !2, file: !311, line: 23, type: !410, isLocal: true, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 1024, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 128)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "hiram", scope: !2, file: !311, line: 24, type: !410, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "lastbank", scope: !2, file: !311, line: 26, type: !15, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "lminval", scope: !2, file: !311, line: 34, type: !15, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "lmaxval", scope: !2, file: !311, line: 34, type: !15, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "rminval", scope: !2, file: !311, line: 34, type: !15, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "rmaxval", scope: !2, file: !311, line: 34, type: !15, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "master_volume", scope: !2, file: !311, line: 38, type: !15, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "master_fade", scope: !2, file: !311, line: 39, type: !15, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "master_dstvol", scope: !2, file: !311, line: 40, type: !15, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "sum_cycles", scope: !2, file: !311, line: 49, type: !15, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "callback", scope: !2, file: !311, line: 53, type: !435, isLocal: true, isDefinition: true)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !151, !23}
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "callbackpriv", scope: !2, file: !311, line: 54, type: !23, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "iocallback", scope: !2, file: !311, line: 58, type: !442, isLocal: true, isDefinition: true)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !15, !83, !87, !23}
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "iocallback_priv", scope: !2, file: !311, line: 59, type: !23, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "fd", scope: !2, file: !320, line: 16, type: !14, isLocal: false, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "ots", scope: !2, file: !451, line: 51, type: !166, isLocal: true, isDefinition: true)
!451 = !DIFile(filename: "/home/wslee/benchmarks/sound/gbsplay-0.0.91/gbsplay.c", directory: "")
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "random_seed", scope: !2, file: !451, line: 56, type: !22, isLocal: false, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "sound_open", scope: !2, file: !451, line: 80, type: !282, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "sound_skip", scope: !2, file: !451, line: 81, type: !285, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "sound_close", scope: !2, file: !451, line: 84, type: !271, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "myname", scope: !2, file: !462, line: 19, type: !16, isLocal: false, isDefinition: true)
!462 = !DIFile(filename: "/home/wslee/benchmarks/sound/gbsplay-0.0.91/gbsinfo.c", directory: "")
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "cycles_prev", scope: !2, file: !297, line: 40, type: !15, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "file", scope: !2, file: !297, line: 35, type: !24, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "track_length_offset", scope: !2, file: !297, line: 38, type: !15, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "track_length", scope: !2, file: !297, line: 37, type: !15, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "volume", scope: !2, file: !297, line: 234, type: !473, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 128, elements: !397)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "div___0", scope: !2, file: !297, line: 232, type: !476, isLocal: true, isDefinition: true)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 256, elements: !397)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "note", scope: !2, file: !297, line: 233, type: !476, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "putlookup", scope: !2, file: !365, line: 311, type: !481, isLocal: true, isDefinition: true)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 16384, elements: !370)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "gbcpu_put_fn", file: !338, line: 99, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{null, !83, !87}
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "getlookup", scope: !2, file: !365, line: 52, type: !488, isLocal: true, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 16384, elements: !370)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "gbcpu_get_fn", file: !338, line: 100, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!83, !83}
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "ops", scope: !2, file: !365, line: 1474, type: !495, isLocal: true, isDefinition: true)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !496, size: 16384, elements: !370)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opinfo", file: !365, line: 31, size: 64, elements: !498)
!498 = !{!499}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !497, file: !365, line: 32, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{null, !83, !503}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "cbops", scope: !2, file: !365, line: 851, type: !506, isLocal: true, isDefinition: true)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !496, size: 512, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 8)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "playercode", scope: !2, file: !511, line: 27, type: !512, isLocal: true, isDefinition: true)
!511 = !DIFile(filename: "/home/wslee/benchmarks/sound/gbsplay-0.0.91/gbs.c", directory: "")
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 1016, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 127)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "soundbuf", scope: !2, file: !311, line: 55, type: !151, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "impbuf", scope: !2, file: !311, line: 56, type: !151, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "impulse_w_shift", scope: !2, file: !311, line: 81, type: !15, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "sound_div_tc", scope: !2, file: !311, line: 72, type: !70, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "rombank", scope: !2, file: !311, line: 25, type: !15, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "dutylookup", scope: !2, file: !311, line: 28, type: !527, isLocal: true, isDefinition: true)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 32, elements: !397)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "tap1", scope: !2, file: !311, line: 66, type: !83, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "tap2", scope: !2, file: !311, line: 67, type: !83, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "lfsr", scope: !2, file: !311, line: 68, type: !83, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "base_impulse", scope: !2, file: !311, line: 84, type: !89, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "impulse_n_shift", scope: !2, file: !311, line: 80, type: !15, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "impulse_cutoff", scope: !2, file: !311, line: 82, type: !91, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "pause_output", scope: !2, file: !311, line: 51, type: !15, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "vblankctr", scope: !2, file: !311, line: 43, type: !15, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "timerctr", scope: !2, file: !311, line: 45, type: !15, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression(DW_OP_constu, 32, DW_OP_stack_value))
!547 = distinct !DIGlobalVariable(name: "main_div_tc", scope: !2, file: !311, line: 73, type: !312, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression(DW_OP_constu, 256, DW_OP_stack_value))
!549 = distinct !DIGlobalVariable(name: "sweep_div_tc", scope: !2, file: !311, line: 75, type: !312, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "main_div", scope: !2, file: !311, line: 74, type: !15, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "ch3pos", scope: !2, file: !311, line: 78, type: !15, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "val___1", scope: !2, file: !311, line: 511, type: !15, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "old_l", scope: !2, file: !311, line: 449, type: !15, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "old_r", scope: !2, file: !311, line: 449, type: !15, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "sweep_div", scope: !2, file: !311, line: 76, type: !15, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "timertc", scope: !2, file: !311, line: 44, type: !15, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "fd___0", scope: !2, file: !317, line: 24, type: !14, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "redraw", scope: !2, file: !451, line: 74, type: !15, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "cfgfile", scope: !2, file: !451, line: 76, type: !570, isLocal: true, isDefinition: true)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 88, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 11)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "options", scope: !2, file: !451, line: 94, type: !575, isLocal: true, isDefinition: true)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 2112, elements: !571)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cfg_option", file: !578, line: 14, size: 192, elements: !579)
!578 = !DIFile(filename: "/home/wslee/benchmarks/sound/gbsplay-0.0.91/cfgparser.h", directory: "")
!579 = !{!580, !581, !582}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !577, file: !578, line: 15, baseType: !16, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !577, file: !578, line: 16, baseType: !23, size: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "parse_fn", scope: !577, file: !578, line: 17, baseType: !583, size: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !23}
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "loopmode", scope: !2, file: !451, line: 64, type: !15, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "myname___0", scope: !2, file: !451, line: 49, type: !16, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "playmode", scope: !2, file: !451, line: 63, type: !15, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "sound_io", scope: !2, file: !451, line: 82, type: !288, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "sound_write", scope: !2, file: !451, line: 83, type: !291, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "sound_description", scope: !2, file: !451, line: 79, type: !16, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "notelookup", scope: !2, file: !451, line: 44, type: !600, isLocal: true, isDefinition: true)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 3456, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 432)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "vollookup", scope: !2, file: !451, line: 45, type: !605, isLocal: true, isDefinition: true)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 640, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 80)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "vols", scope: !2, file: !451, line: 46, type: !610, isLocal: true, isDefinition: true)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 40, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 5)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "endian", scope: !2, file: !451, line: 65, type: !5, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "rate", scope: !2, file: !451, line: 67, type: !15, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(name: "sound_name", scope: !2, file: !451, line: 78, type: !16, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "subsong_start", scope: !2, file: !451, line: 71, type: !15, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "subsong_stop", scope: !2, file: !451, line: 72, type: !15, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "subsong_timeout", scope: !2, file: !451, line: 73, type: !15, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "silence_timeout", scope: !2, file: !451, line: 68, type: !15, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "subsong_gap", scope: !2, file: !451, line: 70, type: !15, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "fadeout", scope: !2, file: !451, line: 69, type: !15, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "subsong_playlist", scope: !2, file: !451, line: 52, type: !21, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "subsong_playlist_idx", scope: !2, file: !451, line: 53, type: !15, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "buf", scope: !2, file: !451, line: 87, type: !152, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "samples", scope: !2, file: !451, line: 86, type: !639, isLocal: true, isDefinition: true)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 65536, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 4096)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "quit", scope: !2, file: !451, line: 50, type: !15, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "refresh_delay", scope: !2, file: !451, line: 60, type: !15, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "verbosity", scope: !2, file: !451, line: 66, type: !15, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "buf___0", scope: !2, file: !451, line: 146, type: !650, isLocal: true, isDefinition: true)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 40, elements: !611)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "pause_mode", scope: !2, file: !451, line: 54, type: !15, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "plugouts", scope: !2, file: !655, line: 35, type: !656, isLocal: true, isDefinition: true)
!655 = !DIFile(filename: "/home/wslee/benchmarks/sound/gbsplay-0.0.91/plugout.c", directory: "")
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 256, elements: !397)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "output_plugin_const_t", file: !655, line: 33, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!659 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!660 = !{i32 2, !"Dwarf Version", i32 4}
!661 = !{i32 2, !"Debug Info Version", i32 3}
!662 = !{i32 1, !"wchar_size", i32 4}
!663 = !{i32 7, !"PIC Level", i32 2}
!664 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!665 = distinct !DISubprogram(name: "cfg_endian", scope: !323, file: !323, line: 72, type: !584, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !666)
!666 = !{}
!667 = !DILocalVariable(name: "ptr", arg: 1, scope: !665, file: !323, line: 72, type: !23)
!668 = !DILocation(line: 0, scope: !665)
!669 = !DILocalVariable(name: "__cil_tmp5", scope: !665, file: !323, line: 77, type: !16)
!670 = !DILocation(line: 77, column: 9, scope: !665)
!671 = !DILocation(line: 74, column: 16, scope: !672)
!672 = distinct !DILexicalBlock(scope: !673, file: !323, line: 80, column: 3)
!673 = distinct !DILexicalBlock(scope: !665, file: !323, line: 79, column: 3)
!674 = !DILocalVariable(name: "endian___1", scope: !665, file: !323, line: 74, type: !13)
!675 = !DILocation(line: 76, column: 23, scope: !676)
!676 = distinct !DILexicalBlock(scope: !672, file: !323, line: 75, column: 3)
!677 = !DILocation(line: 76, column: 17, scope: !676)
!678 = !DILocation(line: 76, column: 9, scope: !676)
!679 = !DILocalVariable(name: "tmp", scope: !665, file: !323, line: 75, type: !14)
!680 = !DILocation(line: 76, column: 7, scope: !672)
!681 = !DILocation(line: 76, column: 5, scope: !672)
!682 = !DILocation(line: 77, column: 7, scope: !683)
!683 = distinct !DILexicalBlock(scope: !673, file: !323, line: 77, column: 7)
!684 = !DILocation(line: 77, column: 9, scope: !683)
!685 = !DILocation(line: 77, column: 7, scope: !673)
!686 = !DILocation(line: 77, column: 9, scope: !687)
!687 = distinct !DILexicalBlock(scope: !688, file: !323, line: 77, column: 9)
!688 = distinct !DILexicalBlock(scope: !683, file: !323, line: 77, column: 17)
!689 = !DILocation(line: 77, column: 11, scope: !687)
!690 = !DILocation(line: 77, column: 9, scope: !688)
!691 = !DILocation(line: 77, column: 11, scope: !692)
!692 = distinct !DILexicalBlock(scope: !693, file: !323, line: 77, column: 11)
!693 = distinct !DILexicalBlock(scope: !687, file: !323, line: 77, column: 20)
!694 = !DILocation(line: 77, column: 13, scope: !692)
!695 = !DILocation(line: 77, column: 11, scope: !693)
!696 = !DILocation(line: 78, column: 9, scope: !697)
!697 = distinct !DILexicalBlock(scope: !698, file: !323, line: 79, column: 9)
!698 = distinct !DILexicalBlock(scope: !699, file: !323, line: 78, column: 9)
!699 = distinct !DILexicalBlock(scope: !692, file: !323, line: 77, column: 22)
!700 = !DILocation(line: 79, column: 9, scope: !699)
!701 = !DILocation(line: 81, column: 5, scope: !693)
!702 = !DILocation(line: 82, column: 3, scope: !688)
!703 = !DILocation(line: 83, column: 7, scope: !704)
!704 = distinct !DILexicalBlock(scope: !705, file: !323, line: 83, column: 7)
!705 = distinct !DILexicalBlock(scope: !673, file: !323, line: 83, column: 3)
!706 = !DILocation(line: 83, column: 9, scope: !704)
!707 = !DILocation(line: 83, column: 7, scope: !705)
!708 = !DILocation(line: 83, column: 5, scope: !709)
!709 = distinct !DILexicalBlock(scope: !704, file: !323, line: 83, column: 17)
!710 = !DILocation(line: 84, column: 7, scope: !711)
!711 = distinct !DILexicalBlock(scope: !705, file: !323, line: 84, column: 7)
!712 = !DILocation(line: 84, column: 9, scope: !711)
!713 = !DILocation(line: 84, column: 7, scope: !705)
!714 = !DILocation(line: 84, column: 5, scope: !715)
!715 = distinct !DILexicalBlock(scope: !711, file: !323, line: 84, column: 18)
!716 = !DILocation(line: 85, column: 3, scope: !705)
!717 = !DILocation(line: 83, column: 15, scope: !705)
!718 = !DILocation(line: 83, column: 3, scope: !705)
!719 = !DILocation(line: 84, column: 15, scope: !705)
!720 = !DILocation(line: 84, column: 3, scope: !705)
!721 = !DILocation(line: 85, column: 15, scope: !705)
!722 = !DILocation(line: 88, column: 13, scope: !723)
!723 = distinct !DILexicalBlock(scope: !724, file: !323, line: 89, column: 3)
!724 = distinct !DILexicalBlock(scope: !673, file: !323, line: 88, column: 3)
!725 = !DILocalVariable(name: "tmp___0", scope: !665, file: !323, line: 76, type: !17)
!726 = !DILocation(line: 88, column: 7, scope: !724)
!727 = !DILocation(line: 88, column: 5, scope: !724)
!728 = !DILocation(line: 89, column: 9, scope: !724)
!729 = !DILocation(line: 90, column: 13, scope: !724)
!730 = !DILocation(line: 91, column: 3, scope: !673)
!731 = !DILocation(line: 93, column: 1, scope: !665)
!732 = distinct !DISubprogram(name: "err_expect", scope: !323, file: !323, line: 63, type: !733, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !666)
!733 = !DISubroutineType(types: !734)
!734 = !{null, !16}
!735 = !DILocalVariable(name: "s", arg: 1, scope: !732, file: !323, line: 63, type: !16)
!736 = !DILocation(line: 0, scope: !732)
!737 = !DILocalVariable(name: "__cil_tmp4", scope: !732, file: !323, line: 67, type: !16)
!738 = !DILocation(line: 67, column: 9, scope: !732)
!739 = !DILocation(line: 65, column: 9, scope: !740)
!740 = distinct !DILexicalBlock(scope: !741, file: !323, line: 71, column: 3)
!741 = distinct !DILexicalBlock(scope: !742, file: !323, line: 70, column: 3)
!742 = distinct !DILexicalBlock(scope: !732, file: !323, line: 69, column: 3)
!743 = !DILocalVariable(name: "tmp", scope: !732, file: !323, line: 65, type: !16)
!744 = !DILocation(line: 65, column: 36, scope: !745)
!745 = distinct !DILexicalBlock(scope: !741, file: !323, line: 67, column: 3)
!746 = !DILocation(line: 66, column: 11, scope: !745)
!747 = !DILocation(line: 66, column: 21, scope: !745)
!748 = !DILocation(line: 66, column: 31, scope: !745)
!749 = !DILocation(line: 65, column: 3, scope: !745)
!750 = !DILocation(line: 67, column: 13, scope: !751)
!751 = distinct !DILexicalBlock(scope: !741, file: !323, line: 68, column: 3)
!752 = !DILocalVariable(name: "tmp___0", scope: !732, file: !323, line: 66, type: !17)
!753 = !DILocation(line: 67, column: 7, scope: !741)
!754 = !DILocation(line: 67, column: 5, scope: !741)
!755 = !DILocation(line: 68, column: 9, scope: !741)
!756 = !DILocation(line: 69, column: 13, scope: !741)
!757 = !DILocation(line: 70, column: 3, scope: !742)
!758 = distinct !DISubprogram(name: "nextchar", scope: !323, file: !323, line: 26, type: !759, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !666)
!759 = !DISubroutineType(types: !760)
!760 = !{!17}
!761 = !DILocalVariable(name: "__cil_tmp3", scope: !758, file: !323, line: 30, type: !16)
!762 = !DILocation(line: 30, column: 9, scope: !758)
!763 = !DILocalVariable(name: "__cil_tmp4", scope: !758, file: !323, line: 31, type: !16)
!764 = !DILocation(line: 31, column: 9, scope: !758)
!765 = !DILocalVariable(name: "__cil_tmp5", scope: !758, file: !323, line: 32, type: !16)
!766 = !DILocation(line: 32, column: 9, scope: !758)
!767 = !DILocation(line: 30, column: 26, scope: !768)
!768 = distinct !DILexicalBlock(scope: !769, file: !323, line: 30, column: 7)
!769 = distinct !DILexicalBlock(scope: !758, file: !323, line: 34, column: 3)
!770 = !DILocation(line: 30, column: 10, scope: !768)
!771 = !DILocation(line: 30, column: 35, scope: !768)
!772 = !DILocation(line: 30, column: 7, scope: !769)
!773 = !DILocation(line: 30, column: 5, scope: !774)
!774 = distinct !DILexicalBlock(scope: !775, file: !323, line: 32, column: 5)
!775 = distinct !DILexicalBlock(scope: !776, file: !323, line: 31, column: 5)
!776 = distinct !DILexicalBlock(scope: !768, file: !323, line: 30, column: 68)
!777 = !DILocation(line: 32, column: 3, scope: !778)
!778 = distinct !DILexicalBlock(scope: !779, file: !323, line: 36, column: 3)
!779 = distinct !DILexicalBlock(scope: !769, file: !323, line: 35, column: 3)
!780 = !DILocation(line: 32, column: 13, scope: !778)
!781 = !DILocation(line: 33, column: 17, scope: !782)
!782 = distinct !DILexicalBlock(scope: !783, file: !323, line: 36, column: 5)
!783 = distinct !DILexicalBlock(scope: !784, file: !323, line: 35, column: 5)
!784 = distinct !DILexicalBlock(scope: !778, file: !323, line: 32, column: 13)
!785 = !DILocation(line: 33, column: 11, scope: !782)
!786 = !DILocalVariable(name: "tmp", scope: !758, file: !323, line: 29, type: !14)
!787 = !DILocation(line: 0, scope: !758)
!788 = !DILocation(line: 33, column: 13, scope: !783)
!789 = !DILocalVariable(name: "c___3", scope: !758, file: !323, line: 28, type: !15)
!790 = !DILocation(line: 33, column: 15, scope: !791)
!791 = distinct !DILexicalBlock(scope: !784, file: !323, line: 33, column: 9)
!792 = !DILocation(line: 33, column: 9, scope: !784)
!793 = !DILocation(line: 33, column: 7, scope: !794)
!794 = distinct !DILexicalBlock(scope: !791, file: !323, line: 33, column: 23)
!795 = !DILocation(line: 35, column: 15, scope: !796)
!796 = distinct !DILexicalBlock(scope: !784, file: !323, line: 35, column: 9)
!797 = !DILocation(line: 35, column: 9, scope: !784)
!798 = !DILocation(line: 36, column: 16, scope: !799)
!799 = distinct !DILexicalBlock(scope: !796, file: !323, line: 35, column: 23)
!800 = !DILocation(line: 37, column: 16, scope: !799)
!801 = !DILocation(line: 38, column: 5, scope: !799)
!802 = !DILocation(line: 38, column: 16, scope: !803)
!803 = distinct !DILexicalBlock(scope: !796, file: !323, line: 38, column: 12)
!804 = !DILocation(line: 41, column: 9, scope: !805)
!805 = distinct !DILexicalBlock(scope: !806, file: !323, line: 41, column: 9)
!806 = distinct !DILexicalBlock(scope: !784, file: !323, line: 40, column: 5)
!807 = !DILocation(line: 41, column: 24, scope: !805)
!808 = !DILocation(line: 41, column: 9, scope: !806)
!809 = !DILocation(line: 41, column: 7, scope: !810)
!810 = distinct !DILexicalBlock(scope: !805, file: !323, line: 41, column: 31)
!811 = !DILocation(line: 45, column: 9, scope: !812)
!812 = distinct !DILexicalBlock(scope: !806, file: !323, line: 45, column: 9)
!813 = !DILocation(line: 45, column: 24, scope: !812)
!814 = !DILocation(line: 45, column: 9, scope: !806)
!815 = !DILocation(line: 45, column: 7, scope: !816)
!816 = distinct !DILexicalBlock(scope: !812, file: !323, line: 45, column: 31)
!817 = !DILocation(line: 49, column: 9, scope: !818)
!818 = distinct !DILexicalBlock(scope: !806, file: !323, line: 49, column: 9)
!819 = !DILocation(line: 49, column: 24, scope: !818)
!820 = !DILocation(line: 49, column: 9, scope: !806)
!821 = !DILocation(line: 49, column: 7, scope: !822)
!822 = distinct !DILexicalBlock(scope: !818, file: !323, line: 49, column: 31)
!823 = !DILocation(line: 40, column: 5, scope: !806)
!824 = !DILocation(line: 42, column: 15, scope: !825)
!825 = distinct !DILexicalBlock(scope: !806, file: !323, line: 42, column: 9)
!826 = !DILocation(line: 42, column: 9, scope: !806)
!827 = !DILocation(line: 42, column: 22, scope: !828)
!828 = distinct !DILexicalBlock(scope: !825, file: !323, line: 42, column: 23)
!829 = !DILocation(line: 43, column: 5, scope: !828)
!830 = !DILocation(line: 43, column: 15, scope: !831)
!831 = distinct !DILexicalBlock(scope: !825, file: !323, line: 43, column: 9)
!832 = !DILocation(line: 43, column: 9, scope: !825)
!833 = !DILocation(line: 43, column: 22, scope: !834)
!834 = distinct !DILexicalBlock(scope: !831, file: !323, line: 43, column: 23)
!835 = !DILocation(line: 44, column: 5, scope: !834)
!836 = !DILocation(line: 44, column: 5, scope: !806)
!837 = !DILocation(line: 46, column: 20, scope: !806)
!838 = !DILocation(line: 47, column: 15, scope: !839)
!839 = distinct !DILexicalBlock(scope: !806, file: !323, line: 47, column: 9)
!840 = !DILocation(line: 47, column: 9, scope: !806)
!841 = !DILocation(line: 48, column: 5, scope: !842)
!842 = distinct !DILexicalBlock(scope: !839, file: !323, line: 47, column: 24)
!843 = !DILocation(line: 0, scope: !784)
!844 = !DILocation(line: 48, column: 5, scope: !806)
!845 = !DILocation(line: 50, column: 15, scope: !846)
!846 = distinct !DILexicalBlock(scope: !806, file: !323, line: 50, column: 9)
!847 = !DILocation(line: 50, column: 9, scope: !806)
!848 = !DILocation(line: 50, column: 22, scope: !849)
!849 = distinct !DILexicalBlock(scope: !846, file: !323, line: 50, column: 22)
!850 = !DILocation(line: 51, column: 5, scope: !849)
!851 = !DILocation(line: 50, column: 15, scope: !852)
!852 = distinct !DILexicalBlock(scope: !846, file: !323, line: 50, column: 9)
!853 = !DILocation(line: 50, column: 9, scope: !846)
!854 = !DILocation(line: 50, column: 22, scope: !855)
!855 = distinct !DILexicalBlock(scope: !852, file: !323, line: 50, column: 23)
!856 = !DILocation(line: 51, column: 5, scope: !855)
!857 = !DILocation(line: 51, column: 5, scope: !806)
!858 = !DILocation(line: 32, column: 12, scope: !859)
!859 = distinct !DILexicalBlock(scope: !784, file: !323, line: 32, column: 9)
!860 = !DILocation(line: 32, column: 27, scope: !859)
!861 = !DILocation(line: 32, column: 9, scope: !784)
!862 = !DILocation(line: 32, column: 7, scope: !863)
!863 = distinct !DILexicalBlock(scope: !859, file: !323, line: 32, column: 35)
!864 = distinct !{!864, !777, !865}
!865 = !DILocation(line: 34, column: 3, scope: !778)
!866 = !DILocation(line: 36, column: 3, scope: !778)
!867 = !DILocation(line: 55, column: 11, scope: !769)
!868 = !DILocation(line: 55, column: 3, scope: !769)
!869 = !DILocation(line: 0, scope: !769)
!870 = !DILocation(line: 57, column: 1, scope: !758)
!871 = distinct !DISubprogram(name: "cfg_string", scope: !323, file: !323, line: 93, type: !584, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !666)
!872 = !DILocalVariable(name: "ptr", arg: 1, scope: !871, file: !323, line: 93, type: !23)
!873 = !DILocation(line: 0, scope: !871)
!874 = !DILocalVariable(name: "s", scope: !871, file: !323, line: 95, type: !875)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 1600, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 200)
!878 = !DILocation(line: 95, column: 8, scope: !871)
!879 = !DILocalVariable(name: "__cil_tmp8", scope: !871, file: !323, line: 101, type: !23)
!880 = !DILocation(line: 101, column: 9, scope: !871)
!881 = !DILocalVariable(name: "__cil_tmp9", scope: !871, file: !323, line: 102, type: !16)
!882 = !DILocation(line: 102, column: 9, scope: !871)
!883 = !DILocalVariable(name: "n", scope: !871, file: !323, line: 96, type: !22)
!884 = !DILocation(line: 98, column: 9, scope: !885)
!885 = distinct !DILexicalBlock(scope: !886, file: !323, line: 97, column: 3)
!886 = distinct !DILexicalBlock(scope: !887, file: !323, line: 105, column: 3)
!887 = distinct !DILexicalBlock(scope: !871, file: !323, line: 104, column: 3)
!888 = !DILocalVariable(name: "tmp", scope: !871, file: !323, line: 97, type: !889)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!892 = !DILocation(line: 98, column: 26, scope: !893)
!893 = distinct !DILexicalBlock(scope: !887, file: !323, line: 98, column: 7)
!894 = !DILocation(line: 98, column: 39, scope: !893)
!895 = !DILocation(line: 98, column: 33, scope: !893)
!896 = !DILocation(line: 98, column: 31, scope: !893)
!897 = !DILocation(line: 98, column: 24, scope: !893)
!898 = !DILocation(line: 98, column: 10, scope: !893)
!899 = !DILocation(line: 98, column: 42, scope: !893)
!900 = !DILocation(line: 98, column: 7, scope: !887)
!901 = !DILocation(line: 98, column: 9, scope: !902)
!902 = distinct !DILexicalBlock(scope: !903, file: !323, line: 98, column: 9)
!903 = distinct !DILexicalBlock(scope: !893, file: !323, line: 98, column: 51)
!904 = !DILocation(line: 98, column: 11, scope: !902)
!905 = !DILocation(line: 98, column: 9, scope: !903)
!906 = !DILocation(line: 98, column: 11, scope: !907)
!907 = distinct !DILexicalBlock(scope: !908, file: !323, line: 98, column: 11)
!908 = distinct !DILexicalBlock(scope: !902, file: !323, line: 98, column: 19)
!909 = !DILocation(line: 98, column: 13, scope: !907)
!910 = !DILocation(line: 98, column: 11, scope: !908)
!911 = !DILocation(line: 99, column: 9, scope: !912)
!912 = distinct !DILexicalBlock(scope: !913, file: !323, line: 100, column: 9)
!913 = distinct !DILexicalBlock(scope: !914, file: !323, line: 99, column: 9)
!914 = distinct !DILexicalBlock(scope: !907, file: !323, line: 98, column: 21)
!915 = !DILocation(line: 100, column: 9, scope: !914)
!916 = !DILocation(line: 102, column: 5, scope: !908)
!917 = !DILocation(line: 103, column: 3, scope: !903)
!918 = !DILocation(line: 102, column: 3, scope: !919)
!919 = distinct !DILexicalBlock(scope: !920, file: !323, line: 105, column: 3)
!920 = distinct !DILexicalBlock(scope: !887, file: !323, line: 104, column: 3)
!921 = !DILocation(line: 0, scope: !887)
!922 = !DILocation(line: 102, column: 13, scope: !919)
!923 = !DILocalVariable(name: "tmp___0", scope: !871, file: !323, line: 98, type: !22)
!924 = !DILocation(line: 103, column: 7, scope: !925)
!925 = distinct !DILexicalBlock(scope: !926, file: !323, line: 105, column: 5)
!926 = distinct !DILexicalBlock(scope: !919, file: !323, line: 102, column: 13)
!927 = !DILocation(line: 103, column: 25, scope: !925)
!928 = !DILocation(line: 103, column: 18, scope: !925)
!929 = !DILocation(line: 103, column: 5, scope: !925)
!930 = !DILocation(line: 103, column: 16, scope: !925)
!931 = !DILocation(line: 104, column: 15, scope: !932)
!932 = distinct !DILexicalBlock(scope: !925, file: !323, line: 104, column: 5)
!933 = !DILocalVariable(name: "tmp___1", scope: !871, file: !323, line: 99, type: !17)
!934 = !DILocation(line: 104, column: 9, scope: !925)
!935 = !DILocation(line: 104, column: 7, scope: !925)
!936 = !DILocation(line: 102, column: 15, scope: !937)
!937 = distinct !DILexicalBlock(scope: !925, file: !323, line: 105, column: 5)
!938 = !DILocalVariable(name: "tmp___2", scope: !871, file: !323, line: 100, type: !889)
!939 = !DILocation(line: 102, column: 25, scope: !940)
!940 = distinct !DILexicalBlock(scope: !926, file: !323, line: 102, column: 9)
!941 = !DILocation(line: 102, column: 42, scope: !940)
!942 = !DILocation(line: 102, column: 36, scope: !940)
!943 = !DILocation(line: 102, column: 34, scope: !940)
!944 = !DILocation(line: 102, column: 23, scope: !940)
!945 = !DILocation(line: 102, column: 9, scope: !940)
!946 = !DILocation(line: 102, column: 45, scope: !940)
!947 = !DILocation(line: 102, column: 9, scope: !926)
!948 = !DILocation(line: 102, column: 7, scope: !949)
!949 = distinct !DILexicalBlock(scope: !940, file: !323, line: 102, column: 50)
!950 = !DILocation(line: 102, column: 9, scope: !951)
!951 = distinct !DILexicalBlock(scope: !940, file: !323, line: 102, column: 9)
!952 = !DILocation(line: 102, column: 11, scope: !951)
!953 = !DILocation(line: 102, column: 7, scope: !954)
!954 = distinct !DILexicalBlock(scope: !951, file: !323, line: 102, column: 19)
!955 = !DILocation(line: 102, column: 9, scope: !956)
!956 = distinct !DILexicalBlock(scope: !951, file: !323, line: 102, column: 9)
!957 = !DILocation(line: 102, column: 11, scope: !956)
!958 = !DILocation(line: 102, column: 19, scope: !956)
!959 = !DILocation(line: 102, column: 16, scope: !960)
!960 = distinct !DILexicalBlock(scope: !961, file: !323, line: 102, column: 11)
!961 = distinct !DILexicalBlock(scope: !956, file: !323, line: 102, column: 19)
!962 = !DILocation(line: 102, column: 11, scope: !961)
!963 = !DILocation(line: 102, column: 9, scope: !964)
!964 = distinct !DILexicalBlock(scope: !960, file: !323, line: 102, column: 36)
!965 = !DILocation(line: 104, column: 5, scope: !961)
!966 = !DILocation(line: 102, column: 7, scope: !967)
!967 = distinct !DILexicalBlock(scope: !956, file: !323, line: 104, column: 12)
!968 = distinct !{!968, !918, !969}
!969 = !DILocation(line: 104, column: 3, scope: !919)
!970 = !DILocation(line: 106, column: 3, scope: !919)
!971 = !DILocation(line: 107, column: 3, scope: !972)
!972 = distinct !DILexicalBlock(scope: !887, file: !323, line: 109, column: 3)
!973 = !DILocation(line: 107, column: 8, scope: !972)
!974 = !DILocation(line: 109, column: 44, scope: !975)
!975 = distinct !DILexicalBlock(scope: !972, file: !323, line: 108, column: 3)
!976 = !DILocation(line: 109, column: 21, scope: !975)
!977 = !DILocation(line: 109, column: 5, scope: !975)
!978 = !DILocation(line: 109, column: 19, scope: !975)
!979 = !DILocation(line: 111, column: 9, scope: !972)
!980 = !DILocation(line: 112, column: 13, scope: !972)
!981 = !DILocation(line: 113, column: 3, scope: !887)
!982 = !DILocation(line: 115, column: 1, scope: !871)
!983 = distinct !DISubprogram(name: "cfg_long", scope: !323, file: !323, line: 115, type: !584, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !666)
!984 = !DILocalVariable(name: "ptr", arg: 1, scope: !983, file: !323, line: 115, type: !23)
!985 = !DILocation(line: 0, scope: !983)
!986 = !DILocalVariable(name: "num", scope: !983, file: !323, line: 117, type: !987)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 160, elements: !988)
!988 = !{!989}
!989 = !DISubrange(count: 20)
!990 = !DILocation(line: 117, column: 8, scope: !983)
!991 = !DILocalVariable(name: "__cil_tmp9", scope: !983, file: !323, line: 124, type: !23)
!992 = !DILocation(line: 124, column: 9, scope: !983)
!993 = !DILocalVariable(name: "__cil_tmp10", scope: !983, file: !323, line: 125, type: !16)
!994 = !DILocation(line: 125, column: 9, scope: !983)
!995 = !DILocalVariable(name: "n", scope: !983, file: !323, line: 118, type: !22)
!996 = !DILocation(line: 120, column: 9, scope: !997)
!997 = distinct !DILexicalBlock(scope: !998, file: !323, line: 119, column: 3)
!998 = distinct !DILexicalBlock(scope: !999, file: !323, line: 128, column: 3)
!999 = distinct !DILexicalBlock(scope: !983, file: !323, line: 127, column: 3)
!1000 = !DILocalVariable(name: "tmp", scope: !983, file: !323, line: 119, type: !889)
!1001 = !DILocation(line: 120, column: 26, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !999, file: !323, line: 120, column: 7)
!1003 = !DILocation(line: 120, column: 39, scope: !1002)
!1004 = !DILocation(line: 120, column: 33, scope: !1002)
!1005 = !DILocation(line: 120, column: 31, scope: !1002)
!1006 = !DILocation(line: 120, column: 24, scope: !1002)
!1007 = !DILocation(line: 120, column: 10, scope: !1002)
!1008 = !DILocation(line: 120, column: 42, scope: !1002)
!1009 = !DILocation(line: 120, column: 7, scope: !999)
!1010 = !DILocation(line: 121, column: 5, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1012, file: !323, line: 122, column: 5)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !323, line: 121, column: 5)
!1013 = distinct !DILexicalBlock(scope: !1002, file: !323, line: 120, column: 51)
!1014 = !DILocation(line: 122, column: 5, scope: !1013)
!1015 = !DILocation(line: 124, column: 3, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1017, file: !323, line: 125, column: 3)
!1017 = distinct !DILexicalBlock(scope: !999, file: !323, line: 124, column: 3)
!1018 = !DILocation(line: 0, scope: !999)
!1019 = !DILocation(line: 124, column: 13, scope: !1016)
!1020 = !DILocalVariable(name: "tmp___0", scope: !983, file: !323, line: 120, type: !22)
!1021 = !DILocation(line: 125, column: 7, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !323, line: 127, column: 5)
!1023 = distinct !DILexicalBlock(scope: !1016, file: !323, line: 124, column: 13)
!1024 = !DILocation(line: 125, column: 27, scope: !1022)
!1025 = !DILocation(line: 125, column: 20, scope: !1022)
!1026 = !DILocation(line: 125, column: 5, scope: !1022)
!1027 = !DILocation(line: 125, column: 18, scope: !1022)
!1028 = !DILocation(line: 126, column: 15, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1022, file: !323, line: 126, column: 5)
!1030 = !DILocalVariable(name: "tmp___1", scope: !983, file: !323, line: 121, type: !17)
!1031 = !DILocation(line: 126, column: 9, scope: !1022)
!1032 = !DILocation(line: 126, column: 7, scope: !1022)
!1033 = !DILocation(line: 124, column: 15, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1022, file: !323, line: 127, column: 5)
!1035 = !DILocalVariable(name: "tmp___2", scope: !983, file: !323, line: 122, type: !889)
!1036 = !DILocation(line: 124, column: 25, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1023, file: !323, line: 124, column: 9)
!1038 = !DILocation(line: 124, column: 42, scope: !1037)
!1039 = !DILocation(line: 124, column: 36, scope: !1037)
!1040 = !DILocation(line: 124, column: 34, scope: !1037)
!1041 = !DILocation(line: 124, column: 23, scope: !1037)
!1042 = !DILocation(line: 124, column: 9, scope: !1037)
!1043 = !DILocation(line: 124, column: 45, scope: !1037)
!1044 = !DILocation(line: 124, column: 9, scope: !1023)
!1045 = !DILocation(line: 124, column: 16, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !323, line: 124, column: 11)
!1047 = distinct !DILexicalBlock(scope: !1037, file: !323, line: 124, column: 53)
!1048 = !DILocation(line: 124, column: 11, scope: !1047)
!1049 = !DILocation(line: 124, column: 9, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1046, file: !323, line: 124, column: 38)
!1051 = !DILocation(line: 126, column: 5, scope: !1047)
!1052 = !DILocation(line: 124, column: 7, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1037, file: !323, line: 126, column: 12)
!1054 = distinct !{!1054, !1015, !1055}
!1055 = !DILocation(line: 126, column: 3, scope: !1016)
!1056 = !DILocation(line: 128, column: 3, scope: !1016)
!1057 = !DILocation(line: 129, column: 3, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !999, file: !323, line: 131, column: 3)
!1059 = !DILocation(line: 129, column: 10, scope: !1058)
!1060 = !DILocation(line: 131, column: 34, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1058, file: !323, line: 130, column: 3)
!1062 = !DILocation(line: 131, column: 13, scope: !1061)
!1063 = !DILocalVariable(name: "tmp___3", scope: !983, file: !323, line: 123, type: !14)
!1064 = !DILocation(line: 131, column: 20, scope: !1058)
!1065 = !DILocation(line: 131, column: 5, scope: !1058)
!1066 = !DILocation(line: 131, column: 18, scope: !1058)
!1067 = !DILocation(line: 133, column: 9, scope: !1058)
!1068 = !DILocation(line: 134, column: 13, scope: !1058)
!1069 = !DILocation(line: 135, column: 3, scope: !999)
!1070 = !DILocation(line: 137, column: 1, scope: !983)
!1071 = distinct !DISubprogram(name: "cfg_parse", scope: !323, file: !323, line: 137, type: !1072, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !666)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{null, !18, !1074}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!1075 = !DILocalVariable(name: "fname", arg: 1, scope: !1071, file: !323, line: 137, type: !18)
!1076 = !DILocation(line: 0, scope: !1071)
!1077 = !DILocalVariable(name: "options___1", arg: 2, scope: !1071, file: !323, line: 137, type: !1074)
!1078 = !DILocalVariable(name: "option", scope: !1071, file: !323, line: 140, type: !875)
!1079 = !DILocation(line: 140, column: 8, scope: !1071)
!1080 = !DILocalVariable(name: "__cil_tmp19", scope: !1071, file: !323, line: 155, type: !23)
!1081 = !DILocation(line: 155, column: 9, scope: !1071)
!1082 = !DILocalVariable(name: "__cil_tmp20", scope: !1071, file: !323, line: 156, type: !16)
!1083 = !DILocation(line: 156, column: 9, scope: !1071)
!1084 = !DILocalVariable(name: "__cil_tmp21", scope: !1071, file: !323, line: 157, type: !16)
!1085 = !DILocation(line: 157, column: 9, scope: !1071)
!1086 = !DILocalVariable(name: "__cil_tmp22", scope: !1071, file: !323, line: 158, type: !16)
!1087 = !DILocation(line: 158, column: 9, scope: !1071)
!1088 = !DILocalVariable(name: "__cil_tmp23", scope: !1071, file: !323, line: 159, type: !16)
!1089 = !DILocation(line: 159, column: 9, scope: !1071)
!1090 = !DILocation(line: 139, column: 12, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1092, file: !323, line: 162, column: 3)
!1092 = distinct !DILexicalBlock(scope: !1071, file: !323, line: 161, column: 3)
!1093 = !DILocation(line: 140, column: 14, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1091, file: !323, line: 140, column: 3)
!1095 = !DILocation(line: 140, column: 12, scope: !1094)
!1096 = !DILocation(line: 141, column: 23, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1092, file: !323, line: 141, column: 7)
!1098 = !DILocation(line: 141, column: 7, scope: !1097)
!1099 = !DILocation(line: 141, column: 32, scope: !1097)
!1100 = !DILocation(line: 141, column: 7, scope: !1092)
!1101 = !DILocation(line: 141, column: 5, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1097, file: !323, line: 141, column: 64)
!1103 = !DILocation(line: 143, column: 18, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1092, file: !323, line: 143, column: 3)
!1105 = !DILocation(line: 144, column: 9, scope: !1104)
!1106 = !DILocation(line: 145, column: 13, scope: !1104)
!1107 = !DILocation(line: 146, column: 12, scope: !1104)
!1108 = !DILocation(line: 147, column: 12, scope: !1104)
!1109 = !DILocation(line: 148, column: 9, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1104, file: !323, line: 148, column: 3)
!1111 = !DILocalVariable(name: "tmp", scope: !1071, file: !323, line: 139, type: !17)
!1112 = !DILocation(line: 148, column: 7, scope: !1104)
!1113 = !DILocation(line: 148, column: 5, scope: !1104)
!1114 = !DILocation(line: 150, column: 3, scope: !1104)
!1115 = !DILocation(line: 150, column: 13, scope: !1104)
!1116 = !DILocalVariable(name: "tmp___0", scope: !1071, file: !323, line: 141, type: !7)
!1117 = !DILocation(line: 150, column: 3, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1119, file: !323, line: 153, column: 3)
!1119 = distinct !DILexicalBlock(scope: !1092, file: !323, line: 152, column: 3)
!1120 = !DILocation(line: 0, scope: !1092)
!1121 = !DILocation(line: 150, column: 13, scope: !1118)
!1122 = !DILocation(line: 150, column: 17, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1124, file: !323, line: 150, column: 9)
!1124 = distinct !DILexicalBlock(scope: !1118, file: !323, line: 150, column: 13)
!1125 = !DILocation(line: 150, column: 9, scope: !1124)
!1126 = !DILocation(line: 150, column: 7, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1123, file: !323, line: 150, column: 26)
!1128 = !DILocation(line: 150, column: 5, scope: !1124)
!1129 = !DILocation(line: 150, column: 21, scope: !1124)
!1130 = !DILocation(line: 150, column: 13, scope: !1124)
!1131 = distinct !{!1131, !1117, !1132}
!1132 = !DILocation(line: 151, column: 3, scope: !1118)
!1133 = !DILocation(line: 153, column: 3, scope: !1118)
!1134 = !DILocation(line: 151, column: 3, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1136, file: !323, line: 157, column: 3)
!1136 = distinct !DILexicalBlock(scope: !1092, file: !323, line: 156, column: 3)
!1137 = !DILocation(line: 151, column: 13, scope: !1135)
!1138 = !DILocation(line: 154, column: 9, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1140, file: !323, line: 154, column: 9)
!1140 = distinct !DILexicalBlock(scope: !1141, file: !323, line: 154, column: 5)
!1141 = distinct !DILexicalBlock(scope: !1135, file: !323, line: 151, column: 13)
!1142 = !DILocation(line: 154, column: 15, scope: !1139)
!1143 = !DILocation(line: 154, column: 9, scope: !1140)
!1144 = !DILocation(line: 154, column: 7, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1139, file: !323, line: 154, column: 22)
!1146 = !DILocation(line: 159, column: 9, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1140, file: !323, line: 159, column: 9)
!1148 = !DILocation(line: 159, column: 15, scope: !1147)
!1149 = !DILocation(line: 159, column: 9, scope: !1140)
!1150 = !DILocation(line: 159, column: 7, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1147, file: !323, line: 159, column: 22)
!1152 = !DILocation(line: 176, column: 9, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1140, file: !323, line: 176, column: 9)
!1154 = !DILocation(line: 176, column: 15, scope: !1153)
!1155 = !DILocation(line: 176, column: 9, scope: !1140)
!1156 = !DILocation(line: 176, column: 7, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1153, file: !323, line: 176, column: 22)
!1158 = !DILocation(line: 185, column: 9, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1140, file: !323, line: 185, column: 9)
!1160 = !DILocation(line: 185, column: 15, scope: !1159)
!1161 = !DILocation(line: 185, column: 9, scope: !1140)
!1162 = !DILocation(line: 185, column: 7, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1159, file: !323, line: 185, column: 22)
!1164 = !DILocation(line: 153, column: 5, scope: !1140)
!1165 = !DILocation(line: 155, column: 15, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1167, file: !323, line: 156, column: 5)
!1167 = distinct !DILexicalBlock(scope: !1140, file: !323, line: 155, column: 5)
!1168 = !DILocalVariable(name: "tmp___3", scope: !1071, file: !323, line: 145, type: !889)
!1169 = !DILocation(line: 155, column: 25, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1140, file: !323, line: 155, column: 9)
!1171 = !DILocation(line: 155, column: 42, scope: !1170)
!1172 = !DILocation(line: 155, column: 36, scope: !1170)
!1173 = !DILocation(line: 155, column: 34, scope: !1170)
!1174 = !DILocation(line: 155, column: 23, scope: !1170)
!1175 = !DILocation(line: 155, column: 9, scope: !1170)
!1176 = !DILocation(line: 155, column: 45, scope: !1170)
!1177 = !DILocation(line: 155, column: 9, scope: !1140)
!1178 = !DILocation(line: 156, column: 7, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1180, file: !323, line: 157, column: 7)
!1180 = distinct !DILexicalBlock(scope: !1181, file: !323, line: 156, column: 7)
!1181 = distinct !DILexicalBlock(scope: !1170, file: !323, line: 155, column: 53)
!1182 = !DILocation(line: 156, column: 17, scope: !1179)
!1183 = !DILocation(line: 156, column: 19, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1185, file: !323, line: 160, column: 9)
!1185 = distinct !DILexicalBlock(scope: !1186, file: !323, line: 159, column: 9)
!1186 = distinct !DILexicalBlock(scope: !1179, file: !323, line: 156, column: 17)
!1187 = !DILocalVariable(name: "tmp___1", scope: !1071, file: !323, line: 143, type: !889)
