; ModuleID = '/tmp/tmp.ll'
source_filename = "c/gzip-spec2000.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i32, [44 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.ct_data = type { %union.__anonunion_fc_11, %union.__anonunion_dl_12 }
%union.__anonunion_fc_11 = type { i16 }
%union.__anonunion_dl_12 = type { i16 }
%struct.tree_desc = type { %struct.ct_data*, %struct.ct_data*, i32*, i32, i32, i32, i32 }
%struct.spec_fd_t = type { i32, i32, i32, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.config = type { i16, i16, i16, i16 }
%struct.stat = type { i64, i16, i64, i32, i32, i32, i32, i64, i16, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, i64, i64 }
%struct.timespec = type { i64, i64 }
%struct.huft = type { i8, i8, %union.__anonunion_v_18 }
%union.__anonunion_v_18 = type { %struct.huft* }

@ifd = common global i32 0, align 4, !dbg !0
@ofd = common global i32 0, align 4, !dbg !237
@outcnt = common global i32 0, align 4, !dbg !231
@method = global i32 8, align 4, !dbg !192
@.str = private unnamed_addr constant [3 x i8] c"\1F\8B\00", align 1
@outbuf = common global [18432 x i8] zeroinitializer, align 16, !dbg !226

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ifd", scope: !2, file: !7, line: 157, type: !11, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !139, nameTableKind: GNU)
!3 = !DIFile(filename: "c/gzip-spec2000.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !9, !11, !12, !14, !15, !13, !16, !17, !19, !18, !20, !21, !23, !25, !26, !78, !80, !81, !82, !83, !10, !85, !86, !87, !8, !88, !99, !100, !136, !138}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uch", file: !7, line: 59, baseType: !8)
!7 = !DIFile(filename: "/local/sparrow_test/test/SPEC2000/CINT2000/164.gzip/src/gzip.h", directory: "")
!8 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ush", file: !7, line: 60, baseType: !10)
!10 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ulg", file: !7, line: 61, baseType: !13)
!13 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!15 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidp", file: !7, line: 29, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 213, baseType: !16)
!24 = !DIFile(filename: "/usr/lib/gcc-lib/i486-linux/3.3.5/include/stddef.h", directory: "")
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !28, line: 46, baseType: !29)
!28 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !30, line: 264, size: 1728, elements: !31)
!30 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !52, !53, !54, !55, !58, !59, !61, !65, !68, !71, !72, !73, !74}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !29, file: !30, line: 265, baseType: !11, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !29, file: !30, line: 266, baseType: !19, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !29, file: !30, line: 267, baseType: !19, size: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !29, file: !30, line: 268, baseType: !19, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !29, file: !30, line: 269, baseType: !19, size: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !29, file: !30, line: 270, baseType: !19, size: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !29, file: !30, line: 271, baseType: !19, size: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !29, file: !30, line: 272, baseType: !19, size: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !29, file: !30, line: 273, baseType: !19, size: 64, offset: 512)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !29, file: !30, line: 274, baseType: !19, size: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !29, file: !30, line: 275, baseType: !19, size: 64, offset: 640)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !29, file: !30, line: 276, baseType: !19, size: 64, offset: 704)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !29, file: !30, line: 277, baseType: !45, size: 64, offset: 768)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !30, line: 179, size: 192, elements: !47)
!47 = !{!48, !49, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !46, file: !30, line: 180, baseType: !45, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !46, file: !30, line: 181, baseType: !50, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !46, file: !30, line: 182, baseType: !11, size: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !29, file: !30, line: 278, baseType: !50, size: 64, offset: 832)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !29, file: !30, line: 279, baseType: !11, size: 32, offset: 896)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !29, file: !30, line: 280, baseType: !11, size: 32, offset: 928)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !29, file: !30, line: 281, baseType: !56, size: 64, offset: 960)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !57, line: 143, baseType: !15)
!57 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !29, file: !30, line: 282, baseType: !10, size: 16, offset: 1024)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !29, file: !30, line: 283, baseType: !60, size: 8, offset: 1040)
!60 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !29, file: !30, line: 284, baseType: !62, size: 8, offset: 1048)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 1)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !29, file: !30, line: 285, baseType: !66, size: 64, offset: 1088)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !30, line: 173, baseType: null)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !29, file: !30, line: 286, baseType: !69, size: 64, offset: 1152)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !57, line: 144, baseType: !70)
!70 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !29, file: !30, line: 287, baseType: !18, size: 64, offset: 1216)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !29, file: !30, line: 288, baseType: !18, size: 64, offset: 1280)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !29, file: !30, line: 289, baseType: !11, size: 32, offset: 1344)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !29, file: !30, line: 290, baseType: !75, size: 352, offset: 1376)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 352, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 44)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "code_int", file: !79, line: 29, baseType: !15)
!79 = !DIFile(filename: "/local/sparrow_test/test/SPEC2000/CINT2000/164.gzip/src/unlzw.c", directory: "")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", file: !79, line: 28, baseType: !8)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmp_code_int", file: !79, line: 32, baseType: !13)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!85 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!86 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "huft", file: !90, line: 121, size: 128, elements: !91)
!90 = !DIFile(filename: "/local/sparrow_test/test/SPEC2000/CINT2000/164.gzip/src/inflate.c", directory: "")
!91 = !{!92, !93, !94}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !89, file: !90, line: 122, baseType: !6, size: 8)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !89, file: !90, line: 123, baseType: !6, size: 8, offset: 8)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !89, file: !90, line: 124, baseType: !95, size: 64, offset: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_v_18", file: !90, line: 121, size: 64, elements: !96)
!96 = !{!97, !98}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !95, file: !90, line: 122, baseType: !9, size: 16)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !95, file: !90, line: 123, baseType: !88, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !102, line: 36, size: 1152, elements: !103)
!102 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!103 = !{!104, !107, !108, !110, !112, !114, !116, !118, !119, !120, !121, !123, !125, !132, !133, !134, !135}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !101, file: !102, line: 37, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !57, line: 136, baseType: !106)
!106 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !101, file: !102, line: 38, baseType: !10, size: 16, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !101, file: !102, line: 39, baseType: !109, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !57, line: 139, baseType: !13)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !101, file: !102, line: 40, baseType: !111, size: 32, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !57, line: 141, baseType: !16)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !101, file: !102, line: 41, baseType: !113, size: 32, offset: 224)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !57, line: 142, baseType: !16)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !101, file: !102, line: 42, baseType: !115, size: 32, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !57, line: 137, baseType: !16)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !101, file: !102, line: 43, baseType: !117, size: 32, offset: 288)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !57, line: 138, baseType: !16)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !101, file: !102, line: 44, baseType: !105, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !101, file: !102, line: 45, baseType: !10, size: 16, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !101, file: !102, line: 46, baseType: !56, size: 64, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !101, file: !102, line: 47, baseType: !122, size: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !57, line: 166, baseType: !15)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !101, file: !102, line: 48, baseType: !124, size: 64, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !57, line: 171, baseType: !15)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !101, file: !102, line: 49, baseType: !126, size: 128, offset: 640)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !127, line: 118, size: 128, elements: !128)
!127 = !DIFile(filename: "/usr/include/time.h", directory: "")
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !126, file: !127, line: 119, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !57, line: 151, baseType: !15)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !126, file: !127, line: 120, baseType: !15, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !101, file: !102, line: 50, baseType: !126, size: 128, offset: 768)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !101, file: !102, line: 51, baseType: !126, size: 128, offset: 896)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__unused4", scope: !101, file: !102, line: 52, baseType: !13, size: 64, offset: 1024)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__unused5", scope: !101, file: !102, line: 53, baseType: !13, size: 64, offset: 1088)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPos", file: !137, line: 129, baseType: !16)
!137 = !DIFile(filename: "/local/sparrow_test/test/SPEC2000/CINT2000/164.gzip/src/deflate.c", directory: "")
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pos", file: !137, line: 128, baseType: !9)
!139 = !{!140, !146, !149, !151, !153, !156, !161, !163, !165, !168, !170, !172, !174, !176, !178, !180, !182, !184, !186, !188, !190, !192, !194, !196, !198, !200, !202, !204, !206, !219, !224, !226, !231, !233, !235, !0, !237, !239, !244, !246, !248, !251, !256, !261, !263, !265, !267, !269, !271, !273, !275, !278, !280, !283, !288, !290, !292, !294, !296, !298, !303, !306, !309, !328, !333, !338, !343, !348, !350, !355, !360, !363, !368, !370, !372, !374, !376, !378, !380, !382, !384, !386, !388, !390, !392, !394, !396, !407, !409, !411, !413, !415, !417, !419, !421, !423, !428, !430, !432, !437, !439, !441, !443, !445, !447, !449, !451, !453, !455, !457, !461, !463, !465, !467, !469, !471, !473, !475, !480, !483, !485, !487, !492, !494, !496, !499, !502, !515, !517, !519, !522, !524, !527, !530, !532, !535, !537, !540, !542, !554, !556}
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "crc_32_tab", scope: !2, file: !142, line: 409, type: !143, isLocal: false, isDefinition: true)
!142 = !DIFile(filename: "/local/sparrow_test/test/SPEC2000/CINT2000/164.gzip/src/util.c", directory: "")
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 16384, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 256)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "pkzip", scope: !2, file: !148, line: 44, type: !11, isLocal: false, isDefinition: true)
!148 = !DIFile(filename: "/local/sparrow_test/test/SPEC2000/CINT2000/164.gzip/src/unzip.c", directory: "")
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "ext_header", scope: !2, file: !148, line: 45, type: !11, isLocal: false, isDefinition: true)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "block_mode", scope: !2, file: !79, line: 181, type: !11, isLocal: false, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "dbglvl", scope: !2, file: !155, line: 30, type: !11, isLocal: false, isDefinition: true)
!155 = !DIFile(filename: "/local/sparrow_test/test/SPEC2000/CINT2000/164.gzip/src/spec.c", directory: "")
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "mask_bits", scope: !2, file: !90, line: 209, type: !158, isLocal: false, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 272, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 17)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "lbits", scope: !2, file: !90, line: 259, type: !11, isLocal: false, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "dbits", scope: !2, file: !90, line: 260, type: !11, isLocal: false, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "ascii", scope: !2, file: !167, line: 211, type: !11, isLocal: false, isDefinition: true)
!167 = !DIFile(filename: "/local/sparrow_test/test/SPEC2000/CINT2000/164.gzip/src/gzip.c", directory: "")
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "to_stdout", scope: !2, file: !167, line: 212, type: !11, isLocal: false, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "decompress", scope: !2, file: !167, line: 213, type: !11, isLocal: false, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "force", scope: !2, file: !167, line: 214, type: !11, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "no_name", scope: !2, file: !167, line: 215, type: !11, isLocal: false, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "no_time", scope: !2, file: !167, line: 216, type: !11, isLocal: false, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "recursive", scope: !2, file: !167, line: 217, type: !11, isLocal: false, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "list", scope: !2, file: !167, line: 218, type: !11, isLocal: false, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !167, line: 219, type: !11, isLocal: false, isDefinition: true)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "quiet", scope: !2, file: !167, line: 220, type: !11, isLocal: false, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "do_lzw", scope: !2, file: !167, line: 221, type: !11, isLocal: false, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "test", scope: !2, file: !167, line: 222, type: !11, isLocal: false, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "maxbits", scope: !2, file: !167, line: 225, type: !11, isLocal: false, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "method", scope: !2, file: !167, line: 226, type: !11, isLocal: false, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "level", scope: !2, file: !167, line: 227, type: !11, isLocal: false, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "exit_code", scope: !2, file: !167, line: 228, type: !11, isLocal: false, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "args", scope: !2, file: !167, line: 235, type: !25, isLocal: false, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "total_in", scope: !2, file: !167, line: 241, type: !15, isLocal: false, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "total_out", scope: !2, file: !167, line: 242, type: !15, isLocal: false, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "remove_ofname", scope: !2, file: !167, line: 245, type: !11, isLocal: false, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !167, line: 253, type: !208, isLocal: false, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 6144, elements: !217)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !210, line: 77, size: 256, elements: !211)
!210 = !DIFile(filename: "/local/sparrow_test/test/SPEC2000/CINT2000/164.gzip/src/getopt.h", directory: "")
!211 = !{!212, !213, !214, !216}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !209, file: !210, line: 78, baseType: !21, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !209, file: !210, line: 79, baseType: !11, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !209, file: !210, line: 80, baseType: !215, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !209, file: !210, line: 81, baseType: !11, size: 32, offset: 192)
!217 = !{!218}
!218 = !DISubrange(count: 24)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "work", scope: !2, file: !167, line: 306, type: !221, isLocal: false, isDefinition: true)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!11, !11, !11}
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "window_size", scope: !2, file: !137, line: 154, type: !12, isLocal: false, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "outbuf", scope: !2, file: !7, line: 131, type: !228, isLocal: false, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 147456, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 18432)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "outcnt", scope: !2, file: !7, line: 148, type: !16, isLocal: false, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "bytes_in", scope: !2, file: !7, line: 150, type: !15, isLocal: false, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "header_bytes", scope: !2, file: !7, line: 152, type: !15, isLocal: false, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "ofd", scope: !2, file: !7, line: 158, type: !11, isLocal: false, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "ifname", scope: !2, file: !7, line: 159, type: !241, isLocal: false, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8192, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 1024)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "time_stamp", scope: !2, file: !7, line: 163, type: !15, isLocal: false, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "save_orig_name", scope: !2, file: !7, line: 215, type: !11, isLocal: false, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "crc", scope: !2, file: !250, line: 25, type: !12, isLocal: true, isDefinition: true)
!250 = !DIFile(filename: "/local/sparrow_test/test/SPEC2000/CINT2000/164.gzip/src/zip.c", directory: "")
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "inbuf", scope: !2, file: !7, line: 130, type: !253, isLocal: false, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 262656, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 32832)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "window", scope: !2, file: !7, line: 133, type: !258, isLocal: false, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 524288, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 65536)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "insize", scope: !2, file: !7, line: 146, type: !16, isLocal: false, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "inptr", scope: !2, file: !7, line: 147, type: !16, isLocal: false, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "bytes_out", scope: !2, file: !7, line: 151, type: !15, isLocal: false, isDefinition: true)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "ofname", scope: !2, file: !7, line: 160, type: !241, isLocal: false, isDefinition: true)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "progname", scope: !2, file: !7, line: 161, type: !19, isLocal: false, isDefinition: true)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "decrypt", scope: !2, file: !7, line: 208, type: !11, isLocal: false, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "key", scope: !2, file: !148, line: 43, type: !19, isLocal: false, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "orig_len", scope: !2, file: !277, line: 32, type: !12, isLocal: true, isDefinition: true)
!277 = !DIFile(filename: "/local/sparrow_test/test/SPEC2000/CINT2000/164.gzip/src/unpack.c", directory: "")
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "max_len", scope: !2, file: !277, line: 33, type: !11, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "literal", scope: !2, file: !277, line: 35, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 2048, elements: !144)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "lit_base", scope: !2, file: !277, line: 40, type: !285, isLocal: true, isDefinition: true)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 832, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 26)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "leaves", scope: !2, file: !277, line: 46, type: !285, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "parents", scope: !2, file: !277, line: 47, type: !285, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "peek_bits", scope: !2, file: !277, line: 49, type: !11, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "bitbuf", scope: !2, file: !277, line: 64, type: !12, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "valid", scope: !2, file: !277, line: 67, type: !11, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "d_buf", scope: !2, file: !7, line: 132, type: !300, isLocal: false, isDefinition: true)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 524288, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 32768)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "prev", scope: !2, file: !7, line: 138, type: !305, isLocal: false, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1048576, elements: !259)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "done", scope: !2, file: !308, line: 328, type: !11, isLocal: true, isDefinition: true)
!308 = !DIFile(filename: "/local/sparrow_test/test/SPEC2000/CINT2000/164.gzip/src/unlzh.c", directory: "")
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "dyn_ltree", scope: !2, file: !311, line: 179, type: !312, isLocal: true, isDefinition: true)
!311 = !DIFile(filename: "/local/sparrow_test/test/SPEC2000/CINT2000/164.gzip/src/trees.c", directory: "")
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 18336, elements: !326)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "ct_data", file: !311, line: 160, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ct_data", file: !311, line: 160, size: 32, elements: !315)
!315 = !{!316, !321}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !314, file: !311, line: 161, baseType: !317, size: 16)
!317 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_fc_11", file: !311, line: 160, size: 16, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !317, file: !311, line: 161, baseType: !9, size: 16)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !317, file: !311, line: 162, baseType: !9, size: 16)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !314, file: !311, line: 162, baseType: !322, size: 16, offset: 16)
!322 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_dl_12", file: !311, line: 160, size: 16, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "dad", scope: !322, file: !311, line: 161, baseType: !9, size: 16)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !322, file: !311, line: 162, baseType: !9, size: 16)
!326 = !{!327}
!327 = !DISubrange(count: 573)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "dyn_dtree", scope: !2, file: !311, line: 180, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 1952, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 61)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "static_ltree", scope: !2, file: !311, line: 182, type: !335, isLocal: true, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 9216, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 288)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "static_dtree", scope: !2, file: !311, line: 189, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 960, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 30)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "bl_count", scope: !2, file: !311, line: 217, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 256, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 16)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "length_code", scope: !2, file: !311, line: 236, type: !282, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "dist_code", scope: !2, file: !311, line: 239, type: !352, isLocal: true, isDefinition: true)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 4096, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 512)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "base_length", scope: !2, file: !311, line: 245, type: !357, isLocal: true, isDefinition: true)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 928, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 29)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "base_dist", scope: !2, file: !311, line: 248, type: !362, isLocal: true, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 960, elements: !341)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "flag_buf", scope: !2, file: !311, line: 256, type: !365, isLocal: true, isDefinition: true)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 32768, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 4096)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "last_lit", scope: !2, file: !311, line: 261, type: !16, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "last_dist", scope: !2, file: !311, line: 262, type: !16, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "last_flags", scope: !2, file: !311, line: 263, type: !16, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "flags", scope: !2, file: !311, line: 264, type: !6, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "flag_bit", scope: !2, file: !311, line: 265, type: !6, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "opt_len", scope: !2, file: !311, line: 271, type: !12, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "static_len", scope: !2, file: !311, line: 272, type: !12, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "compressed_len", scope: !2, file: !311, line: 274, type: !12, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "input_len", scope: !2, file: !311, line: 276, type: !12, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "file_type", scope: !2, file: !311, line: 279, type: !99, isLocal: false, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "file_method", scope: !2, file: !311, line: 280, type: !215, isLocal: false, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "block_start", scope: !2, file: !137, line: 159, type: !15, isLocal: false, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "strstart", scope: !2, file: !137, line: 178, type: !16, isLocal: false, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "ifile_size", scope: !2, file: !7, line: 164, type: !15, isLocal: false, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "spec_fd", scope: !2, file: !155, line: 45, type: !398, isLocal: false, isDefinition: true)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 576, elements: !405)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spec_fd_t", file: !155, line: 45, size: 192, elements: !400)
!400 = !{!401, !402, !403, !404}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !399, file: !155, line: 46, baseType: !11, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !399, file: !155, line: 47, baseType: !11, size: 32, offset: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !399, file: !155, line: 48, baseType: !11, size: 32, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !399, file: !155, line: 49, baseType: !87, size: 64, offset: 128)
!405 = !{!406}
!406 = !DISubrange(count: 3)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "seedi", scope: !2, file: !155, line: 52, type: !15, isLocal: false, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "part_nb", scope: !2, file: !167, line: 231, type: !11, isLocal: false, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "bb", scope: !2, file: !90, line: 206, type: !12, isLocal: false, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "bk", scope: !2, file: !90, line: 207, type: !16, isLocal: false, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "hufts", scope: !2, file: !90, line: 268, type: !16, isLocal: false, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "foreground", scope: !2, file: !167, line: 223, type: !11, isLocal: false, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "last_member", scope: !2, file: !167, line: 230, type: !11, isLocal: false, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "env", scope: !2, file: !167, line: 234, type: !19, isLocal: false, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "z_suffix", scope: !2, file: !167, line: 236, type: !425, isLocal: false, isDefinition: true)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 248, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 31)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "z_len", scope: !2, file: !167, line: 237, type: !11, isLocal: false, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "istat", scope: !2, file: !167, line: 246, type: !101, isLocal: false, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "read_buf", scope: !2, file: !7, line: 308, type: !434, isLocal: false, isDefinition: true)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!11, !19, !16}
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "ins_h", scope: !2, file: !137, line: 164, type: !16, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "prev_length", scope: !2, file: !137, line: 173, type: !16, isLocal: false, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "match_start", scope: !2, file: !137, line: 179, type: !16, isLocal: false, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "eofile", scope: !2, file: !137, line: 180, type: !11, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "lookahead", scope: !2, file: !137, line: 181, type: !16, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "max_chain_length", scope: !2, file: !137, line: 183, type: !16, isLocal: false, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "max_lazy_match", scope: !2, file: !137, line: 188, type: !16, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "compr_level", scope: !2, file: !137, line: 199, type: !11, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "good_match", scope: !2, file: !137, line: 202, type: !16, isLocal: false, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "nice_match", scope: !2, file: !137, line: 222, type: !11, isLocal: false, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "zfile", scope: !2, file: !459, line: 70, type: !460, isLocal: true, isDefinition: true)
!459 = !DIFile(filename: "/local/sparrow_test/test/SPEC2000/CINT2000/164.gzip/src/bits.c", directory: "")
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "file_t", file: !7, line: 166, baseType: !11)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "crc___0", scope: !2, file: !142, line: 66, type: !12, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "bitbuf___0", scope: !2, file: !308, line: 105, type: !9, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "subbitbuf", scope: !2, file: !308, line: 106, type: !16, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "bitcount", scope: !2, file: !308, line: 107, type: !11, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "blocksize", scope: !2, file: !308, line: 92, type: !16, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "j", scope: !2, file: !308, line: 327, type: !11, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "i", scope: !2, file: !308, line: 351, type: !16, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "pt_len", scope: !2, file: !308, line: 91, type: !477, isLocal: true, isDefinition: true)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 152, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 19)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "pt_table", scope: !2, file: !308, line: 93, type: !482, isLocal: true, isDefinition: true)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4096, elements: !144)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "extra_lbits", scope: !2, file: !311, line: 94, type: !357, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "extra_dbits", scope: !2, file: !311, line: 97, type: !362, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "bl_tree", scope: !2, file: !311, line: 194, type: !489, isLocal: true, isDefinition: true)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 1248, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 39)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "heap_len", scope: !2, file: !311, line: 227, type: !11, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "heap_max", scope: !2, file: !311, line: 228, type: !11, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "heap", scope: !2, file: !311, line: 226, type: !498, isLocal: true, isDefinition: true)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 18336, elements: !326)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "depth", scope: !2, file: !311, line: 233, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 4584, elements: !326)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "l_desc", scope: !2, file: !311, line: 207, type: !504, isLocal: true, isDefinition: true)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree_desc", file: !311, line: 197, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_desc", file: !311, line: 197, size: 320, elements: !506)
!506 = !{!507, !509, !510, !511, !512, !513, !514}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_tree", scope: !505, file: !311, line: 198, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "static_tree", scope: !505, file: !311, line: 199, baseType: !508, size: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "extra_bits", scope: !505, file: !311, line: 200, baseType: !215, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "extra_base", scope: !505, file: !311, line: 201, baseType: !11, size: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !505, file: !311, line: 202, baseType: !11, size: 32, offset: 224)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "max_length", scope: !505, file: !311, line: 203, baseType: !11, size: 32, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "max_code", scope: !505, file: !311, line: 204, baseType: !11, size: 32, offset: 288)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "d_desc", scope: !2, file: !311, line: 210, type: !504, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "bl_desc", scope: !2, file: !311, line: 213, type: !504, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "extra_blbits", scope: !2, file: !311, line: 100, type: !521, isLocal: true, isDefinition: true)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 608, elements: !478)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "bl_order", scope: !2, file: !311, line: 220, type: !477, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "msg_done", scope: !2, file: !526, line: 13, type: !11, isLocal: true, isDefinition: true)
!526 = !DIFile(filename: "/local/sparrow_test/test/SPEC2000/CINT2000/164.gzip/src/lzw.c", directory: "")
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "cplens", scope: !2, file: !90, line: 158, type: !529, isLocal: true, isDefinition: true)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 496, elements: !426)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "cplext", scope: !2, file: !90, line: 162, type: !529, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "cpdist", scope: !2, file: !90, line: 165, type: !534, isLocal: true, isDefinition: true)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 480, elements: !341)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "cpdext", scope: !2, file: !90, line: 169, type: !534, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "border", scope: !2, file: !90, line: 156, type: !539, isLocal: true, isDefinition: true)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 608, elements: !478)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "in_exit", scope: !2, file: !167, line: 1730, type: !11, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "configuration_table", scope: !2, file: !137, line: 225, type: !544, isLocal: true, isDefinition: true)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 640, elements: !552)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "config", file: !137, line: 212, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "config", file: !137, line: 212, size: 64, elements: !547)
!547 = !{!548, !549, !550, !551}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "good_length", scope: !546, file: !137, line: 213, baseType: !9, size: 16)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "max_lazy", scope: !546, file: !137, line: 214, baseType: !9, size: 16, offset: 16)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "nice_length", scope: !546, file: !137, line: 215, baseType: !9, size: 16, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "max_chain", scope: !546, file: !137, line: 216, baseType: !9, size: 16, offset: 48)
!552 = !{!553}
!553 = !DISubrange(count: 10)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "bi_buf", scope: !2, file: !459, line: 72, type: !10, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "bi_valid", scope: !2, file: !459, line: 82, type: !11, isLocal: true, isDefinition: true)
!558 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!559 = !{i32 2, !"Dwarf Version", i32 4}
!560 = !{i32 2, !"Debug Info Version", i32 3}
!561 = !{i32 1, !"wchar_size", i32 4}
!562 = !{i32 7, !"PIC Level", i32 2}
!563 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!564 = distinct !DISubprogram(name: "zip", scope: !250, file: !250, line: 33, type: !222, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!565 = !DILocalVariable(name: "in", arg: 1, scope: !564, file: !250, line: 33, type: !11)
!566 = !DILocation(line: 0, scope: !564)
!567 = !DILocalVariable(name: "out", arg: 2, scope: !564, file: !250, line: 33, type: !11)
!568 = !DILocalVariable(name: "attr", scope: !564, file: !250, line: 36, type: !9)
!569 = !DILocation(line: 36, column: 7, scope: !564)
!570 = !DILocalVariable(name: "deflate_flags", scope: !564, file: !250, line: 37, type: !9)
!571 = !DILocation(line: 37, column: 7, scope: !564)
!572 = !DILocalVariable(name: "__cil_tmp40", scope: !564, file: !250, line: 72, type: !19)
!573 = !DILocation(line: 72, column: 9, scope: !564)
!574 = !DILocalVariable(name: "__cil_tmp41", scope: !564, file: !250, line: 73, type: !19)
!575 = !DILocation(line: 73, column: 9, scope: !564)
!576 = !DILocalVariable(name: "flags___0", scope: !564, file: !250, line: 35, type: !6)
!577 = !DILocation(line: 37, column: 8, scope: !578)
!578 = distinct !DILexicalBlock(scope: !564, file: !250, line: 75, column: 3)
!579 = !DILocation(line: 38, column: 17, scope: !578)
!580 = !DILocation(line: 40, column: 7, scope: !578)
!581 = !DILocation(line: 41, column: 7, scope: !578)
!582 = !DILocation(line: 42, column: 10, scope: !578)
!583 = !DILocation(line: 46, column: 10, scope: !578)
!584 = !DILocation(line: 47, column: 9, scope: !578)
!585 = !DILocalVariable(name: "tmp", scope: !564, file: !250, line: 38, type: !16)
!586 = !DILocation(line: 47, column: 10, scope: !578)
!587 = !DILocation(line: 47, column: 23, scope: !578)
!588 = !DILocation(line: 47, column: 3, scope: !578)
!589 = !DILocation(line: 47, column: 15, scope: !578)
!590 = !DILocation(line: 47, column: 7, scope: !591)
!591 = distinct !DILexicalBlock(scope: !578, file: !250, line: 47, column: 7)
!592 = !DILocation(line: 47, column: 14, scope: !591)
!593 = !DILocation(line: 47, column: 7, scope: !578)
!594 = !DILocation(line: 47, column: 5, scope: !595)
!595 = distinct !DILexicalBlock(scope: !596, file: !250, line: 49, column: 5)
!596 = distinct !DILexicalBlock(scope: !597, file: !250, line: 48, column: 5)
!597 = distinct !DILexicalBlock(scope: !591, file: !250, line: 47, column: 25)
!598 = !DILocation(line: 50, column: 3, scope: !597)
!599 = !DILocation(line: 48, column: 13, scope: !578)
!600 = !DILocalVariable(name: "tmp___0", scope: !564, file: !250, line: 39, type: !16)
!601 = !DILocation(line: 48, column: 10, scope: !578)
!602 = !DILocation(line: 48, column: 27, scope: !578)
!603 = !DILocation(line: 48, column: 3, scope: !578)
!604 = !DILocation(line: 48, column: 19, scope: !578)
!605 = !DILocation(line: 48, column: 7, scope: !606)
!606 = distinct !DILexicalBlock(scope: !578, file: !250, line: 48, column: 7)
!607 = !DILocation(line: 48, column: 14, scope: !606)
!608 = !DILocation(line: 48, column: 7, scope: !578)
!609 = !DILocation(line: 48, column: 5, scope: !610)
!610 = distinct !DILexicalBlock(scope: !611, file: !250, line: 50, column: 5)
