; ModuleID = '/tmp/tmp.ll'
source_filename = "c/id3ren-1.1b0.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.__anonstruct_FLAGS_struct_27 = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.ID3_struct = type { i8, [4 x i8], [31 x i8], [31 x i8], [31 x i8], [5 x i8], %union.__anonunion_u_23, i32 }
%union.__anonunion_u_23 = type { %struct.__anonstruct_v10_24 }
%struct.__anonstruct_v10_24 = type { [31 x i8] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.__anonstruct_v11_25 = type { [29 x i8], i8 }

@.str = private unnamed_addr constant [6 x i8] c"Blues\00", align 1
@.str.1 = private unnamed_addr constant [13 x i8] c"Classic Rock\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c"Country\00", align 1
@.str.3 = private unnamed_addr constant [6 x i8] c"Dance\00", align 1
@.str.4 = private unnamed_addr constant [6 x i8] c"Disco\00", align 1
@.str.5 = private unnamed_addr constant [5 x i8] c"Funk\00", align 1
@.str.6 = private unnamed_addr constant [7 x i8] c"Grunge\00", align 1
@.str.7 = private unnamed_addr constant [8 x i8] c"Hip-Hop\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "genre_table", scope: !2, file: !117, line: 25, type: !197, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !114, nameTableKind: GNU)
!3 = !DIFile(filename: "c/id3ren-1.1b0.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !8, !71, !58, !63, !73, !75, !15, !7, !76, !77, !113}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !10, line: 49, baseType: !11)
!10 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !12, line: 271, size: 1728, elements: !13)
!12 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!13 = !{!14, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !35, !36, !37, !38, !42, !44, !46, !50, !53, !57, !59, !60, !61, !62, !66, !67}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !11, file: !12, line: 272, baseType: !15, size: 32)
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !11, file: !12, line: 273, baseType: !6, size: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !11, file: !12, line: 274, baseType: !6, size: 64, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !11, file: !12, line: 275, baseType: !6, size: 64, offset: 192)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !11, file: !12, line: 276, baseType: !6, size: 64, offset: 256)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !11, file: !12, line: 277, baseType: !6, size: 64, offset: 320)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !11, file: !12, line: 278, baseType: !6, size: 64, offset: 384)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !11, file: !12, line: 279, baseType: !6, size: 64, offset: 448)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !11, file: !12, line: 280, baseType: !6, size: 64, offset: 512)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !11, file: !12, line: 281, baseType: !6, size: 64, offset: 576)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !11, file: !12, line: 282, baseType: !6, size: 64, offset: 640)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !11, file: !12, line: 283, baseType: !6, size: 64, offset: 704)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !11, file: !12, line: 284, baseType: !28, size: 64, offset: 768)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !12, line: 186, size: 192, elements: !30)
!30 = !{!31, !32, !34}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !29, file: !12, line: 187, baseType: !28, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !29, file: !12, line: 188, baseType: !33, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !29, file: !12, line: 189, baseType: !15, size: 32, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !11, file: !12, line: 285, baseType: !33, size: 64, offset: 832)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !11, file: !12, line: 286, baseType: !15, size: 32, offset: 896)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !11, file: !12, line: 287, baseType: !15, size: 32, offset: 928)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !11, file: !12, line: 288, baseType: !39, size: 64, offset: 960)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !40, line: 141, baseType: !41)
!40 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!41 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !11, file: !12, line: 289, baseType: !43, size: 16, offset: 1024)
!43 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !11, file: !12, line: 290, baseType: !45, size: 8, offset: 1040)
!45 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !11, file: !12, line: 291, baseType: !47, size: 8, offset: 1048)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 1)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !11, file: !12, line: 292, baseType: !51, size: 64, offset: 1088)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !12, line: 180, baseType: null)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !11, file: !12, line: 293, baseType: !54, size: 64, offset: 1152)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !40, line: 142, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !40, line: 56, baseType: !56)
!56 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !11, file: !12, line: 294, baseType: !58, size: 64, offset: 1216)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !11, file: !12, line: 295, baseType: !58, size: 64, offset: 1280)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !11, file: !12, line: 296, baseType: !58, size: 64, offset: 1344)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !11, file: !12, line: 297, baseType: !58, size: 64, offset: 1408)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !11, file: !12, line: 298, baseType: !63, size: 32, offset: 1472)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !64, line: 211, baseType: !65)
!64 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!65 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !11, file: !12, line: 299, baseType: !15, size: 32, offset: 1504)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !11, file: !12, line: 300, baseType: !68, size: 192, offset: 1536)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 24)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!75 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!76 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID3_tag", file: !79, line: 34, baseType: !80)
!79 = !DIFile(filename: "/home/wslee/benchmarks/sound/id3ren-1.1b0/src/id3file.h", directory: "")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID3_struct", file: !79, line: 34, size: 1120, elements: !81)
!81 = !{!82, !83, !87, !91, !92, !93, !97, !112}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !80, file: !79, line: 35, baseType: !7, size: 8)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !80, file: !79, line: 36, baseType: !84, size: 32, offset: 8)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 4)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "songname", scope: !80, file: !79, line: 37, baseType: !88, size: 248, offset: 40)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 248, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 31)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "artist", scope: !80, file: !79, line: 38, baseType: !88, size: 248, offset: 288)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "album", scope: !80, file: !79, line: 39, baseType: !88, size: 248, offset: 536)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !80, file: !79, line: 40, baseType: !94, size: 40, offset: 784)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 40, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 5)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !80, file: !79, line: 41, baseType: !98, size: 248, offset: 824)
!98 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_u_23", file: !79, line: 34, size: 248, elements: !99)
!99 = !{!100, !104}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "v10", scope: !98, file: !79, line: 35, baseType: !101, size: 248)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_v10_24", file: !79, line: 34, size: 248, elements: !102)
!102 = !{!103}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !101, file: !79, line: 35, baseType: !88, size: 248)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "v11", scope: !98, file: !79, line: 36, baseType: !105, size: 240)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_v11_25", file: !79, line: 34, size: 240, elements: !106)
!106 = !{!107, !111}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !105, file: !79, line: 35, baseType: !108, size: 232)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 232, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 29)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !105, file: !79, line: 36, baseType: !7, size: 8, offset: 232)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "genre", scope: !80, file: !79, line: 42, baseType: !15, size: 32, offset: 1088)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !40, line: 139, baseType: !65)
!114 = !{!0, !115, !119, !125, !128, !130, !132, !134, !136, !138, !140, !142, !144, !167, !172, !174, !176, !178, !183, !185, !187, !190, !192}
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "genre_count", scope: !2, file: !117, line: 155, type: !118, isLocal: false, isDefinition: true)
!117 = !DIFile(filename: "/home/wslee/benchmarks/sound/id3ren-1.1b0/src/id3genre.h", directory: "")
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "logfile", scope: !2, file: !121, line: 37, type: !122, isLocal: false, isDefinition: true)
!121 = !DIFile(filename: "/home/wslee/benchmarks/sound/id3ren-1.1b0/src/id3file.c", directory: "")
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 88, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 11)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "def_artist", scope: !2, file: !127, line: 50, type: !6, isLocal: false, isDefinition: true)
!127 = !DIFile(filename: "/home/wslee/benchmarks/sound/id3ren-1.1b0/src/id3ren.c", directory: "")
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "def_song", scope: !2, file: !127, line: 51, type: !6, isLocal: false, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "def_album", scope: !2, file: !127, line: 52, type: !6, isLocal: false, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "def_year", scope: !2, file: !127, line: 53, type: !6, isLocal: false, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "def_comment", scope: !2, file: !127, line: 54, type: !6, isLocal: false, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "def_genre", scope: !2, file: !127, line: 55, type: !15, isLocal: false, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "def_track", scope: !2, file: !127, line: 56, type: !7, isLocal: false, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "def_field", scope: !2, file: !127, line: 57, type: !6, isLocal: false, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "copyfp", scope: !2, file: !127, line: 60, type: !8, isLocal: false, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "flags", scope: !2, file: !127, line: 62, type: !146, isLocal: false, isDefinition: true)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLAGS_struct", file: !147, line: 56, baseType: !148)
!147 = !DIFile(filename: "/home/wslee/benchmarks/sound/id3ren-1.1b0/src/id3ren.h", directory: "")
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_FLAGS_struct_27", file: !147, line: 56, size: 272, elements: !149)
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "logging", scope: !148, file: !147, line: 57, baseType: !76, size: 16)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "no_tag_prompt", scope: !148, file: !147, line: 58, baseType: !76, size: 16, offset: 16)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "no_config", scope: !148, file: !147, line: 59, baseType: !76, size: 16, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !148, file: !147, line: 60, baseType: !76, size: 16, offset: 48)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !148, file: !147, line: 61, baseType: !76, size: 16, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "show_tag", scope: !148, file: !147, line: 62, baseType: !76, size: 16, offset: 80)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tag_ffn", scope: !148, file: !147, line: 63, baseType: !76, size: 16, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "strip_tag", scope: !148, file: !147, line: 64, baseType: !76, size: 16, offset: 112)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "force_tag", scope: !148, file: !147, line: 65, baseType: !76, size: 16, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "tag_only", scope: !148, file: !147, line: 66, baseType: !76, size: 16, offset: 144)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "edit_tag", scope: !148, file: !147, line: 67, baseType: !76, size: 16, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "no_year", scope: !148, file: !147, line: 68, baseType: !76, size: 16, offset: 176)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "no_album", scope: !148, file: !147, line: 69, baseType: !76, size: 16, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "no_comment", scope: !148, file: !147, line: 70, baseType: !76, size: 16, offset: 208)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "no_genre", scope: !148, file: !147, line: 71, baseType: !76, size: 16, offset: 224)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "no_track", scope: !148, file: !147, line: 72, baseType: !76, size: 16, offset: 240)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ulcase", scope: !148, file: !147, line: 73, baseType: !76, size: 16, offset: 256)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "filename_template", scope: !2, file: !127, line: 81, type: !169, isLocal: false, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 256)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "tag_template", scope: !2, file: !127, line: 87, type: !169, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "program_name", scope: !2, file: !127, line: 90, type: !6, isLocal: false, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "program_path", scope: !2, file: !127, line: 91, type: !6, isLocal: false, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "replace_spacechar", scope: !2, file: !127, line: 94, type: !180, isLocal: false, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 32)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "replace_char", scope: !2, file: !127, line: 96, type: !6, isLocal: false, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "remove_char", scope: !2, file: !127, line: 97, type: !6, isLocal: false, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "ptrtag", scope: !2, file: !189, line: 51, type: !77, isLocal: false, isDefinition: true)
!189 = !DIFile(filename: "/home/wslee/benchmarks/sound/id3ren-1.1b0/src/id3tag.c", directory: "")
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "copytag", scope: !2, file: !127, line: 59, type: !78, isLocal: false, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "applied_filename", scope: !2, file: !127, line: 100, type: !194, isLocal: false, isDefinition: true)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 4096, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 512)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 8064, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 126)
!200 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!201 = !{i32 2, !"Dwarf Version", i32 4}
!202 = !{i32 2, !"Debug Info Version", i32 3}
!203 = !{i32 1, !"wchar_size", i32 4}
!204 = !{i32 7, !"PIC Level", i32 2}
!205 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!206 = distinct !DISubprogram(name: "add_to_log", scope: !121, file: !121, line: 40, type: !207, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!207 = !DISubroutineType(types: !208)
!208 = !{!15, !6}
!209 = !DILocalVariable(name: "data", arg: 1, scope: !206, file: !121, line: 40, type: !6)
!210 = !DILocation(line: 0, scope: !206)
!211 = !DILocalVariable(name: "fp", scope: !206, file: !121, line: 42, type: !8)
!212 = !DILocation(line: 42, column: 9, scope: !206)
!213 = !DILocalVariable(name: "__cil_tmp4", scope: !206, file: !121, line: 44, type: !6)
!214 = !DILocation(line: 44, column: 9, scope: !206)
!215 = !DILocalVariable(name: "__cil_tmp5", scope: !206, file: !121, line: 45, type: !6)
!216 = !DILocation(line: 45, column: 9, scope: !206)
!217 = !DILocation(line: 45, column: 9, scope: !218)
!218 = distinct !DILexicalBlock(scope: !219, file: !121, line: 49, column: 3)
!219 = distinct !DILexicalBlock(scope: !220, file: !121, line: 48, column: 3)
!220 = distinct !DILexicalBlock(scope: !206, file: !121, line: 47, column: 3)
!221 = !DILocalVariable(name: "tmp", scope: !206, file: !121, line: 43, type: !15)
!222 = !DILocation(line: 45, column: 11, scope: !223)
!223 = distinct !DILexicalBlock(scope: !220, file: !121, line: 45, column: 7)
!224 = !DILocation(line: 45, column: 7, scope: !220)
!225 = !DILocation(line: 46, column: 5, scope: !226)
!226 = distinct !DILexicalBlock(scope: !223, file: !121, line: 45, column: 17)
!227 = !DILocation(line: 48, column: 36, scope: !228)
!228 = distinct !DILexicalBlock(scope: !229, file: !121, line: 49, column: 3)
!229 = distinct !DILexicalBlock(scope: !220, file: !121, line: 48, column: 3)
!230 = !DILocation(line: 48, column: 3, scope: !228)
!231 = !DILocation(line: 49, column: 10, scope: !232)
!232 = distinct !DILexicalBlock(scope: !229, file: !121, line: 50, column: 3)
!233 = !DILocation(line: 49, column: 3, scope: !232)
!234 = !DILocation(line: 51, column: 3, scope: !220)
!235 = !DILocation(line: 0, scope: !220)
!236 = !DILocation(line: 53, column: 1, scope: !206)
!237 = distinct !DISubprogram(name: "id3_open_file", scope: !121, file: !121, line: 106, type: !238, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!238 = !DISubroutineType(types: !239)
!239 = !{!15, !240, !6, !6}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!241 = !DILocalVariable(name: "fp", arg: 1, scope: !237, file: !121, line: 106, type: !240)
!242 = !DILocation(line: 0, scope: !237)
!243 = !DILocalVariable(name: "fn", arg: 2, scope: !237, file: !121, line: 106, type: !6)
!244 = !DILocalVariable(name: "mode", arg: 3, scope: !237, file: !121, line: 106, type: !6)
!245 = !DILocalVariable(name: "__cil_tmp4", scope: !237, file: !121, line: 108, type: !6)
!246 = !DILocation(line: 108, column: 9, scope: !237)
!247 = !DILocation(line: 109, column: 9, scope: !248)
!248 = distinct !DILexicalBlock(scope: !249, file: !121, line: 112, column: 3)
!249 = distinct !DILexicalBlock(scope: !250, file: !121, line: 111, column: 3)
!250 = distinct !DILexicalBlock(scope: !237, file: !121, line: 110, column: 3)
!251 = !DILocation(line: 109, column: 7, scope: !248)
!252 = !DILocation(line: 111, column: 23, scope: !253)
!253 = distinct !DILexicalBlock(scope: !250, file: !121, line: 111, column: 7)
!254 = !DILocation(line: 111, column: 7, scope: !253)
!255 = !DILocation(line: 111, column: 27, scope: !253)
!256 = !DILocation(line: 111, column: 7, scope: !250)
!257 = !DILocation(line: 113, column: 5, scope: !258)
!258 = distinct !DILexicalBlock(scope: !259, file: !121, line: 113, column: 5)
!259 = distinct !DILexicalBlock(scope: !260, file: !121, line: 112, column: 5)
!260 = distinct !DILexicalBlock(scope: !253, file: !121, line: 111, column: 59)
!261 = !DILocation(line: 114, column: 5, scope: !260)
!262 = !DILocation(line: 117, column: 3, scope: !250)
!263 = !DILocation(line: 0, scope: !250)
!264 = !DILocation(line: 119, column: 1, scope: !237)
!265 = distinct !DISubprogram(name: "id3_read_file", scope: !121, file: !121, line: 55, type: !266, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!266 = !DISubroutineType(types: !267)
!267 = !{!15, !6, !75, !8, !6}
!268 = !DILocalVariable(name: "dest", arg: 1, scope: !265, file: !121, line: 55, type: !6)
!269 = !DILocation(line: 0, scope: !265)
!270 = !DILocalVariable(name: "size", arg: 2, scope: !265, file: !121, line: 55, type: !75)
!271 = !DILocalVariable(name: "fp", arg: 3, scope: !265, file: !121, line: 55, type: !8)
!272 = !DILocalVariable(name: "fn", arg: 4, scope: !265, file: !121, line: 55, type: !6)
!273 = !DILocalVariable(name: "__cil_tmp8", scope: !265, file: !121, line: 60, type: !6)
!274 = !DILocation(line: 60, column: 9, scope: !265)
!275 = !DILocalVariable(name: "__cil_tmp9", scope: !265, file: !121, line: 61, type: !6)
!276 = !DILocation(line: 61, column: 9, scope: !265)
!277 = !DILocalVariable(name: "__cil_tmp10", scope: !265, file: !121, line: 62, type: !6)
!278 = !DILocation(line: 62, column: 9, scope: !265)
!279 = !DILocation(line: 58, column: 46, scope: !280)
!280 = distinct !DILexicalBlock(scope: !281, file: !121, line: 66, column: 3)
!281 = distinct !DILexicalBlock(scope: !282, file: !121, line: 65, column: 3)
!282 = distinct !DILexicalBlock(scope: !265, file: !121, line: 64, column: 3)
!283 = !DILocation(line: 58, column: 9, scope: !280)
!284 = !DILocalVariable(name: "tmp", scope: !265, file: !121, line: 57, type: !63)
!285 = !DILocation(line: 58, column: 11, scope: !286)
!286 = distinct !DILexicalBlock(scope: !282, file: !121, line: 58, column: 7)
!287 = !DILocation(line: 58, column: 7, scope: !282)
!288 = !DILocation(line: 60, column: 5, scope: !289)
!289 = distinct !DILexicalBlock(scope: !290, file: !121, line: 60, column: 5)
!290 = distinct !DILexicalBlock(scope: !291, file: !121, line: 59, column: 5)
!291 = distinct !DILexicalBlock(scope: !286, file: !121, line: 58, column: 18)
!292 = !DILocation(line: 61, column: 5, scope: !293)
!293 = distinct !DILexicalBlock(scope: !290, file: !121, line: 62, column: 5)
!294 = !DILocation(line: 62, column: 5, scope: !291)
!295 = !DILocation(line: 65, column: 13, scope: !296)
!296 = distinct !DILexicalBlock(scope: !297, file: !121, line: 65, column: 3)
!297 = distinct !DILexicalBlock(scope: !282, file: !121, line: 64, column: 3)
!298 = !DILocalVariable(name: "tmp___0", scope: !265, file: !121, line: 58, type: !15)
!299 = !DILocation(line: 65, column: 15, scope: !300)
!300 = distinct !DILexicalBlock(scope: !282, file: !121, line: 65, column: 7)
!301 = !DILocation(line: 65, column: 7, scope: !282)
!302 = !DILocation(line: 67, column: 5, scope: !303)
!303 = distinct !DILexicalBlock(scope: !304, file: !121, line: 67, column: 5)
!304 = distinct !DILexicalBlock(scope: !305, file: !121, line: 66, column: 5)
!305 = distinct !DILexicalBlock(scope: !300, file: !121, line: 65, column: 21)
!306 = !DILocation(line: 68, column: 5, scope: !307)
!307 = distinct !DILexicalBlock(scope: !304, file: !121, line: 69, column: 5)
!308 = !DILocation(line: 69, column: 5, scope: !309)
!309 = distinct !DILexicalBlock(scope: !304, file: !121, line: 70, column: 5)
!310 = !DILocation(line: 70, column: 5, scope: !305)
!311 = !DILocation(line: 73, column: 13, scope: !312)
!312 = distinct !DILexicalBlock(scope: !313, file: !121, line: 73, column: 3)
!313 = distinct !DILexicalBlock(scope: !282, file: !121, line: 72, column: 3)
!314 = !DILocalVariable(name: "tmp___1", scope: !265, file: !121, line: 59, type: !15)
!315 = !DILocation(line: 73, column: 7, scope: !316)
!316 = distinct !DILexicalBlock(scope: !282, file: !121, line: 73, column: 7)
!317 = !DILocation(line: 73, column: 7, scope: !282)
!318 = !DILocation(line: 75, column: 5, scope: !319)
!319 = distinct !DILexicalBlock(scope: !320, file: !121, line: 75, column: 5)
!320 = distinct !DILexicalBlock(scope: !321, file: !121, line: 74, column: 5)
!321 = distinct !DILexicalBlock(scope: !316, file: !121, line: 73, column: 16)
!322 = !DILocation(line: 76, column: 5, scope: !323)
!323 = distinct !DILexicalBlock(scope: !320, file: !121, line: 77, column: 5)
!324 = !DILocation(line: 77, column: 5, scope: !321)
!325 = !DILocation(line: 80, column: 3, scope: !282)
!326 = !DILocation(line: 0, scope: !282)
!327 = !DILocation(line: 82, column: 1, scope: !265)
!328 = distinct !DISubprogram(name: "print_error", scope: !329, file: !329, line: 109, type: !330, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!329 = !DIFile(filename: "/home/wslee/benchmarks/sound/id3ren-1.1b0/src/id3misc.c", directory: "")
!330 = !DISubroutineType(types: !331)
!331 = !{null, !6, null}
!332 = !DILocalVariable(name: "format", arg: 1, scope: !328, file: !329, line: 109, type: !6)
!333 = !DILocation(line: 0, scope: !328)
!334 = !DILocalVariable(name: "buf", scope: !328, file: !329, line: 111, type: !335)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8192, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 1024)
!338 = !DILocation(line: 111, column: 8, scope: !328)
!339 = !DILocalVariable(name: "msg", scope: !328, file: !329, line: 112, type: !340)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !341, line: 102, baseType: !342)
!341 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stdarg.h", directory: "")
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !341, line: 40, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 112, baseType: !344)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 192, elements: !48)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 112, size: 192, elements: !346)
!346 = !{!347, !348, !349, !350}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !345, file: !3, line: 112, baseType: !65, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !345, file: !3, line: 112, baseType: !65, size: 32, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !345, file: !3, line: 112, baseType: !58, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !345, file: !3, line: 112, baseType: !58, size: 64, offset: 128)
!351 = !DILocation(line: 112, column: 11, scope: !328)
!352 = !DILocalVariable(name: "__cil_tmp8", scope: !328, file: !329, line: 117, type: !58)
!353 = !DILocation(line: 117, column: 9, scope: !328)
!354 = !DILocalVariable(name: "__cil_tmp9", scope: !328, file: !329, line: 118, type: !6)
!355 = !DILocation(line: 118, column: 9, scope: !328)
!356 = !DILocalVariable(name: "__cil_tmp10", scope: !328, file: !329, line: 119, type: !6)
!357 = !DILocation(line: 119, column: 9, scope: !328)
!358 = !DILocation(line: 115, column: 3, scope: !359)
!359 = distinct !DILexicalBlock(scope: !360, file: !329, line: 123, column: 3)
!360 = distinct !DILexicalBlock(scope: !361, file: !329, line: 122, column: 3)
!361 = distinct !DILexicalBlock(scope: !328, file: !329, line: 121, column: 3)
!362 = !DILocation(line: 116, column: 37, scope: !363)
!363 = distinct !DILexicalBlock(scope: !360, file: !329, line: 117, column: 3)
!364 = !DILocation(line: 117, column: 12, scope: !363)
!365 = !DILocation(line: 116, column: 3, scope: !363)
!366 = !DILocation(line: 117, column: 3, scope: !367)
!367 = distinct !DILexicalBlock(scope: !360, file: !329, line: 119, column: 3)
!368 = !DILocation(line: 119, column: 9, scope: !369)
!369 = distinct !DILexicalBlock(scope: !360, file: !329, line: 119, column: 3)
!370 = !DILocalVariable(name: "tmp", scope: !328, file: !329, line: 113, type: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!372 = !DILocation(line: 119, column: 22, scope: !373)
!373 = distinct !DILexicalBlock(scope: !360, file: !329, line: 121, column: 3)
!374 = !DILocation(line: 119, column: 13, scope: !373)
!375 = !DILocalVariable(name: "tmp___0", scope: !328, file: !329, line: 114, type: !6)
!376 = !DILocation(line: 119, column: 36, scope: !377)
!377 = distinct !DILexicalBlock(scope: !360, file: !329, line: 121, column: 3)
!378 = !DILocation(line: 120, column: 11, scope: !377)
!379 = !DILocation(line: 120, column: 25, scope: !377)
!380 = !DILocation(line: 119, column: 3, scope: !377)
!381 = !DILocation(line: 121, column: 19, scope: !382)
!382 = distinct !DILexicalBlock(scope: !361, file: !329, line: 121, column: 7)
!383 = !DILocation(line: 121, column: 7, scope: !382)
!384 = !DILocation(line: 121, column: 27, scope: !382)
!385 = !DILocation(line: 121, column: 7, scope: !361)
!386 = !DILocation(line: 123, column: 15, scope: !387)
!387 = distinct !DILexicalBlock(scope: !388, file: !329, line: 123, column: 5)
!388 = distinct !DILexicalBlock(scope: !389, file: !329, line: 122, column: 5)
!389 = distinct !DILexicalBlock(scope: !382, file: !329, line: 121, column: 33)
!390 = !DILocalVariable(name: "tmp___1", scope: !328, file: !329, line: 115, type: !371)
!391 = !DILocation(line: 123, column: 24, scope: !392)
!392 = distinct !DILexicalBlock(scope: !388, file: !329, line: 125, column: 5)
!393 = !DILocation(line: 123, column: 15, scope: !392)
!394 = !DILocalVariable(name: "tmp___2", scope: !328, file: !329, line: 116, type: !6)
!395 = !DILocation(line: 123, column: 38, scope: !396)
!396 = distinct !DILexicalBlock(scope: !388, file: !329, line: 125, column: 5)
!397 = !DILocation(line: 124, column: 13, scope: !396)
!398 = !DILocation(line: 124, column: 27, scope: !396)
!399 = !DILocation(line: 123, column: 5, scope: !396)
!400 = !DILocation(line: 124, column: 16, scope: !401)
!401 = distinct !DILexicalBlock(scope: !388, file: !329, line: 126, column: 5)
!402 = !DILocation(line: 124, column: 5, scope: !401)
!403 = !DILocation(line: 127, column: 3, scope: !389)
!404 = !DILocation(line: 126, column: 3, scope: !361)
!405 = distinct !DISubprogram(name: "id3_write_file", scope: !121, file: !121, line: 84, type: !266, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!406 = !DILocalVariable(name: "src", arg: 1, scope: !405, file: !121, line: 84, type: !6)
