; ModuleID = '/tmp/tmp.ll'
source_filename = "c/id3tool-1.2a.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct.style_s = type { i8, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.id3tag_s = type { [3 x i8], [30 x i8], [30 x i8], [30 x i8], [4 x i8], %union.__anonunion_note_24, i8 }
%union.__anonunion_note_24 = type { %struct.__anonstruct_v10_25 }
%struct.__anonstruct_v10_25 = type { [30 x i8] }
%struct.__anonstruct_v11_26 = type { [28 x i8], i8, i8 }

@.str = private unnamed_addr constant [6 x i8] c"Blues\00", align 1
@.str.1 = private unnamed_addr constant [13 x i8] c"Classic Rock\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c"Country\00", align 1
@.str.3 = private unnamed_addr constant [6 x i8] c"Dance\00", align 1
@.str.4 = private unnamed_addr constant [6 x i8] c"Disco\00", align 1
@.str.5 = private unnamed_addr constant [5 x i8] c"Funk\00", align 1
@.str.6 = private unnamed_addr constant [7 x i8] c"Grunge\00", align 1
@.str.7 = private unnamed_addr constant [8 x i8] c"Hip-Hop\00", align 1
@.str.8 = private unnamed_addr constant [5 x i8] c"Jazz\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "id3_styles", scope: !2, file: !96, line: 49, type: !97, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !89, nameTableKind: GNU)
!3 = !DIFile(filename: "c/id3tool-1.2a.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !7, !8, !11, !18, !72, !74, !20, !76, !77, !79, !46, !21}
!6 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !9, line: 211, baseType: !10)
!9 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !13, line: 49, baseType: !14)
!13 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !15, line: 271, size: 1728, elements: !16)
!15 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!16 = !{!17, !19, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !40, !41, !42, !43, !47, !49, !51, !55, !58, !62, !63, !64, !65, !66, !67, !68}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !14, file: !15, line: 272, baseType: !18, size: 32)
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !14, file: !15, line: 273, baseType: !20, size: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !14, file: !15, line: 274, baseType: !20, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !14, file: !15, line: 275, baseType: !20, size: 64, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !14, file: !15, line: 276, baseType: !20, size: 64, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !14, file: !15, line: 277, baseType: !20, size: 64, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !14, file: !15, line: 278, baseType: !20, size: 64, offset: 384)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !14, file: !15, line: 279, baseType: !20, size: 64, offset: 448)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !14, file: !15, line: 280, baseType: !20, size: 64, offset: 512)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !14, file: !15, line: 281, baseType: !20, size: 64, offset: 576)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !14, file: !15, line: 282, baseType: !20, size: 64, offset: 640)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !14, file: !15, line: 283, baseType: !20, size: 64, offset: 704)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !14, file: !15, line: 284, baseType: !33, size: 64, offset: 768)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !15, line: 186, size: 192, elements: !35)
!35 = !{!36, !37, !39}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !34, file: !15, line: 187, baseType: !33, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !34, file: !15, line: 188, baseType: !38, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !34, file: !15, line: 189, baseType: !18, size: 32, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !14, file: !15, line: 285, baseType: !38, size: 64, offset: 832)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !14, file: !15, line: 286, baseType: !18, size: 32, offset: 896)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !14, file: !15, line: 287, baseType: !18, size: 32, offset: 928)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !14, file: !15, line: 288, baseType: !44, size: 64, offset: 960)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !45, line: 141, baseType: !46)
!45 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!46 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !14, file: !15, line: 289, baseType: !48, size: 16, offset: 1024)
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !14, file: !15, line: 290, baseType: !50, size: 8, offset: 1040)
!50 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !14, file: !15, line: 291, baseType: !52, size: 8, offset: 1048)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 1)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !14, file: !15, line: 292, baseType: !56, size: 64, offset: 1088)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !15, line: 180, baseType: null)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !14, file: !15, line: 293, baseType: !59, size: 64, offset: 1152)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !45, line: 142, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !45, line: 56, baseType: !61)
!61 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !14, file: !15, line: 294, baseType: !7, size: 64, offset: 1216)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !14, file: !15, line: 295, baseType: !7, size: 64, offset: 1280)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !14, file: !15, line: 296, baseType: !7, size: 64, offset: 1344)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !14, file: !15, line: 297, baseType: !7, size: 64, offset: 1408)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !14, file: !15, line: 298, baseType: !8, size: 32, offset: 1472)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !14, file: !15, line: 299, baseType: !18, size: 32, offset: 1504)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !14, file: !15, line: 300, baseType: !69, size: 192, offset: 1536)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 192, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 24)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!76 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !82, line: 106, size: 256, elements: !83)
!82 = !DIFile(filename: "/usr/include/getopt.h", directory: "")
!83 = !{!84, !85, !86, !88}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !81, file: !82, line: 107, baseType: !72, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !81, file: !82, line: 108, baseType: !18, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !81, file: !82, line: 109, baseType: !87, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !81, file: !82, line: 110, baseType: !18, size: 32, offset: 192)
!89 = !{!0, !90}
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "id3options", scope: !2, file: !92, line: 55, type: !93, isLocal: false, isDefinition: true)
!92 = !DIFile(filename: "/home/wslee/benchmarks/sound/id3tool-1.2a/id3tool.c", directory: "")
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 3072, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 12)
!96 = !DIFile(filename: "/home/wslee/benchmarks/sound/id3tool-1.2a/id3.c", directory: "")
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 18688, elements: !103)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "style_s", file: !99, line: 64, size: 128, elements: !100)
!99 = !DIFile(filename: "/home/wslee/benchmarks/sound/id3tool-1.2a/id3.h", directory: "")
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "styleid", scope: !98, file: !99, line: 65, baseType: !76, size: 8)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !98, file: !99, line: 66, baseType: !20, size: 64, offset: 64)
!103 = !{!104}
!104 = !DISubrange(count: 146)
!105 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!106 = !{i32 2, !"Dwarf Version", i32 4}
!107 = !{i32 2, !"Debug Info Version", i32 3}
!108 = !{i32 1, !"wchar_size", i32 4}
!109 = !{i32 7, !"PIC Level", i32 2}
!110 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!111 = distinct !DISubprogram(name: "id3_readtag", scope: !96, file: !96, line: 198, type: !112, scopeLine: 199, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!112 = !DISubroutineType(types: !113)
!113 = !{!18, !11, !114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "id3tag_t", file: !99, line: 45, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "id3tag_s", file: !99, line: 45, size: 1024, elements: !117)
!117 = !{!118, !122, !126, !127, !128, !132, !148}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !116, file: !99, line: 46, baseType: !119, size: 24)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 24, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 3)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "songname", scope: !116, file: !99, line: 47, baseType: !123, size: 240, offset: 24)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 240, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 30)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "artist", scope: !116, file: !99, line: 48, baseType: !123, size: 240, offset: 264)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "album", scope: !116, file: !99, line: 49, baseType: !123, size: 240, offset: 504)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !116, file: !99, line: 50, baseType: !129, size: 32, offset: 744)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 32, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 4)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "note", scope: !116, file: !99, line: 51, baseType: !133, size: 240, offset: 776)
!133 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_note_24", file: !99, line: 45, size: 240, elements: !134)
!134 = !{!135, !139}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "v10", scope: !133, file: !99, line: 46, baseType: !136, size: 240)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_v10_25", file: !99, line: 45, size: 240, elements: !137)
!137 = !{!138}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "note", scope: !136, file: !99, line: 46, baseType: !123, size: 240)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "v11", scope: !133, file: !99, line: 47, baseType: !140, size: 240)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_v11_26", file: !99, line: 45, size: 240, elements: !141)
!141 = !{!142, !146, !147}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "note", scope: !140, file: !99, line: 46, baseType: !143, size: 224)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 224, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 28)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !140, file: !99, line: 47, baseType: !21, size: 8, offset: 224)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !140, file: !99, line: 48, baseType: !76, size: 8, offset: 232)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !116, file: !99, line: 52, baseType: !76, size: 8, offset: 1016)
!149 = !DILocalVariable(name: "fin", arg: 1, scope: !111, file: !96, line: 198, type: !11)
!150 = !DILocation(line: 0, scope: !111)
!151 = !DILocalVariable(name: "id3tag", arg: 2, scope: !111, file: !96, line: 198, type: !114)
!152 = !DILocalVariable(name: "__cil_tmp7", scope: !111, file: !96, line: 204, type: !20)
!153 = !DILocation(line: 204, column: 9, scope: !111)
!154 = !DILocation(line: 202, column: 38, scope: !155)
!155 = distinct !DILexicalBlock(scope: !156, file: !96, line: 202, column: 7)
!156 = distinct !DILexicalBlock(scope: !111, file: !96, line: 206, column: 3)
!157 = !DILocation(line: 202, column: 35, scope: !155)
!158 = !DILocation(line: 202, column: 7, scope: !156)
!159 = !DILocation(line: 203, column: 5, scope: !160)
!160 = distinct !DILexicalBlock(scope: !155, file: !96, line: 202, column: 59)
!161 = !DILocation(line: 202, column: 38, scope: !162)
!162 = distinct !DILexicalBlock(scope: !155, file: !96, line: 202, column: 7)
!163 = !DILocation(line: 202, column: 35, scope: !162)
!164 = !DILocation(line: 202, column: 7, scope: !155)
!165 = !DILocation(line: 203, column: 5, scope: !166)
!166 = distinct !DILexicalBlock(scope: !162, file: !96, line: 202, column: 62)
!167 = !DILocation(line: 205, column: 3, scope: !168)
!168 = distinct !DILexicalBlock(scope: !169, file: !96, line: 206, column: 3)
!169 = distinct !DILexicalBlock(scope: !156, file: !96, line: 205, column: 3)
!170 = !DILocation(line: 206, column: 9, scope: !171)
!171 = distinct !DILexicalBlock(scope: !169, file: !96, line: 207, column: 3)
!172 = !DILocalVariable(name: "tmp", scope: !111, file: !96, line: 201, type: !46)
!173 = !DILocation(line: 206, column: 18, scope: !174)
!174 = distinct !DILexicalBlock(scope: !169, file: !96, line: 208, column: 3)
!175 = !DILocation(line: 206, column: 3, scope: !174)
!176 = !DILocation(line: 207, column: 19, scope: !177)
!177 = distinct !DILexicalBlock(scope: !169, file: !96, line: 208, column: 3)
!178 = !DILocation(line: 207, column: 13, scope: !177)
!179 = !DILocalVariable(name: "tmp___0", scope: !111, file: !96, line: 202, type: !8)
!180 = !DILocalVariable(name: "n", scope: !111, file: !96, line: 200, type: !18)
!181 = !DILocation(line: 208, column: 9, scope: !182)
!182 = distinct !DILexicalBlock(scope: !156, file: !96, line: 208, column: 7)
!183 = !DILocation(line: 208, column: 7, scope: !156)
!184 = !DILocation(line: 209, column: 5, scope: !185)
!185 = distinct !DILexicalBlock(scope: !182, file: !96, line: 208, column: 15)
!186 = !DILocation(line: 208, column: 48, scope: !187)
!187 = distinct !DILexicalBlock(scope: !188, file: !96, line: 212, column: 5)
!188 = distinct !DILexicalBlock(scope: !189, file: !96, line: 211, column: 5)
!189 = distinct !DILexicalBlock(scope: !182, file: !96, line: 210, column: 10)
!190 = !DILocation(line: 208, column: 39, scope: !187)
!191 = !DILocation(line: 208, column: 15, scope: !187)
!192 = !DILocalVariable(name: "tmp___1", scope: !111, file: !96, line: 203, type: !18)
!193 = !DILocation(line: 208, column: 9, scope: !194)
!194 = distinct !DILexicalBlock(scope: !189, file: !96, line: 208, column: 9)
!195 = !DILocation(line: 208, column: 9, scope: !189)
!196 = !DILocation(line: 209, column: 7, scope: !197)
!197 = distinct !DILexicalBlock(scope: !194, file: !96, line: 208, column: 18)
!198 = !DILocation(line: 211, column: 3, scope: !156)
!199 = !DILocation(line: 0, scope: !156)
!200 = !DILocation(line: 213, column: 1, scope: !111)
!201 = distinct !DISubprogram(name: "id3_appendtag", scope: !96, file: !96, line: 214, type: !112, scopeLine: 215, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!202 = !DILocalVariable(name: "fout", arg: 1, scope: !201, file: !96, line: 214, type: !11)
!203 = !DILocation(line: 0, scope: !201)
!204 = !DILocalVariable(name: "id3tag", arg: 2, scope: !201, file: !96, line: 214, type: !114)
