; ModuleID = '/tmp/tmp.ll'
source_filename = "c/lakai-0.1.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.__anonstruct_LakaiProgramList_24 = type { i32, i8** }
%struct.__anonstruct_LakaiSampleList_25 = type { i32, i8** }
%struct.sg_scsi_id = type { i32, i32, i32, i32, i32, i16, i16, [2 x i32] }
%struct.sg_io_hdr = type { i32, i32, i8, i8, i16, i32, i8*, i8*, i8*, i32, i32, i32, i8*, i8, i8, i8, i8, i16, i16, i32, i32, i32 }
%struct.__anonstruct_LakaiStatus_26 = type { i32, i32, i32, i32, i32, i32 }

@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [21 x i8] c"Usage: %s <devname>\0A\00", align 1
@.str.1 = private unnamed_addr constant [14 x i8] c"Open failed.\0A\00", align 1
@.str.2 = private unnamed_addr constant [25 x i8] c"Deleting all samples...\0A\00", align 1
@.str.3 = private unnamed_addr constant [19 x i8] c"Delete sample #%d\0A\00", align 1
@.str.4 = private unnamed_addr constant [7 x i8] c"Done.\0A\00", align 1
@.str.5 = private unnamed_addr constant [39 x i8] c"-- No resident sample names found. --\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "open_cnt", scope: !2, file: !83, line: 34, type: !13, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !80, nameTableKind: GNU)
!3 = !DIFile(filename: "c/lakai-0.1.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !71, !73, !15, !58, !65, !13, !63, !74, !75, !16, !76, !78, !79, !41, !43}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !8, line: 49, baseType: !9)
!8 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !10, line: 271, size: 1728, elements: !11)
!10 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!11 = !{!12, !14, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !35, !36, !37, !38, !42, !44, !46, !50, !53, !57, !59, !60, !61, !62, !66, !67}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !9, file: !10, line: 272, baseType: !13, size: 32)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !9, file: !10, line: 273, baseType: !15, size: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !9, file: !10, line: 274, baseType: !15, size: 64, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !9, file: !10, line: 275, baseType: !15, size: 64, offset: 192)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !9, file: !10, line: 276, baseType: !15, size: 64, offset: 256)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !9, file: !10, line: 277, baseType: !15, size: 64, offset: 320)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !9, file: !10, line: 278, baseType: !15, size: 64, offset: 384)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !9, file: !10, line: 279, baseType: !15, size: 64, offset: 448)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !9, file: !10, line: 280, baseType: !15, size: 64, offset: 512)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !9, file: !10, line: 281, baseType: !15, size: 64, offset: 576)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !9, file: !10, line: 282, baseType: !15, size: 64, offset: 640)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !9, file: !10, line: 283, baseType: !15, size: 64, offset: 704)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !9, file: !10, line: 284, baseType: !28, size: 64, offset: 768)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !10, line: 186, size: 192, elements: !30)
!30 = !{!31, !32, !34}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !29, file: !10, line: 187, baseType: !28, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !29, file: !10, line: 188, baseType: !33, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !29, file: !10, line: 189, baseType: !13, size: 32, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !9, file: !10, line: 285, baseType: !33, size: 64, offset: 832)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !9, file: !10, line: 286, baseType: !13, size: 32, offset: 896)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !9, file: !10, line: 287, baseType: !13, size: 32, offset: 928)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !9, file: !10, line: 288, baseType: !39, size: 64, offset: 960)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !40, line: 141, baseType: !41)
!40 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!41 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !9, file: !10, line: 289, baseType: !43, size: 16, offset: 1024)
!43 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !9, file: !10, line: 290, baseType: !45, size: 8, offset: 1040)
!45 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !9, file: !10, line: 291, baseType: !47, size: 8, offset: 1048)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 1)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !9, file: !10, line: 292, baseType: !51, size: 64, offset: 1088)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !10, line: 180, baseType: null)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !9, file: !10, line: 293, baseType: !54, size: 64, offset: 1152)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !40, line: 142, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !40, line: 56, baseType: !56)
!56 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !9, file: !10, line: 294, baseType: !58, size: 64, offset: 1216)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !9, file: !10, line: 295, baseType: !58, size: 64, offset: 1280)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !9, file: !10, line: 296, baseType: !58, size: 64, offset: 1344)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !9, file: !10, line: 297, baseType: !58, size: 64, offset: 1408)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !9, file: !10, line: 298, baseType: !63, size: 32, offset: 1472)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !64, line: 211, baseType: !65)
!64 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!65 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !9, file: !10, line: 299, baseType: !13, size: 32, offset: 1504)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !9, file: !10, line: 300, baseType: !68, size: 192, offset: 1536)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 192, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 24)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!73 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!74 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__useconds_t", file: !40, line: 150, baseType: !65)
!80 = !{!81, !0, !87, !92, !94, !96, !98, !103, !108, !110, !115, !117, !119, !121, !123, !125, !127, !129, !131, !133, !135, !137, !139}
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "fhandles", scope: !2, file: !83, line: 35, type: !84, isLocal: true, isDefinition: true)
!83 = !DIFile(filename: "/home/wslee/benchmarks/sound/lakai-0.1/lakai.c", directory: "")
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 512, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 16)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "cmdblk", scope: !2, file: !83, line: 175, type: !89, isLocal: true, isDefinition: true)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 48, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 6)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "cmdblk1", scope: !2, file: !83, line: 234, type: !89, isLocal: true, isDefinition: true)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "cmdblk1___0", scope: !2, file: !83, line: 274, type: !89, isLocal: true, isDefinition: true)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "cmdblk1___1", scope: !2, file: !83, line: 360, type: !89, isLocal: true, isDefinition: true)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "cmdblk1___2", scope: !2, file: !83, line: 452, type: !100, isLocal: true, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 64, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 8)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "cmdblk1___3", scope: !2, file: !83, line: 550, type: !105, isLocal: true, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 72, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 9)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "cmdblk1___4", scope: !2, file: !83, line: 621, type: !100, isLocal: true, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "cmdblk1___5", scope: !2, file: !83, line: 693, type: !112, isLocal: true, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 56, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 7)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "cmdblk1___6", scope: !2, file: !83, line: 747, type: !100, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "cmdblk1___7", scope: !2, file: !83, line: 792, type: !105, isLocal: true, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "cmdblk1___8", scope: !2, file: !83, line: 846, type: !100, isLocal: true, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "cmdblk1___9", scope: !2, file: !83, line: 965, type: !89, isLocal: true, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "cmdblk1___10", scope: !2, file: !83, line: 1011, type: !112, isLocal: true, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "cmdblk1___11", scope: !2, file: !83, line: 1082, type: !100, isLocal: true, isDefinition: true)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "cmdblk1___12", scope: !2, file: !83, line: 1485, type: !89, isLocal: true, isDefinition: true)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "cmdblk2", scope: !2, file: !83, line: 1493, type: !89, isLocal: true, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "cmdblk3", scope: !2, file: !83, line: 1501, type: !89, isLocal: true, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "cmdblk1___13", scope: !2, file: !83, line: 1594, type: !89, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "cmdblk2___0", scope: !2, file: !83, line: 1602, type: !89, isLocal: true, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "cmdblk___0", scope: !2, file: !83, line: 1716, type: !89, isLocal: true, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "cmdblk___1", scope: !2, file: !83, line: 1770, type: !89, isLocal: true, isDefinition: true)
!141 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!142 = !{i32 2, !"Dwarf Version", i32 4}
!143 = !{i32 2, !"Debug Info Version", i32 3}
!144 = !{i32 1, !"wchar_size", i32 4}
!145 = !{i32 7, !"PIC Level", i32 2}
!146 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!147 = distinct !DISubprogram(name: "main", scope: !148, file: !148, line: 14, type: !149, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!148 = !DIFile(filename: "/home/wslee/benchmarks/sound/lakai-0.1/lakclear.c", directory: "")
!149 = !DISubroutineType(types: !150)
!150 = !{!13, !13, !75}
!151 = !DILocalVariable(name: "argc", arg: 1, scope: !147, file: !148, line: 14, type: !13)
!152 = !DILocation(line: 0, scope: !147)
!153 = !DILocalVariable(name: "argv", arg: 2, scope: !147, file: !148, line: 14, type: !75)
!154 = !DILocalVariable(name: "lp", scope: !147, file: !148, line: 21, type: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "LakaiProgramList", file: !156, line: 118, baseType: !157)
!156 = !DIFile(filename: "/home/wslee/benchmarks/sound/lakai-0.1/lakai.h", directory: "")
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_LakaiProgramList_24", file: !156, line: 118, size: 128, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "numprogs", scope: !157, file: !156, line: 119, baseType: !13, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "prognames", scope: !157, file: !156, line: 120, baseType: !75, size: 64, offset: 64)
!161 = !DILocation(line: 21, column: 20, scope: !147)
!162 = !DILocalVariable(name: "ls", scope: !147, file: !148, line: 22, type: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "LakaiSampleList", file: !156, line: 127, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_LakaiSampleList_25", file: !156, line: 127, size: 128, elements: !165)
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "numsamples", scope: !164, file: !156, line: 128, baseType: !13, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "samplenames", scope: !164, file: !156, line: 129, baseType: !75, size: 64, offset: 64)
!168 = !DILocation(line: 22, column: 19, scope: !147)
!169 = !DILocalVariable(name: "__cil_tmp10", scope: !147, file: !148, line: 23, type: !15)
!170 = !DILocation(line: 23, column: 9, scope: !147)
!171 = !DILocalVariable(name: "__cil_tmp11", scope: !147, file: !148, line: 24, type: !15)
!172 = !DILocation(line: 24, column: 9, scope: !147)
!173 = !DILocalVariable(name: "__cil_tmp12", scope: !147, file: !148, line: 25, type: !15)
!174 = !DILocation(line: 25, column: 9, scope: !147)
!175 = !DILocalVariable(name: "__cil_tmp13", scope: !147, file: !148, line: 26, type: !15)
!176 = !DILocation(line: 26, column: 9, scope: !147)
!177 = !DILocalVariable(name: "__cil_tmp14", scope: !147, file: !148, line: 27, type: !15)
!178 = !DILocation(line: 27, column: 9, scope: !147)
!179 = !DILocalVariable(name: "__cil_tmp15", scope: !147, file: !148, line: 28, type: !15)
!180 = !DILocation(line: 28, column: 9, scope: !147)
!181 = !DILocalVariable(name: "__cil_tmp16", scope: !147, file: !148, line: 29, type: !15)
!182 = !DILocation(line: 29, column: 9, scope: !147)
!183 = !DILocalVariable(name: "__cil_tmp17", scope: !147, file: !148, line: 30, type: !15)
!184 = !DILocation(line: 30, column: 9, scope: !147)
!185 = !DILocalVariable(name: "__cil_tmp18", scope: !147, file: !148, line: 31, type: !15)
!186 = !DILocation(line: 31, column: 9, scope: !147)
!187 = !DILocalVariable(name: "__cil_tmp19", scope: !147, file: !148, line: 32, type: !15)
!188 = !DILocation(line: 32, column: 9, scope: !147)
!189 = !DILocalVariable(name: "__cil_tmp20", scope: !147, file: !148, line: 33, type: !15)
!190 = !DILocation(line: 33, column: 9, scope: !147)
!191 = !DILocation(line: 21, column: 12, scope: !192)
!192 = distinct !DILexicalBlock(scope: !193, file: !148, line: 21, column: 7)
!193 = distinct !DILexicalBlock(scope: !147, file: !148, line: 35, column: 3)
!194 = !DILocation(line: 21, column: 7, scope: !193)
!195 = !DILocation(line: 23, column: 38, scope: !196)
!196 = distinct !DILexicalBlock(scope: !197, file: !148, line: 23, column: 5)
!197 = distinct !DILexicalBlock(scope: !198, file: !148, line: 22, column: 5)
!198 = distinct !DILexicalBlock(scope: !192, file: !148, line: 21, column: 18)
!199 = !DILocation(line: 24, column: 20, scope: !196)
!200 = !DILocation(line: 24, column: 13, scope: !196)
!201 = !DILocation(line: 23, column: 5, scope: !196)
!202 = !DILocation(line: 24, column: 5, scope: !203)
!203 = distinct !DILexicalBlock(scope: !197, file: !148, line: 26, column: 5)
!204 = !DILocation(line: 27, column: 3, scope: !205)
!205 = distinct !DILexicalBlock(scope: !206, file: !148, line: 29, column: 3)
!206 = distinct !DILexicalBlock(scope: !193, file: !148, line: 28, column: 3)
!207 = !DILocation(line: 29, column: 27, scope: !208)
!208 = distinct !DILexicalBlock(scope: !206, file: !148, line: 29, column: 3)
!209 = !DILocation(line: 29, column: 20, scope: !208)
!210 = !DILocation(line: 29, column: 9, scope: !208)
!211 = !DILocalVariable(name: "hd1", scope: !147, file: !148, line: 20, type: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "LHANDLE", file: !156, line: 93, baseType: !13)
!213 = !DILocation(line: 30, column: 14, scope: !214)
!214 = distinct !DILexicalBlock(scope: !193, file: !148, line: 30, column: 7)
!215 = !DILocation(line: 30, column: 7, scope: !193)
!216 = !DILocation(line: 36, column: 38, scope: !217)
!217 = distinct !DILexicalBlock(scope: !218, file: !148, line: 32, column: 5)
!218 = distinct !DILexicalBlock(scope: !219, file: !148, line: 31, column: 5)
!219 = distinct !DILexicalBlock(scope: !214, file: !148, line: 30, column: 21)
!220 = !DILocation(line: 36, column: 5, scope: !217)
!221 = !DILocation(line: 37, column: 5, scope: !222)
!222 = distinct !DILexicalBlock(scope: !218, file: !148, line: 38, column: 5)
!223 = !DILocation(line: 38, column: 5, scope: !224)
!224 = distinct !DILexicalBlock(scope: !218, file: !148, line: 39, column: 5)
!225 = !DILocation(line: 42, column: 14, scope: !226)
!226 = distinct !DILexicalBlock(scope: !227, file: !148, line: 43, column: 3)
!227 = distinct !DILexicalBlock(scope: !193, file: !148, line: 42, column: 3)
!228 = !DILocalVariable(name: "numsamps", scope: !147, file: !148, line: 18, type: !13)
!229 = !DILocation(line: 43, column: 16, scope: !230)
!230 = distinct !DILexicalBlock(scope: !193, file: !148, line: 43, column: 7)
!231 = !DILocation(line: 43, column: 7, scope: !193)
!232 = !DILocation(line: 45, column: 38, scope: !233)
!233 = distinct !DILexicalBlock(scope: !234, file: !148, line: 45, column: 5)
!234 = distinct !DILexicalBlock(scope: !235, file: !148, line: 44, column: 5)
!235 = distinct !DILexicalBlock(scope: !230, file: !148, line: 43, column: 21)
!236 = !DILocation(line: 45, column: 5, scope: !233)
!237 = !DILocation(line: 46, column: 18, scope: !234)
!238 = !DILocalVariable(name: "i", scope: !147, file: !148, line: 16, type: !13)
!239 = !DILocation(line: 46, column: 5, scope: !240)
!240 = distinct !DILexicalBlock(scope: !241, file: !148, line: 49, column: 5)
!241 = distinct !DILexicalBlock(scope: !235, file: !148, line: 48, column: 5)
!242 = !DILocation(line: 0, scope: !235)
!243 = !DILocation(line: 46, column: 15, scope: !240)
!244 = !DILocation(line: 46, column: 16, scope: !245)
!245 = distinct !DILexicalBlock(scope: !246, file: !148, line: 46, column: 11)
!246 = distinct !DILexicalBlock(scope: !240, file: !148, line: 46, column: 15)
!247 = !DILocation(line: 46, column: 11, scope: !246)
!248 = !DILocation(line: 46, column: 9, scope: !249)
!249 = distinct !DILexicalBlock(scope: !245, file: !148, line: 46, column: 23)
!250 = !DILocation(line: 48, column: 40, scope: !251)
!251 = distinct !DILexicalBlock(scope: !252, file: !148, line: 49, column: 7)
!252 = distinct !DILexicalBlock(scope: !246, file: !148, line: 48, column: 7)
!253 = !DILocation(line: 48, column: 7, scope: !251)
!254 = !DILocation(line: 49, column: 13, scope: !255)
!255 = distinct !DILexicalBlock(scope: !252, file: !148, line: 51, column: 7)
!256 = !DILocalVariable(name: "res", scope: !147, file: !148, line: 19, type: !13)
!257 = !DILocation(line: 46, column: 9, scope: !252)
!258 = distinct !{!258, !239, !259}
!259 = !DILocation(line: 48, column: 5, scope: !240)
!260 = !DILocation(line: 50, column: 5, scope: !240)
!261 = !DILocation(line: 51, column: 38, scope: !262)
!262 = distinct !DILexicalBlock(scope: !263, file: !148, line: 54, column: 5)
!263 = distinct !DILexicalBlock(scope: !235, file: !148, line: 53, column: 5)
!264 = !DILocation(line: 51, column: 5, scope: !262)
!265 = !DILocation(line: 54, column: 3, scope: !235)
!266 = !DILocation(line: 54, column: 38, scope: !267)
!267 = distinct !DILexicalBlock(scope: !268, file: !148, line: 56, column: 5)
!268 = distinct !DILexicalBlock(scope: !269, file: !148, line: 55, column: 5)
!269 = distinct !DILexicalBlock(scope: !230, file: !148, line: 54, column: 10)
!270 = !DILocation(line: 54, column: 5, scope: !267)
!271 = !DILocation(line: 56, column: 3, scope: !272)
!272 = distinct !DILexicalBlock(scope: !273, file: !148, line: 59, column: 3)
!273 = distinct !DILexicalBlock(scope: !193, file: !148, line: 58, column: 3)
!274 = !DILocation(line: 59, column: 14, scope: !275)
!275 = distinct !DILexicalBlock(scope: !273, file: !148, line: 58, column: 3)
!276 = !DILocalVariable(name: "numprogs", scope: !147, file: !148, line: 17, type: !13)
!277 = !DILocation(line: 60, column: 16, scope: !278)
!278 = distinct !DILexicalBlock(scope: !193, file: !148, line: 60, column: 7)
!279 = !DILocation(line: 60, column: 7, scope: !193)
!280 = !DILocation(line: 62, column: 38, scope: !281)
!281 = distinct !DILexicalBlock(scope: !282, file: !148, line: 62, column: 5)
!282 = distinct !DILexicalBlock(scope: !283, file: !148, line: 61, column: 5)
!283 = distinct !DILexicalBlock(scope: !278, file: !148, line: 60, column: 21)
!284 = !DILocation(line: 62, column: 5, scope: !281)
!285 = !DILocation(line: 63, column: 18, scope: !282)
!286 = !DILocation(line: 63, column: 5, scope: !287)
!287 = distinct !DILexicalBlock(scope: !288, file: !148, line: 66, column: 5)
!288 = distinct !DILexicalBlock(scope: !283, file: !148, line: 65, column: 5)
!289 = !DILocation(line: 0, scope: !283)
!290 = !DILocation(line: 63, column: 15, scope: !287)
!291 = !DILocation(line: 63, column: 16, scope: !292)
!292 = distinct !DILexicalBlock(scope: !293, file: !148, line: 63, column: 11)
!293 = distinct !DILexicalBlock(scope: !287, file: !148, line: 63, column: 15)
!294 = !DILocation(line: 63, column: 11, scope: !293)
!295 = !DILocation(line: 63, column: 9, scope: !296)
!296 = distinct !DILexicalBlock(scope: !292, file: !148, line: 63, column: 23)
!297 = !DILocation(line: 65, column: 40, scope: !298)
!298 = distinct !DILexicalBlock(scope: !299, file: !148, line: 66, column: 7)
!299 = distinct !DILexicalBlock(scope: !293, file: !148, line: 65, column: 7)
!300 = !DILocation(line: 65, column: 7, scope: !298)
!301 = !DILocation(line: 66, column: 13, scope: !302)
!302 = distinct !DILexicalBlock(scope: !299, file: !148, line: 68, column: 7)
!303 = !DILocation(line: 63, column: 9, scope: !299)
!304 = distinct !{!304, !286, !305}
!305 = !DILocation(line: 65, column: 5, scope: !287)
!306 = !DILocation(line: 67, column: 5, scope: !287)
!307 = !DILocation(line: 68, column: 38, scope: !308)
!308 = distinct !DILexicalBlock(scope: !309, file: !148, line: 71, column: 5)
!309 = distinct !DILexicalBlock(scope: !283, file: !148, line: 70, column: 5)
!310 = !DILocation(line: 68, column: 5, scope: !308)
!311 = !DILocation(line: 71, column: 3, scope: !283)
!312 = !DILocation(line: 71, column: 38, scope: !313)
!313 = distinct !DILexicalBlock(scope: !314, file: !148, line: 73, column: 5)
!314 = distinct !DILexicalBlock(scope: !315, file: !148, line: 72, column: 5)
!315 = distinct !DILexicalBlock(scope: !278, file: !148, line: 71, column: 10)
!316 = !DILocation(line: 71, column: 5, scope: !313)
!317 = !DILocation(line: 73, column: 3, scope: !318)
!318 = distinct !DILexicalBlock(scope: !319, file: !148, line: 76, column: 3)
!319 = distinct !DILexicalBlock(scope: !193, file: !148, line: 75, column: 3)
!320 = !DILocation(line: 75, column: 36, scope: !321)
!321 = distinct !DILexicalBlock(scope: !319, file: !148, line: 75, column: 3)
!322 = !DILocation(line: 75, column: 3, scope: !321)
!323 = !DILocation(line: 77, column: 3, scope: !324)
!324 = distinct !DILexicalBlock(scope: !319, file: !148, line: 77, column: 3)
!325 = !DILocation(line: 78, column: 3, scope: !326)
!326 = distinct !DILexicalBlock(scope: !319, file: !148, line: 79, column: 3)
!327 = !DILocation(line: 80, column: 3, scope: !328)
!328 = distinct !DILexicalBlock(scope: !319, file: !148, line: 80, column: 3)
!329 = !DILocation(line: 84, column: 1, scope: !147)
!330 = distinct !DISubprogram(name: "lakai_init", scope: !83, file: !83, line: 55, type: !331, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!331 = !DISubroutineType(types: !332)
!332 = !{null}
!333 = !DILocation(line: 59, column: 7, scope: !334)
!334 = distinct !DILexicalBlock(scope: !335, file: !83, line: 59, column: 7)
!335 = distinct !DILexicalBlock(scope: !330, file: !83, line: 59, column: 3)
!336 = !DILocation(line: 59, column: 16, scope: !334)
!337 = !DILocation(line: 59, column: 7, scope: !335)
!338 = !DILocalVariable(name: "i", scope: !330, file: !83, line: 57, type: !13)
!339 = !DILocation(line: 0, scope: !330)
!340 = !DILocation(line: 61, column: 5, scope: !341)
!341 = distinct !DILexicalBlock(scope: !342, file: !83, line: 63, column: 5)
!342 = distinct !DILexicalBlock(scope: !343, file: !83, line: 62, column: 5)
!343 = distinct !DILexicalBlock(scope: !334, file: !83, line: 59, column: 23)
!344 = !DILocation(line: 0, scope: !343)
!345 = !DILocation(line: 61, column: 15, scope: !341)
!346 = !DILocation(line: 61, column: 16, scope: !347)
!347 = distinct !DILexicalBlock(scope: !348, file: !83, line: 61, column: 11)
!348 = distinct !DILexicalBlock(scope: !341, file: !83, line: 61, column: 15)
!349 = !DILocation(line: 61, column: 11, scope: !348)
!350 = !DILocation(line: 61, column: 9, scope: !351)
!351 = distinct !DILexicalBlock(scope: !347, file: !83, line: 61, column: 23)
!352 = !DILocation(line: 62, column: 7, scope: !348)
!353 = !DILocation(line: 62, column: 19, scope: !348)
!354 = !DILocation(line: 61, column: 9, scope: !348)
!355 = distinct !{!355, !340, !356}
!356 = !DILocation(line: 62, column: 5, scope: !341)
!357 = !DILocation(line: 64, column: 5, scope: !341)
!358 = !DILocation(line: 67, column: 3, scope: !343)
!359 = !DILocation(line: 64, column: 3, scope: !335)
!360 = distinct !DISubprogram(name: "lakai_open", scope: !83, file: !83, line: 71, type: !361, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!361 = !DISubroutineType(types: !362)
!362 = !{!212, !15}
!363 = !DILocalVariable(name: "devname", arg: 1, scope: !360, file: !83, line: 71, type: !15)
!364 = !DILocation(line: 0, scope: !360)
!365 = !DILocalVariable(name: "k", scope: !360, file: !83, line: 74, type: !13)
!366 = !DILocation(line: 74, column: 7, scope: !360)
!367 = !DILocalVariable(name: "sg_scsiid", scope: !360, file: !83, line: 76, type: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sg_scsi_id", file: !369, line: 101, size: 256, elements: !370)
!369 = !DIFile(filename: "/usr/include/scsi/sg.h", directory: "")
!370 = !{!371, !372, !373, !374, !375, !376, !378, !379}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "host_no", scope: !368, file: !369, line: 102, baseType: !13, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !368, file: !369, line: 103, baseType: !13, size: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "scsi_id", scope: !368, file: !369, line: 104, baseType: !13, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "lun", scope: !368, file: !369, line: 105, baseType: !13, size: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "scsi_type", scope: !368, file: !369, line: 106, baseType: !13, size: 32, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "h_cmd_per_lun", scope: !368, file: !369, line: 107, baseType: !377, size: 16, offset: 160)
!377 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "d_queue_depth", scope: !368, file: !369, line: 108, baseType: !377, size: 16, offset: 176)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !368, file: !369, line: 109, baseType: !380, size: 64, offset: 192)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 2)
!383 = !DILocation(line: 76, column: 21, scope: !360)
!384 = !DILocalVariable(name: "__cil_tmp8", scope: !360, file: !83, line: 79, type: !15)
!385 = !DILocation(line: 79, column: 9, scope: !360)
!386 = !DILocalVariable(name: "__cil_tmp9", scope: !360, file: !83, line: 80, type: !15)
!387 = !DILocation(line: 80, column: 9, scope: !360)
!388 = !DILocalVariable(name: "__cil_tmp10", scope: !360, file: !83, line: 81, type: !15)
!389 = !DILocation(line: 81, column: 9, scope: !360)
!390 = !DILocalVariable(name: "__cil_tmp11", scope: !360, file: !83, line: 82, type: !15)
!391 = !DILocation(line: 82, column: 9, scope: !360)
!392 = !DILocalVariable(name: "__cil_tmp12", scope: !360, file: !83, line: 83, type: !15)
!393 = !DILocation(line: 83, column: 9, scope: !360)
!394 = !DILocalVariable(name: "__cil_tmp13", scope: !360, file: !83, line: 84, type: !15)
!395 = !DILocation(line: 84, column: 9, scope: !360)
!396 = !DILocalVariable(name: "__cil_tmp14", scope: !360, file: !83, line: 85, type: !15)
!397 = !DILocation(line: 85, column: 9, scope: !360)
!398 = !DILocalVariable(name: "__cil_tmp15", scope: !360, file: !83, line: 86, type: !15)
!399 = !DILocation(line: 86, column: 9, scope: !360)
!400 = !DILocation(line: 77, column: 7, scope: !401)
!401 = distinct !DILexicalBlock(scope: !402, file: !83, line: 77, column: 7)
!402 = distinct !DILexicalBlock(scope: !360, file: !83, line: 88, column: 3)
!403 = !DILocation(line: 77, column: 16, scope: !401)
!404 = !DILocation(line: 77, column: 7, scope: !402)
!405 = !DILocation(line: 79, column: 38, scope: !406)
!406 = distinct !DILexicalBlock(scope: !407, file: !83, line: 79, column: 5)
!407 = distinct !DILexicalBlock(scope: !408, file: !83, line: 78, column: 5)
!408 = distinct !DILexicalBlock(scope: !401, file: !83, line: 77, column: 23)
!409 = !DILocation(line: 79, column: 5, scope: !406)
!410 = !DILocation(line: 80, column: 5, scope: !408)
!411 = !DILocalVariable(name: "slotpos", scope: !360, file: !83, line: 75, type: !13)
!412 = !DILocation(line: 83, column: 3, scope: !413)
!413 = distinct !DILexicalBlock(scope: !414, file: !83, line: 85, column: 3)
!414 = distinct !DILexicalBlock(scope: !402, file: !83, line: 84, column: 3)
!415 = !DILocation(line: 0, scope: !402)
!416 = !DILocation(line: 83, column: 13, scope: !413)
!417 = !DILocation(line: 83, column: 20, scope: !418)
!418 = distinct !DILexicalBlock(scope: !419, file: !83, line: 83, column: 9)
!419 = distinct !DILexicalBlock(scope: !413, file: !83, line: 83, column: 13)
!420 = !DILocation(line: 83, column: 9, scope: !419)
!421 = !DILocation(line: 83, column: 7, scope: !422)
!422 = distinct !DILexicalBlock(scope: !418, file: !83, line: 83, column: 27)
!423 = !DILocation(line: 85, column: 9, scope: !424)
!424 = distinct !DILexicalBlock(scope: !419, file: !83, line: 85, column: 9)
!425 = !DILocation(line: 85, column: 27, scope: !424)
!426 = !DILocation(line: 85, column: 9, scope: !419)
!427 = !DILocation(line: 86, column: 7, scope: !428)
!428 = distinct !DILexicalBlock(scope: !424, file: !83, line: 85, column: 34)
!429 = !DILocation(line: 83, column: 13, scope: !419)
!430 = distinct !{!430, !412, !431}
!431 = !DILocation(line: 84, column: 3, scope: !413)
!432 = !DILocation(line: 86, column: 3, scope: !413)
!433 = !DILocation(line: 88, column: 15, scope: !434)
!434 = distinct !DILexicalBlock(scope: !402, file: !83, line: 88, column: 7)
!435 = !DILocation(line: 88, column: 7, scope: !402)
!436 = !DILocation(line: 90, column: 38, scope: !437)
!437 = distinct !DILexicalBlock(scope: !438, file: !83, line: 90, column: 5)
!438 = distinct !DILexicalBlock(scope: !439, file: !83, line: 89, column: 5)
!439 = distinct !DILexicalBlock(scope: !434, file: !83, line: 88, column: 22)
!440 = !DILocation(line: 90, column: 5, scope: !437)
!441 = !DILocation(line: 91, column: 5, scope: !439)
!442 = !DILocation(line: 95, column: 11, scope: !443)
!443 = distinct !DILexicalBlock(scope: !444, file: !83, line: 94, column: 3)
!444 = distinct !DILexicalBlock(scope: !402, file: !83, line: 93, column: 3)
!445 = !DILocalVariable(name: "sg_fd", scope: !360, file: !83, line: 73, type: !13)
!446 = !DILocation(line: 96, column: 13, scope: !447)
!447 = distinct !DILexicalBlock(scope: !402, file: !83, line: 96, column: 7)
!448 = !DILocation(line: 96, column: 7, scope: !402)
!449 = !DILocation(line: 98, column: 38, scope: !450)
!450 = distinct !DILexicalBlock(scope: !451, file: !83, line: 98, column: 5)
!451 = distinct !DILexicalBlock(scope: !452, file: !83, line: 97, column: 5)
!452 = distinct !DILexicalBlock(scope: !447, file: !83, line: 96, column: 18)
!453 = !DILocation(line: 98, column: 5, scope: !450)
!454 = !DILocation(line: 99, column: 5, scope: !452)
!455 = !DILocation(line: 102, column: 9, scope: !456)
!456 = distinct !DILexicalBlock(scope: !457, file: !83, line: 102, column: 3)
!457 = distinct !DILexicalBlock(scope: !402, file: !83, line: 101, column: 3)
!458 = !DILocalVariable(name: "tmp", scope: !360, file: !83, line: 77, type: !13)
!459 = !DILocation(line: 102, column: 11, scope: !460)
!460 = distinct !DILexicalBlock(scope: !402, file: !83, line: 102, column: 7)
!461 = !DILocation(line: 102, column: 7, scope: !402)
!462 = !DILocation(line: 104, column: 38, scope: !463)
!463 = distinct !DILexicalBlock(scope: !464, file: !83, line: 104, column: 5)
!464 = distinct !DILexicalBlock(scope: !465, file: !83, line: 103, column: 5)
!465 = distinct !DILexicalBlock(scope: !460, file: !83, line: 102, column: 16)
!466 = !DILocation(line: 104, column: 5, scope: !463)
!467 = !DILocation(line: 105, column: 5, scope: !465)
!468 = !DILocation(line: 108, column: 7, scope: !469)
!469 = distinct !DILexicalBlock(scope: !402, file: !83, line: 108, column: 7)
!470 = !DILocation(line: 108, column: 9, scope: !469)
!471 = !DILocation(line: 108, column: 7, scope: !402)
!472 = !DILocation(line: 110, column: 38, scope: !473)
!473 = distinct !DILexicalBlock(scope: !474, file: !83, line: 110, column: 5)
!474 = distinct !DILexicalBlock(scope: !475, file: !83, line: 109, column: 5)
!475 = distinct !DILexicalBlock(scope: !469, file: !83, line: 108, column: 18)
!476 = !DILocation(line: 110, column: 5, scope: !473)
!477 = !DILocation(line: 111, column: 38, scope: !478)
!478 = distinct !DILexicalBlock(scope: !474, file: !83, line: 112, column: 5)
!479 = !DILocation(line: 111, column: 5, scope: !478)
!480 = !DILocation(line: 112, column: 5, scope: !481)
!481 = distinct !DILexicalBlock(scope: !474, file: !83, line: 113, column: 5)
!482 = !DILocation(line: 113, column: 5, scope: !475)
!483 = !DILocation(line: 117, column: 13, scope: !484)
!484 = distinct !DILexicalBlock(scope: !485, file: !83, line: 116, column: 3)
!485 = distinct !DILexicalBlock(scope: !402, file: !83, line: 115, column: 3)
!486 = !DILocalVariable(name: "tmp___0", scope: !360, file: !83, line: 78, type: !13)
!487 = !DILocation(line: 117, column: 15, scope: !488)
!488 = distinct !DILexicalBlock(scope: !402, file: !83, line: 117, column: 7)
!489 = !DILocation(line: 117, column: 7, scope: !402)
!490 = !DILocation(line: 119, column: 38, scope: !491)
!491 = distinct !DILexicalBlock(scope: !492, file: !83, line: 119, column: 5)
!492 = distinct !DILexicalBlock(scope: !493, file: !83, line: 118, column: 5)
!493 = distinct !DILexicalBlock(scope: !488, file: !83, line: 117, column: 20)
!494 = !DILocation(line: 119, column: 5, scope: !491)
!495 = !DILocation(line: 120, column: 5, scope: !496)
!496 = distinct !DILexicalBlock(scope: !492, file: !83, line: 121, column: 5)
!497 = !DILocation(line: 121, column: 5, scope: !493)
!498 = !DILocation(line: 134, column: 17, scope: !499)
!499 = distinct !DILexicalBlock(scope: !402, file: !83, line: 134, column: 7)
!500 = !DILocation(line: 134, column: 27, scope: !499)
!501 = !DILocation(line: 134, column: 7, scope: !402)
!502 = !DILocation(line: 136, column: 38, scope: !503)
!503 = distinct !DILexicalBlock(scope: !504, file: !83, line: 136, column: 5)
!504 = distinct !DILexicalBlock(scope: !505, file: !83, line: 135, column: 5)
!505 = distinct !DILexicalBlock(scope: !499, file: !83, line: 134, column: 33)
!506 = !DILocation(line: 136, column: 5, scope: !503)
!507 = !DILocation(line: 137, column: 5, scope: !508)
!508 = distinct !DILexicalBlock(scope: !504, file: !83, line: 138, column: 5)
!509 = !DILocation(line: 138, column: 5, scope: !505)
!510 = !DILocation(line: 142, column: 12, scope: !402)
!511 = !DILocation(line: 143, column: 3, scope: !402)
!512 = !DILocation(line: 143, column: 21, scope: !402)
!513 = !DILocation(line: 145, column: 3, scope: !402)
!514 = !DILocation(line: 147, column: 1, scope: !360)
!515 = distinct !DISubprogram(name: "lakai_close", scope: !83, file: !83, line: 154, type: !516, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!516 = !DISubroutineType(types: !517)
!517 = !{!13, !212}
!518 = !DILocalVariable(name: "handle", arg: 1, scope: !515, file: !83, line: 154, type: !212)
!519 = !DILocation(line: 0, scope: !515)
!520 = !DILocalVariable(name: "__cil_tmp2", scope: !515, file: !83, line: 156, type: !15)
!521 = !DILocation(line: 156, column: 9, scope: !515)
!522 = !DILocalVariable(name: "__cil_tmp3", scope: !515, file: !83, line: 157, type: !15)
!523 = !DILocation(line: 157, column: 9, scope: !515)
!524 = !DILocalVariable(name: "__cil_tmp4", scope: !515, file: !83, line: 158, type: !15)
!525 = !DILocation(line: 158, column: 9, scope: !515)
!526 = !DILocation(line: 156, column: 7, scope: !527)
!527 = distinct !DILexicalBlock(scope: !528, file: !83, line: 156, column: 7)
!528 = distinct !DILexicalBlock(scope: !515, file: !83, line: 160, column: 3)
!529 = !DILocation(line: 156, column: 24, scope: !527)
!530 = !DILocation(line: 156, column: 7, scope: !528)
!531 = !DILocation(line: 158, column: 38, scope: !532)
!532 = distinct !DILexicalBlock(scope: !533, file: !83, line: 158, column: 5)
!533 = distinct !DILexicalBlock(scope: !534, file: !83, line: 157, column: 5)
!534 = distinct !DILexicalBlock(scope: !527, file: !83, line: 156, column: 31)
!535 = !DILocation(line: 158, column: 5, scope: !532)
!536 = !DILocation(line: 159, column: 5, scope: !534)
!537 = !DILocation(line: 156, column: 14, scope: !538)
!538 = distinct !DILexicalBlock(scope: !527, file: !83, line: 156, column: 7)
!539 = !DILocation(line: 158, column: 38, scope: !540)
!540 = distinct !DILexicalBlock(scope: !541, file: !83, line: 158, column: 5)
!541 = distinct !DILexicalBlock(scope: !542, file: !83, line: 157, column: 5)
!542 = distinct !DILexicalBlock(scope: !538, file: !83, line: 156, column: 19)
!543 = !DILocation(line: 158, column: 5, scope: !540)
!544 = !DILocation(line: 159, column: 5, scope: !542)
!545 = !DILocation(line: 156, column: 14, scope: !546)
!546 = distinct !DILexicalBlock(scope: !538, file: !83, line: 156, column: 7)
!547 = !DILocation(line: 156, column: 7, scope: !538)
!548 = !DILocation(line: 158, column: 38, scope: !549)
!549 = distinct !DILexicalBlock(scope: !550, file: !83, line: 158, column: 5)
!550 = distinct !DILexicalBlock(scope: !551, file: !83, line: 157, column: 5)
!551 = distinct !DILexicalBlock(scope: !546, file: !83, line: 156, column: 20)
!552 = !DILocation(line: 158, column: 5, scope: !549)
!553 = !DILocation(line: 159, column: 5, scope: !551)
!554 = !DILocation(line: 161, column: 9, scope: !555)
!555 = distinct !DILexicalBlock(scope: !556, file: !83, line: 162, column: 3)
!556 = distinct !DILexicalBlock(scope: !528, file: !83, line: 161, column: 3)
!557 = !DILocation(line: 161, column: 3, scope: !555)
!558 = !DILocation(line: 162, column: 3, scope: !556)
!559 = !DILocation(line: 162, column: 20, scope: !556)
!560 = !DILocation(line: 163, column: 12, scope: !556)
!561 = !DILocation(line: 164, column: 3, scope: !528)
!562 = !DILocation(line: 0, scope: !528)
!563 = !DILocation(line: 166, column: 1, scope: !515)
!564 = distinct !DISubprogram(name: "lakai_get_sample_list", scope: !83, file: !83, line: 355, type: !565, scopeLine: 356, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!565 = !DISubroutineType(types: !566)
!566 = !{!13, !212, !567}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!568 = !DILocalVariable(name: "handle", arg: 1, scope: !564, file: !83, line: 355, type: !212)
!569 = !DILocation(line: 0, scope: !564)
!570 = !DILocalVariable(name: "ls", arg: 2, scope: !564, file: !83, line: 355, type: !567)
!571 = !DILocalVariable(name: "finalbuf", scope: !564, file: !83, line: 357, type: !572)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 16384, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 2048)
!575 = !DILocation(line: 357, column: 17, scope: !564)
!576 = !DILocalVariable(name: "__cil_tmp9", scope: !564, file: !83, line: 363, type: !58)
!577 = !DILocation(line: 363, column: 9, scope: !564)
!578 = !DILocalVariable(name: "__cil_tmp10", scope: !564, file: !83, line: 364, type: !15)
!579 = !DILocation(line: 364, column: 9, scope: !564)
!580 = !DILocalVariable(name: "__cil_tmp11", scope: !564, file: !83, line: 365, type: !15)
!581 = !DILocation(line: 365, column: 9, scope: !564)
!582 = !DILocalVariable(name: "__cil_tmp12", scope: !564, file: !83, line: 366, type: !15)
!583 = !DILocation(line: 366, column: 9, scope: !564)
!584 = !DILocalVariable(name: "__cil_tmp13", scope: !564, file: !83, line: 367, type: !15)
!585 = !DILocation(line: 367, column: 9, scope: !564)
!586 = !DILocalVariable(name: "__cil_tmp14", scope: !564, file: !83, line: 368, type: !15)
!587 = !DILocation(line: 368, column: 9, scope: !564)
!588 = !DILocalVariable(name: "__cil_tmp15", scope: !564, file: !83, line: 369, type: !15)
!589 = !DILocation(line: 369, column: 9, scope: !564)
!590 = !DILocalVariable(name: "__cil_tmp16", scope: !564, file: !83, line: 370, type: !15)
!591 = !DILocation(line: 370, column: 9, scope: !564)
!592 = !DILocalVariable(name: "__cil_tmp17", scope: !564, file: !83, line: 371, type: !15)
!593 = !DILocation(line: 371, column: 9, scope: !564)
!594 = !DILocation(line: 363, column: 7, scope: !595)
!595 = distinct !DILexicalBlock(scope: !596, file: !83, line: 363, column: 7)
!596 = distinct !DILexicalBlock(scope: !564, file: !83, line: 373, column: 3)
!597 = !DILocation(line: 363, column: 24, scope: !595)
!598 = !DILocation(line: 363, column: 7, scope: !596)
!599 = !DILocation(line: 365, column: 38, scope: !600)
!600 = distinct !DILexicalBlock(scope: !601, file: !83, line: 365, column: 5)
!601 = distinct !DILexicalBlock(scope: !602, file: !83, line: 364, column: 5)
!602 = distinct !DILexicalBlock(scope: !595, file: !83, line: 363, column: 31)
!603 = !DILocation(line: 365, column: 5, scope: !600)
!604 = !DILocation(line: 366, column: 5, scope: !602)
!605 = !DILocation(line: 363, column: 14, scope: !606)
!606 = distinct !DILexicalBlock(scope: !595, file: !83, line: 363, column: 7)
!607 = !DILocation(line: 365, column: 38, scope: !608)
!608 = distinct !DILexicalBlock(scope: !609, file: !83, line: 365, column: 5)
!609 = distinct !DILexicalBlock(scope: !610, file: !83, line: 364, column: 5)
!610 = distinct !DILexicalBlock(scope: !606, file: !83, line: 363, column: 19)
!611 = !DILocation(line: 365, column: 5, scope: !608)
!612 = !DILocation(line: 366, column: 5, scope: !610)
!613 = !DILocation(line: 363, column: 14, scope: !614)
!614 = distinct !DILexicalBlock(scope: !606, file: !83, line: 363, column: 7)
!615 = !DILocation(line: 363, column: 7, scope: !606)
!616 = !DILocation(line: 365, column: 38, scope: !617)
!617 = distinct !DILexicalBlock(scope: !618, file: !83, line: 365, column: 5)
!618 = distinct !DILexicalBlock(scope: !619, file: !83, line: 364, column: 5)
!619 = distinct !DILexicalBlock(scope: !614, file: !83, line: 363, column: 20)
!620 = !DILocation(line: 365, column: 5, scope: !617)
!621 = !DILocation(line: 366, column: 5, scope: !619)
!622 = !DILocation(line: 370, column: 40, scope: !623)
!623 = distinct !DILexicalBlock(scope: !624, file: !83, line: 369, column: 3)
!624 = distinct !DILexicalBlock(scope: !596, file: !83, line: 368, column: 3)
!625 = !DILocation(line: 369, column: 14, scope: !623)
!626 = !DILocalVariable(name: "finallen", scope: !564, file: !83, line: 359, type: !13)
!627 = !DILocation(line: 370, column: 19, scope: !628)
!628 = distinct !DILexicalBlock(scope: !596, file: !83, line: 370, column: 7)
!629 = !DILocation(line: 370, column: 7, scope: !596)
!630 = !DILocation(line: 379, column: 38, scope: !631)
!631 = distinct !DILexicalBlock(scope: !632, file: !83, line: 372, column: 5)
!632 = distinct !DILexicalBlock(scope: !633, file: !83, line: 371, column: 5)
!633 = distinct !DILexicalBlock(scope: !628, file: !83, line: 370, column: 25)
!634 = !DILocation(line: 379, column: 5, scope: !631)
!635 = !DILocation(line: 382, column: 3, scope: !633)
!636 = !DILocation(line: 382, column: 22, scope: !596)
!637 = !DILocation(line: 382, column: 16, scope: !596)
!638 = !DILocation(line: 382, column: 48, scope: !596)
!639 = !DILocation(line: 382, column: 42, scope: !596)
!640 = !DILocation(line: 382, column: 40, scope: !596)
!641 = !DILocation(line: 382, column: 34, scope: !596)
!642 = !DILocalVariable(name: "numsamples", scope: !564, file: !83, line: 360, type: !13)
!643 = !DILocation(line: 384, column: 13, scope: !644)
!644 = distinct !DILexicalBlock(scope: !596, file: !83, line: 384, column: 7)
!645 = !DILocation(line: 384, column: 7, scope: !644)
!646 = !DILocation(line: 384, column: 25, scope: !644)
!647 = !DILocation(line: 384, column: 7, scope: !596)
!648 = !DILocation(line: 384, column: 17, scope: !649)
!649 = distinct !DILexicalBlock(scope: !650, file: !83, line: 384, column: 9)
!650 = distinct !DILexicalBlock(scope: !644, file: !83, line: 384, column: 33)
!651 = !DILocation(line: 384, column: 26, scope: !649)
!652 = !DILocation(line: 384, column: 15, scope: !649)
!653 = !DILocation(line: 384, column: 9, scope: !649)
!654 = !DILocation(line: 384, column: 31, scope: !649)
!655 = !DILocation(line: 384, column: 9, scope: !650)
!656 = !DILocation(line: 386, column: 30, scope: !657)
!657 = distinct !DILexicalBlock(scope: !658, file: !83, line: 386, column: 7)
!658 = distinct !DILexicalBlock(scope: !659, file: !83, line: 385, column: 7)
!659 = distinct !DILexicalBlock(scope: !649, file: !83, line: 384, column: 37)
!660 = !DILocation(line: 386, column: 57, scope: !657)
!661 = !DILocation(line: 386, column: 20, scope: !657)
!662 = !DILocation(line: 386, column: 13, scope: !657)
!663 = !DILocalVariable(name: "tmp", scope: !564, file: !83, line: 361, type: !58)
!664 = !DILocation(line: 386, column: 25, scope: !658)
!665 = !DILocation(line: 386, column: 11, scope: !658)
!666 = !DILocation(line: 386, column: 23, scope: !658)
!667 = !DILocation(line: 387, column: 17, scope: !668)
!668 = distinct !DILexicalBlock(scope: !659, file: !83, line: 387, column: 11)
!669 = !DILocation(line: 387, column: 13, scope: !668)
!670 = !DILocation(line: 387, column: 11, scope: !659)
!671 = !DILocation(line: 389, column: 42, scope: !672)
!672 = distinct !DILexicalBlock(scope: !673, file: !83, line: 389, column: 9)
!673 = distinct !DILexicalBlock(scope: !674, file: !83, line: 388, column: 9)
!674 = distinct !DILexicalBlock(scope: !668, file: !83, line: 387, column: 30)
!675 = !DILocation(line: 389, column: 9, scope: !672)
!676 = !DILocation(line: 390, column: 9, scope: !674)
!677 = !DILocalVariable(name: "i", scope: !564, file: !83, line: 358, type: !13)
!678 = !DILocation(line: 392, column: 7, scope: !679)
!679 = distinct !DILexicalBlock(scope: !680, file: !83, line: 394, column: 7)
!680 = distinct !DILexicalBlock(scope: !659, file: !83, line: 393, column: 7)
!681 = !DILocation(line: 0, scope: !659)
!682 = !DILocation(line: 392, column: 17, scope: !679)
!683 = !DILocation(line: 392, column: 18, scope: !684)
!684 = distinct !DILexicalBlock(scope: !685, file: !83, line: 392, column: 13)
!685 = distinct !DILexicalBlock(scope: !679, file: !83, line: 392, column: 17)
!686 = !DILocation(line: 392, column: 13, scope: !685)
!687 = !DILocation(line: 392, column: 11, scope: !688)
!688 = distinct !DILexicalBlock(scope: !684, file: !83, line: 392, column: 33)
!689 = !DILocation(line: 394, column: 19, scope: !690)
!690 = distinct !DILexicalBlock(scope: !691, file: !83, line: 395, column: 9)
!691 = distinct !DILexicalBlock(scope: !685, file: !83, line: 394, column: 9)
!692 = !DILocalVariable(name: "tmp___0", scope: !564, file: !83, line: 362, type: !58)
!693 = !DILocation(line: 394, column: 15, scope: !691)
!694 = !DILocation(line: 394, column: 27, scope: !691)
!695 = !DILocation(line: 394, column: 32, scope: !691)
!696 = !DILocation(line: 395, column: 21, scope: !697)
!697 = distinct !DILexicalBlock(scope: !685, file: !83, line: 395, column: 13)
!698 = !DILocation(line: 395, column: 33, scope: !697)
!699 = !DILocation(line: 395, column: 15, scope: !697)
!700 = !DILocation(line: 395, column: 13, scope: !685)
!701 = !DILocation(line: 397, column: 44, scope: !702)
!702 = distinct !DILexicalBlock(scope: !703, file: !83, line: 397, column: 11)
!703 = distinct !DILexicalBlock(scope: !704, file: !83, line: 396, column: 11)
!704 = distinct !DILexicalBlock(scope: !697, file: !83, line: 395, column: 39)
!705 = !DILocation(line: 397, column: 11, scope: !702)
!706 = !DILocation(line: 398, column: 11, scope: !704)
!707 = !DILocation(line: 400, column: 37, scope: !708)
!708 = distinct !DILexicalBlock(scope: !709, file: !83, line: 401, column: 9)
!709 = distinct !DILexicalBlock(scope: !685, file: !83, line: 400, column: 9)
!710 = !DILocation(line: 400, column: 46, scope: !708)
!711 = !DILocation(line: 400, column: 55, scope: !708)
!712 = !DILocation(line: 400, column: 51, scope: !708)
!713 = !DILocation(line: 400, column: 68, scope: !708)
!714 = !DILocation(line: 400, column: 80, scope: !708)
!715 = !DILocation(line: 400, column: 62, scope: !708)
!716 = !DILocation(line: 400, column: 9, scope: !708)
!717 = !DILocation(line: 401, column: 17, scope: !709)
!718 = !DILocation(line: 401, column: 29, scope: !709)
!719 = !DILocation(line: 401, column: 11, scope: !709)
!720 = !DILocation(line: 401, column: 34, scope: !709)
!721 = !DILocation(line: 401, column: 40, scope: !709)
!722 = !DILocation(line: 392, column: 11, scope: !709)
!723 = distinct !{!723, !678, !724}
!724 = !DILocation(line: 394, column: 7, scope: !679)
!725 = !DILocation(line: 396, column: 7, scope: !679)
!726 = !DILocation(line: 403, column: 11, scope: !659)
!727 = !DILocation(line: 403, column: 22, scope: !659)
!728 = !DILocation(line: 404, column: 5, scope: !659)
!729 = !DILocation(line: 407, column: 40, scope: !730)
!730 = distinct !DILexicalBlock(scope: !731, file: !83, line: 406, column: 7)
!731 = distinct !DILexicalBlock(scope: !732, file: !83, line: 405, column: 7)
!732 = distinct !DILexicalBlock(scope: !649, file: !83, line: 404, column: 12)
!733 = !DILocation(line: 407, column: 7, scope: !730)
!734 = !DILocation(line: 408, column: 7, scope: !732)
!735 = !DILocation(line: 410, column: 3, scope: !650)
!736 = !DILocation(line: 407, column: 38, scope: !737)
!737 = distinct !DILexicalBlock(scope: !738, file: !83, line: 412, column: 5)
!738 = distinct !DILexicalBlock(scope: !739, file: !83, line: 411, column: 5)
!739 = distinct !DILexicalBlock(scope: !644, file: !83, line: 410, column: 10)
!740 = !DILocation(line: 407, column: 5, scope: !737)
!741 = !DILocation(line: 408, column: 5, scope: !739)
!742 = !DILocation(line: 411, column: 3, scope: !596)
!743 = !DILocation(line: 0, scope: !596)
!744 = !DILocation(line: 413, column: 1, scope: !564)
!745 = distinct !DISubprogram(name: "lakai_delete_sample", scope: !83, file: !83, line: 841, type: !746, scopeLine: 842, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!746 = !DISubroutineType(types: !747)
!747 = !{!13, !212, !13}
!748 = !DILocalVariable(name: "handle", arg: 1, scope: !745, file: !83, line: 841, type: !212)
!749 = !DILocation(line: 0, scope: !745)
!750 = !DILocalVariable(name: "samplenum", arg: 2, scope: !745, file: !83, line: 841, type: !13)
!751 = !DILocalVariable(name: "statusbuf", scope: !745, file: !83, line: 843, type: !752)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 800, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 100)
!755 = !DILocation(line: 843, column: 17, scope: !745)
!756 = !DILocalVariable(name: "__cil_tmp5", scope: !745, file: !83, line: 845, type: !58)
!757 = !DILocation(line: 845, column: 9, scope: !745)
!758 = !DILocalVariable(name: "__cil_tmp6", scope: !745, file: !83, line: 846, type: !15)
!759 = !DILocation(line: 846, column: 9, scope: !745)
!760 = !DILocalVariable(name: "__cil_tmp7", scope: !745, file: !83, line: 847, type: !15)
!761 = !DILocation(line: 847, column: 9, scope: !745)
!762 = !DILocalVariable(name: "__cil_tmp8", scope: !745, file: !83, line: 848, type: !15)
!763 = !DILocation(line: 848, column: 9, scope: !745)
!764 = !DILocalVariable(name: "__cil_tmp9", scope: !745, file: !83, line: 849, type: !15)
!765 = !DILocation(line: 849, column: 9, scope: !745)
!766 = !DILocalVariable(name: "__cil_tmp10", scope: !745, file: !83, line: 850, type: !15)
!767 = !DILocation(line: 850, column: 9, scope: !745)
!768 = !DILocalVariable(name: "__cil_tmp11", scope: !745, file: !83, line: 851, type: !15)
!769 = !DILocation(line: 851, column: 9, scope: !745)
!770 = !DILocation(line: 849, column: 7, scope: !771)
!771 = distinct !DILexicalBlock(scope: !772, file: !83, line: 849, column: 7)
!772 = distinct !DILexicalBlock(scope: !745, file: !83, line: 853, column: 3)
!773 = !DILocation(line: 849, column: 24, scope: !771)
!774 = !DILocation(line: 849, column: 7, scope: !772)
!775 = !DILocation(line: 851, column: 38, scope: !776)
!776 = distinct !DILexicalBlock(scope: !777, file: !83, line: 851, column: 5)
!777 = distinct !DILexicalBlock(scope: !778, file: !83, line: 850, column: 5)
!778 = distinct !DILexicalBlock(scope: !771, file: !83, line: 849, column: 31)
!779 = !DILocation(line: 851, column: 5, scope: !776)
!780 = !DILocation(line: 852, column: 5, scope: !778)
!781 = !DILocation(line: 849, column: 14, scope: !782)
!782 = distinct !DILexicalBlock(scope: !771, file: !83, line: 849, column: 7)
!783 = !DILocation(line: 851, column: 38, scope: !784)
!784 = distinct !DILexicalBlock(scope: !785, file: !83, line: 851, column: 5)
!785 = distinct !DILexicalBlock(scope: !786, file: !83, line: 850, column: 5)
!786 = distinct !DILexicalBlock(scope: !782, file: !83, line: 849, column: 19)
!787 = !DILocation(line: 851, column: 5, scope: !784)
!788 = !DILocation(line: 852, column: 5, scope: !786)
!789 = !DILocation(line: 849, column: 14, scope: !790)
!790 = distinct !DILexicalBlock(scope: !782, file: !83, line: 849, column: 7)
!791 = !DILocation(line: 849, column: 7, scope: !782)
!792 = !DILocation(line: 851, column: 38, scope: !793)
!793 = distinct !DILexicalBlock(scope: !794, file: !83, line: 851, column: 5)
!794 = distinct !DILexicalBlock(scope: !795, file: !83, line: 850, column: 5)
!795 = distinct !DILexicalBlock(scope: !790, file: !83, line: 849, column: 20)
!796 = !DILocation(line: 851, column: 5, scope: !793)
!797 = !DILocation(line: 852, column: 5, scope: !795)
!798 = !DILocation(line: 855, column: 17, scope: !799)
!799 = distinct !DILexicalBlock(scope: !772, file: !83, line: 855, column: 7)
!800 = !DILocation(line: 855, column: 7, scope: !772)
!801 = !DILocation(line: 857, column: 38, scope: !802)
!802 = distinct !DILexicalBlock(scope: !803, file: !83, line: 857, column: 5)
!803 = distinct !DILexicalBlock(scope: !804, file: !83, line: 856, column: 5)
!804 = distinct !DILexicalBlock(scope: !799, file: !83, line: 855, column: 22)
!805 = !DILocation(line: 857, column: 5, scope: !802)
!806 = !DILocation(line: 858, column: 5, scope: !804)
!807 = !DILocation(line: 855, column: 17, scope: !808)
!808 = distinct !DILexicalBlock(scope: !799, file: !83, line: 855, column: 7)
!809 = !DILocation(line: 855, column: 7, scope: !799)
!810 = !DILocation(line: 857, column: 38, scope: !811)
!811 = distinct !DILexicalBlock(scope: !812, file: !83, line: 857, column: 5)
!812 = distinct !DILexicalBlock(scope: !813, file: !83, line: 856, column: 5)
!813 = distinct !DILexicalBlock(scope: !808, file: !83, line: 855, column: 26)
!814 = !DILocation(line: 857, column: 5, scope: !811)
!815 = !DILocation(line: 858, column: 5, scope: !813)
!816 = !DILocation(line: 861, column: 47, scope: !817)
!817 = distinct !DILexicalBlock(scope: !772, file: !83, line: 860, column: 3)
!818 = !DILocation(line: 861, column: 20, scope: !817)
!819 = !DILocation(line: 861, column: 18, scope: !817)
!820 = !DILocation(line: 862, column: 55, scope: !817)
!821 = !DILocation(line: 862, column: 49, scope: !817)
!822 = !DILocation(line: 862, column: 70, scope: !817)
!823 = !DILocation(line: 862, column: 47, scope: !817)
!824 = !DILocation(line: 862, column: 20, scope: !817)
!825 = !DILocation(line: 862, column: 18, scope: !817)
!826 = !DILocation(line: 865, column: 41, scope: !827)
!827 = distinct !DILexicalBlock(scope: !817, file: !83, line: 863, column: 3)
!828 = !DILocation(line: 864, column: 15, scope: !827)
!829 = !DILocalVariable(name: "statuslen", scope: !745, file: !83, line: 844, type: !13)
!830 = !DILocation(line: 866, column: 20, scope: !831)
!831 = distinct !DILexicalBlock(scope: !772, file: !83, line: 866, column: 7)
!832 = !DILocation(line: 866, column: 7, scope: !772)
!833 = !DILocation(line: 875, column: 38, scope: !834)
!834 = distinct !DILexicalBlock(scope: !835, file: !83, line: 868, column: 5)
!835 = distinct !DILexicalBlock(scope: !836, file: !83, line: 867, column: 5)
!836 = distinct !DILexicalBlock(scope: !831, file: !83, line: 866, column: 26)
!837 = !DILocation(line: 875, column: 5, scope: !834)
!838 = !DILocation(line: 878, column: 3, scope: !836)
!839 = !DILocation(line: 878, column: 3, scope: !772)
!840 = !DILocation(line: 0, scope: !772)
!841 = !DILocation(line: 880, column: 1, scope: !745)
!842 = distinct !DISubprogram(name: "lakai_free_sample_list", scope: !83, file: !83, line: 418, type: !843, scopeLine: 419, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!843 = !DISubroutineType(types: !844)
!844 = !{null, !567}
!845 = !DILocalVariable(name: "ls", arg: 1, scope: !842, file: !83, line: 418, type: !567)
!846 = !DILocation(line: 0, scope: !842)
!847 = !DILocation(line: 422, column: 7, scope: !848)
!848 = distinct !DILexicalBlock(scope: !849, file: !83, line: 422, column: 7)
!849 = distinct !DILexicalBlock(scope: !842, file: !83, line: 422, column: 3)
!850 = !DILocation(line: 422, column: 7, scope: !849)
!851 = !DILocation(line: 424, column: 13, scope: !852)
!852 = distinct !DILexicalBlock(scope: !853, file: !83, line: 424, column: 9)
!853 = distinct !DILexicalBlock(scope: !848, file: !83, line: 422, column: 11)
!854 = !DILocation(line: 424, column: 24, scope: !852)
!855 = !DILocation(line: 424, column: 9, scope: !853)
!856 = !DILocalVariable(name: "i", scope: !842, file: !83, line: 420, type: !13)
!857 = !DILocation(line: 426, column: 7, scope: !858)
!858 = distinct !DILexicalBlock(scope: !859, file: !83, line: 428, column: 7)
!859 = distinct !DILexicalBlock(scope: !860, file: !83, line: 427, column: 7)
!860 = distinct !DILexicalBlock(scope: !852, file: !83, line: 424, column: 29)
!861 = !DILocation(line: 0, scope: !860)
!862 = !DILocation(line: 426, column: 17, scope: !858)
!863 = !DILocation(line: 426, column: 24, scope: !864)
!864 = distinct !DILexicalBlock(scope: !865, file: !83, line: 426, column: 13)
!865 = distinct !DILexicalBlock(scope: !858, file: !83, line: 426, column: 17)
!866 = !DILocation(line: 426, column: 18, scope: !864)
!867 = !DILocation(line: 426, column: 13, scope: !865)
!868 = !DILocation(line: 426, column: 11, scope: !869)
!869 = distinct !DILexicalBlock(scope: !864, file: !83, line: 426, column: 37)
!870 = !DILocation(line: 428, column: 19, scope: !871)
!871 = distinct !DILexicalBlock(scope: !865, file: !83, line: 428, column: 13)
!872 = !DILocation(line: 428, column: 31, scope: !871)
!873 = !DILocation(line: 428, column: 13, scope: !871)
!874 = !DILocation(line: 428, column: 13, scope: !865)
!875 = !DILocation(line: 431, column: 30, scope: !876)
!876 = distinct !DILexicalBlock(scope: !877, file: !83, line: 430, column: 11)
!877 = distinct !DILexicalBlock(scope: !878, file: !83, line: 429, column: 11)
!878 = distinct !DILexicalBlock(scope: !871, file: !83, line: 428, column: 37)
!879 = !DILocation(line: 431, column: 42, scope: !876)
!880 = !DILocation(line: 431, column: 24, scope: !876)
!881 = !DILocation(line: 431, column: 11, scope: !876)
!882 = !DILocation(line: 434, column: 9, scope: !878)
!883 = !DILocation(line: 426, column: 11, scope: !865)
!884 = distinct !{!884, !857, !885}
!885 = !DILocation(line: 427, column: 7, scope: !858)
!886 = !DILocation(line: 429, column: 7, scope: !858)
!887 = !DILocation(line: 435, column: 24, scope: !888)
!888 = distinct !DILexicalBlock(scope: !889, file: !83, line: 433, column: 7)
!889 = distinct !DILexicalBlock(scope: !860, file: !83, line: 432, column: 7)
!890 = !DILocation(line: 435, column: 12, scope: !888)
!891 = !DILocation(line: 435, column: 7, scope: !888)
!892 = !DILocation(line: 438, column: 5, scope: !860)
!893 = !DILocation(line: 439, column: 3, scope: !853)
!894 = !DILocation(line: 438, column: 3, scope: !849)
!895 = distinct !DISubprogram(name: "lakai_get_program_list", scope: !83, file: !83, line: 269, type: !896, scopeLine: 270, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!896 = !DISubroutineType(types: !897)
!897 = !{!13, !212, !898}
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!899 = !DILocalVariable(name: "handle", arg: 1, scope: !895, file: !83, line: 269, type: !212)
!900 = !DILocation(line: 0, scope: !895)
!901 = !DILocalVariable(name: "lp", arg: 2, scope: !895, file: !83, line: 269, type: !898)
!902 = !DILocalVariable(name: "finalbuf", scope: !895, file: !83, line: 271, type: !572)
!903 = !DILocation(line: 271, column: 17, scope: !895)
!904 = !DILocalVariable(name: "__cil_tmp9", scope: !895, file: !83, line: 277, type: !58)
!905 = !DILocation(line: 277, column: 9, scope: !895)
!906 = !DILocalVariable(name: "__cil_tmp10", scope: !895, file: !83, line: 278, type: !15)
!907 = !DILocation(line: 278, column: 9, scope: !895)
!908 = !DILocalVariable(name: "__cil_tmp11", scope: !895, file: !83, line: 279, type: !15)
!909 = !DILocation(line: 279, column: 9, scope: !895)
!910 = !DILocalVariable(name: "__cil_tmp12", scope: !895, file: !83, line: 280, type: !15)
!911 = !DILocation(line: 280, column: 9, scope: !895)
!912 = !DILocalVariable(name: "__cil_tmp13", scope: !895, file: !83, line: 281, type: !15)
!913 = !DILocation(line: 281, column: 9, scope: !895)
!914 = !DILocalVariable(name: "__cil_tmp14", scope: !895, file: !83, line: 282, type: !15)
!915 = !DILocation(line: 282, column: 9, scope: !895)
!916 = !DILocalVariable(name: "__cil_tmp15", scope: !895, file: !83, line: 283, type: !15)
!917 = !DILocation(line: 283, column: 9, scope: !895)
!918 = !DILocalVariable(name: "__cil_tmp16", scope: !895, file: !83, line: 284, type: !15)
!919 = !DILocation(line: 284, column: 9, scope: !895)
!920 = !DILocalVariable(name: "__cil_tmp17", scope: !895, file: !83, line: 285, type: !15)
!921 = !DILocation(line: 285, column: 9, scope: !895)
!922 = !DILocation(line: 277, column: 7, scope: !923)
!923 = distinct !DILexicalBlock(scope: !924, file: !83, line: 277, column: 7)
!924 = distinct !DILexicalBlock(scope: !895, file: !83, line: 287, column: 3)
!925 = !DILocation(line: 277, column: 24, scope: !923)
!926 = !DILocation(line: 277, column: 7, scope: !924)
!927 = !DILocation(line: 279, column: 38, scope: !928)
!928 = distinct !DILexicalBlock(scope: !929, file: !83, line: 279, column: 5)
!929 = distinct !DILexicalBlock(scope: !930, file: !83, line: 278, column: 5)
!930 = distinct !DILexicalBlock(scope: !923, file: !83, line: 277, column: 31)
!931 = !DILocation(line: 279, column: 5, scope: !928)
!932 = !DILocation(line: 280, column: 5, scope: !930)
!933 = !DILocation(line: 277, column: 14, scope: !934)
!934 = distinct !DILexicalBlock(scope: !923, file: !83, line: 277, column: 7)
!935 = !DILocation(line: 279, column: 38, scope: !936)
!936 = distinct !DILexicalBlock(scope: !937, file: !83, line: 279, column: 5)
!937 = distinct !DILexicalBlock(scope: !938, file: !83, line: 278, column: 5)
!938 = distinct !DILexicalBlock(scope: !934, file: !83, line: 277, column: 19)
!939 = !DILocation(line: 279, column: 5, scope: !936)
!940 = !DILocation(line: 280, column: 5, scope: !938)
!941 = !DILocation(line: 277, column: 14, scope: !942)
!942 = distinct !DILexicalBlock(scope: !934, file: !83, line: 277, column: 7)
!943 = !DILocation(line: 277, column: 7, scope: !934)
!944 = !DILocation(line: 279, column: 38, scope: !945)
!945 = distinct !DILexicalBlock(scope: !946, file: !83, line: 279, column: 5)
!946 = distinct !DILexicalBlock(scope: !947, file: !83, line: 278, column: 5)
!947 = distinct !DILexicalBlock(scope: !942, file: !83, line: 277, column: 20)
!948 = !DILocation(line: 279, column: 5, scope: !945)
!949 = !DILocation(line: 280, column: 5, scope: !947)
!950 = !DILocation(line: 284, column: 40, scope: !951)
!951 = distinct !DILexicalBlock(scope: !952, file: !83, line: 283, column: 3)
!952 = distinct !DILexicalBlock(scope: !924, file: !83, line: 282, column: 3)
!953 = !DILocation(line: 283, column: 14, scope: !951)
!954 = !DILocalVariable(name: "finallen", scope: !895, file: !83, line: 273, type: !13)
!955 = !DILocation(line: 284, column: 19, scope: !956)
!956 = distinct !DILexicalBlock(scope: !924, file: !83, line: 284, column: 7)
!957 = !DILocation(line: 284, column: 7, scope: !924)
!958 = !DILocation(line: 293, column: 38, scope: !959)
!959 = distinct !DILexicalBlock(scope: !960, file: !83, line: 286, column: 5)
!960 = distinct !DILexicalBlock(scope: !961, file: !83, line: 285, column: 5)
!961 = distinct !DILexicalBlock(scope: !956, file: !83, line: 284, column: 25)
!962 = !DILocation(line: 293, column: 5, scope: !959)
!963 = !DILocation(line: 296, column: 3, scope: !961)
!964 = !DILocation(line: 296, column: 20, scope: !924)
!965 = !DILocation(line: 296, column: 14, scope: !924)
!966 = !DILocation(line: 296, column: 46, scope: !924)
!967 = !DILocation(line: 296, column: 40, scope: !924)
!968 = !DILocation(line: 296, column: 38, scope: !924)
!969 = !DILocation(line: 296, column: 32, scope: !924)
!970 = !DILocalVariable(name: "numprogs", scope: !895, file: !83, line: 274, type: !13)
!971 = !DILocation(line: 298, column: 13, scope: !972)
!972 = distinct !DILexicalBlock(scope: !924, file: !83, line: 298, column: 7)
!973 = !DILocation(line: 298, column: 7, scope: !972)
!974 = !DILocation(line: 298, column: 25, scope: !972)
!975 = !DILocation(line: 298, column: 7, scope: !924)
!976 = !DILocation(line: 298, column: 17, scope: !977)
!977 = distinct !DILexicalBlock(scope: !978, file: !83, line: 298, column: 9)
!978 = distinct !DILexicalBlock(scope: !972, file: !83, line: 298, column: 33)
!979 = !DILocation(line: 298, column: 26, scope: !977)
!980 = !DILocation(line: 298, column: 15, scope: !977)
!981 = !DILocation(line: 298, column: 9, scope: !977)
!982 = !DILocation(line: 298, column: 31, scope: !977)
!983 = !DILocation(line: 298, column: 9, scope: !978)
!984 = !DILocation(line: 300, column: 30, scope: !985)
!985 = distinct !DILexicalBlock(scope: !986, file: !83, line: 300, column: 7)
!986 = distinct !DILexicalBlock(scope: !987, file: !83, line: 299, column: 7)
!987 = distinct !DILexicalBlock(scope: !977, file: !83, line: 298, column: 37)
!988 = !DILocation(line: 300, column: 55, scope: !985)
!989 = !DILocation(line: 300, column: 20, scope: !985)
!990 = !DILocation(line: 300, column: 13, scope: !985)
!991 = !DILocalVariable(name: "tmp", scope: !895, file: !83, line: 275, type: !58)
!992 = !DILocation(line: 300, column: 23, scope: !986)
!993 = !DILocation(line: 300, column: 11, scope: !986)
!994 = !DILocation(line: 300, column: 21, scope: !986)
!995 = !DILocation(line: 301, column: 17, scope: !996)
!996 = distinct !DILexicalBlock(scope: !987, file: !83, line: 301, column: 11)
!997 = !DILocation(line: 301, column: 13, scope: !996)
!998 = !DILocation(line: 301, column: 11, scope: !987)
!999 = !DILocation(line: 303, column: 42, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !83, line: 303, column: 9)
!1001 = distinct !DILexicalBlock(scope: !1002, file: !83, line: 302, column: 9)
!1002 = distinct !DILexicalBlock(scope: !996, file: !83, line: 301, column: 28)
!1003 = !DILocation(line: 303, column: 9, scope: !1000)
!1004 = !DILocation(line: 304, column: 9, scope: !1002)
!1005 = !DILocalVariable(name: "i", scope: !895, file: !83, line: 272, type: !13)
!1006 = !DILocation(line: 306, column: 7, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !83, line: 308, column: 7)
!1008 = distinct !DILexicalBlock(scope: !987, file: !83, line: 307, column: 7)
!1009 = !DILocation(line: 0, scope: !987)
!1010 = !DILocation(line: 306, column: 17, scope: !1007)
!1011 = !DILocation(line: 306, column: 18, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !83, line: 306, column: 13)
!1013 = distinct !DILexicalBlock(scope: !1007, file: !83, line: 306, column: 17)
!1014 = !DILocation(line: 306, column: 13, scope: !1013)
!1015 = !DILocation(line: 306, column: 11, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1012, file: !83, line: 306, column: 31)
!1017 = !DILocation(line: 308, column: 19, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !83, line: 309, column: 9)
!1019 = distinct !DILexicalBlock(scope: !1013, file: !83, line: 308, column: 9)
!1020 = !DILocalVariable(name: "tmp___0", scope: !895, file: !83, line: 276, type: !58)
!1021 = !DILocation(line: 308, column: 15, scope: !1019)
!1022 = !DILocation(line: 308, column: 25, scope: !1019)
!1023 = !DILocation(line: 308, column: 30, scope: !1019)
!1024 = !DILocation(line: 309, column: 21, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1013, file: !83, line: 309, column: 13)
!1026 = !DILocation(line: 309, column: 31, scope: !1025)
!1027 = !DILocation(line: 309, column: 15, scope: !1025)
!1028 = !DILocation(line: 309, column: 13, scope: !1013)
!1029 = !DILocation(line: 311, column: 44, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !83, line: 311, column: 11)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !83, line: 310, column: 11)
!1032 = distinct !DILexicalBlock(scope: !1025, file: !83, line: 309, column: 37)
!1033 = !DILocation(line: 311, column: 11, scope: !1030)
!1034 = !DILocation(line: 312, column: 11, scope: !1032)
!1035 = !DILocation(line: 314, column: 37, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !83, line: 315, column: 9)
!1037 = distinct !DILexicalBlock(scope: !1013, file: !83, line: 314, column: 9)
!1038 = !DILocation(line: 314, column: 46, scope: !1036)
!1039 = !DILocation(line: 314, column: 55, scope: !1036)
!1040 = !DILocation(line: 314, column: 51, scope: !1036)
!1041 = !DILocation(line: 314, column: 68, scope: !1036)
!1042 = !DILocation(line: 314, column: 78, scope: !1036)
!1043 = !DILocation(line: 314, column: 62, scope: !1036)
!1044 = !DILocation(line: 314, column: 9, scope: !1036)
!1045 = !DILocation(line: 315, column: 17, scope: !1037)
!1046 = !DILocation(line: 315, column: 27, scope: !1037)
!1047 = !DILocation(line: 315, column: 11, scope: !1037)
!1048 = !DILocation(line: 315, column: 32, scope: !1037)
!1049 = !DILocation(line: 315, column: 38, scope: !1037)
!1050 = !DILocation(line: 306, column: 11, scope: !1037)
!1051 = distinct !{!1051, !1006, !1052}
!1052 = !DILocation(line: 308, column: 7, scope: !1007)
!1053 = !DILocation(line: 310, column: 7, scope: !1007)
!1054 = !DILocation(line: 317, column: 11, scope: !987)
!1055 = !DILocation(line: 317, column: 20, scope: !987)
!1056 = !DILocation(line: 318, column: 5, scope: !987)
!1057 = !DILocation(line: 320, column: 40, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1059, file: !83, line: 320, column: 7)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !83, line: 319, column: 7)
!1060 = distinct !DILexicalBlock(scope: !977, file: !83, line: 318, column: 12)
!1061 = !DILocation(line: 320, column: 7, scope: !1058)
!1062 = !DILocation(line: 324, column: 3, scope: !978)
!1063 = !DILocation(line: 320, column: 38, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !83, line: 326, column: 5)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !83, line: 325, column: 5)
!1066 = distinct !DILexicalBlock(scope: !972, file: !83, line: 324, column: 10)
!1067 = !DILocation(line: 320, column: 5, scope: !1064)
!1068 = !DILocation(line: 322, column: 3, scope: !924)
!1069 = !DILocation(line: 0, scope: !924)
!1070 = !DILocation(line: 324, column: 1, scope: !895)
!1071 = distinct !DISubprogram(name: "lakai_delete_program", scope: !83, file: !83, line: 742, type: !746, scopeLine: 743, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1072 = !DILocalVariable(name: "handle", arg: 1, scope: !1071, file: !83, line: 742, type: !212)
!1073 = !DILocation(line: 0, scope: !1071)
!1074 = !DILocalVariable(name: "prognum", arg: 2, scope: !1071, file: !83, line: 742, type: !13)
!1075 = !DILocalVariable(name: "statusbuf", scope: !1071, file: !83, line: 744, type: !752)
!1076 = !DILocation(line: 744, column: 17, scope: !1071)
!1077 = !DILocalVariable(name: "__cil_tmp5", scope: !1071, file: !83, line: 746, type: !58)
!1078 = !DILocation(line: 746, column: 9, scope: !1071)
!1079 = !DILocalVariable(name: "__cil_tmp6", scope: !1071, file: !83, line: 747, type: !15)
!1080 = !DILocation(line: 747, column: 9, scope: !1071)
!1081 = !DILocalVariable(name: "__cil_tmp7", scope: !1071, file: !83, line: 748, type: !15)
!1082 = !DILocation(line: 748, column: 9, scope: !1071)
!1083 = !DILocalVariable(name: "__cil_tmp8", scope: !1071, file: !83, line: 749, type: !15)
!1084 = !DILocation(line: 749, column: 9, scope: !1071)
!1085 = !DILocalVariable(name: "__cil_tmp9", scope: !1071, file: !83, line: 750, type: !15)
!1086 = !DILocation(line: 750, column: 9, scope: !1071)
!1087 = !DILocalVariable(name: "__cil_tmp10", scope: !1071, file: !83, line: 751, type: !15)
!1088 = !DILocation(line: 751, column: 9, scope: !1071)
!1089 = !DILocalVariable(name: "__cil_tmp11", scope: !1071, file: !83, line: 752, type: !15)
!1090 = !DILocation(line: 752, column: 9, scope: !1071)
!1091 = !DILocation(line: 750, column: 7, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1093, file: !83, line: 750, column: 7)
!1093 = distinct !DILexicalBlock(scope: !1071, file: !83, line: 754, column: 3)
!1094 = !DILocation(line: 750, column: 24, scope: !1092)
!1095 = !DILocation(line: 750, column: 7, scope: !1093)
!1096 = !DILocation(line: 752, column: 38, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1098, file: !83, line: 752, column: 5)
!1098 = distinct !DILexicalBlock(scope: !1099, file: !83, line: 751, column: 5)
!1099 = distinct !DILexicalBlock(scope: !1092, file: !83, line: 750, column: 31)
!1100 = !DILocation(line: 752, column: 5, scope: !1097)
!1101 = !DILocation(line: 753, column: 5, scope: !1099)
!1102 = !DILocation(line: 750, column: 14, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1092, file: !83, line: 750, column: 7)
!1104 = !DILocation(line: 752, column: 38, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1106, file: !83, line: 752, column: 5)
!1106 = distinct !DILexicalBlock(scope: !1107, file: !83, line: 751, column: 5)
!1107 = distinct !DILexicalBlock(scope: !1103, file: !83, line: 750, column: 19)
!1108 = !DILocation(line: 752, column: 5, scope: !1105)
!1109 = !DILocation(line: 753, column: 5, scope: !1107)
!1110 = !DILocation(line: 750, column: 14, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1103, file: !83, line: 750, column: 7)
!1112 = !DILocation(line: 750, column: 7, scope: !1103)
!1113 = !DILocation(line: 752, column: 38, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1115, file: !83, line: 752, column: 5)
!1115 = distinct !DILexicalBlock(scope: !1116, file: !83, line: 751, column: 5)
!1116 = distinct !DILexicalBlock(scope: !1111, file: !83, line: 750, column: 20)
!1117 = !DILocation(line: 752, column: 5, scope: !1114)
!1118 = !DILocation(line: 753, column: 5, scope: !1116)
!1119 = !DILocation(line: 756, column: 15, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1093, file: !83, line: 756, column: 7)
!1121 = !DILocation(line: 756, column: 7, scope: !1093)
!1122 = !DILocation(line: 758, column: 38, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1124, file: !83, line: 758, column: 5)
!1124 = distinct !DILexicalBlock(scope: !1125, file: !83, line: 757, column: 5)
!1125 = distinct !DILexicalBlock(scope: !1120, file: !83, line: 756, column: 20)
!1126 = !DILocation(line: 758, column: 5, scope: !1123)
!1127 = !DILocation(line: 759, column: 5, scope: !1125)
!1128 = !DILocation(line: 756, column: 15, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1120, file: !83, line: 756, column: 7)
!1130 = !DILocation(line: 756, column: 7, scope: !1120)
!1131 = !DILocation(line: 758, column: 38, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1133, file: !83, line: 758, column: 5)
!1133 = distinct !DILexicalBlock(scope: !1134, file: !83, line: 757, column: 5)
!1134 = distinct !DILexicalBlock(scope: !1129, file: !83, line: 756, column: 24)
!1135 = !DILocation(line: 758, column: 5, scope: !1132)
!1136 = !DILocation(line: 759, column: 5, scope: !1134)
!1137 = !DILocation(line: 762, column: 45, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1093, file: !83, line: 761, column: 3)
!1139 = !DILocation(line: 762, column: 20, scope: !1138)
!1140 = !DILocation(line: 762, column: 18, scope: !1138)
!1141 = !DILocation(line: 763, column: 53, scope: !1138)
!1142 = !DILocation(line: 763, column: 47, scope: !1138)
!1143 = !DILocation(line: 763, column: 68, scope: !1138)
!1144 = !DILocation(line: 763, column: 45, scope: !1138)
!1145 = !DILocation(line: 763, column: 20, scope: !1138)
!1146 = !DILocation(line: 763, column: 18, scope: !1138)
!1147 = !DILocation(line: 766, column: 41, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1138, file: !83, line: 764, column: 3)
!1149 = !DILocation(line: 765, column: 15, scope: !1148)
!1150 = !DILocalVariable(name: "statuslen", scope: !1071, file: !83, line: 745, type: !13)
!1151 = !DILocation(line: 767, column: 20, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1093, file: !83, line: 767, column: 7)
!1153 = !DILocation(line: 767, column: 7, scope: !1093)
!1154 = !DILocation(line: 776, column: 38, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1156, file: !83, line: 769, column: 5)
!1156 = distinct !DILexicalBlock(scope: !1157, file: !83, line: 768, column: 5)
!1157 = distinct !DILexicalBlock(scope: !1152, file: !83, line: 767, column: 26)
!1158 = !DILocation(line: 776, column: 5, scope: !1155)
!1159 = !DILocation(line: 779, column: 3, scope: !1157)
!1160 = !DILocation(line: 779, column: 3, scope: !1093)
!1161 = !DILocation(line: 0, scope: !1093)
!1162 = !DILocation(line: 781, column: 1, scope: !1071)
!1163 = distinct !DISubprogram(name: "lakai_free_program_list", scope: !83, file: !83, line: 329, type: !1164, scopeLine: 330, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{null, !898}
!1166 = !DILocalVariable(name: "lp", arg: 1, scope: !1163, file: !83, line: 329, type: !898)
!1167 = !DILocation(line: 0, scope: !1163)
!1168 = !DILocation(line: 333, column: 7, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1170, file: !83, line: 333, column: 7)
!1170 = distinct !DILexicalBlock(scope: !1163, file: !83, line: 333, column: 3)
!1171 = !DILocation(line: 333, column: 7, scope: !1170)
!1172 = !DILocation(line: 335, column: 13, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1174, file: !83, line: 335, column: 9)
!1174 = distinct !DILexicalBlock(scope: !1169, file: !83, line: 333, column: 11)
!1175 = !DILocation(line: 335, column: 22, scope: !1173)
!1176 = !DILocation(line: 335, column: 9, scope: !1174)
!1177 = !DILocalVariable(name: "i", scope: !1163, file: !83, line: 331, type: !13)
!1178 = !DILocation(line: 337, column: 7, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1180, file: !83, line: 339, column: 7)
!1180 = distinct !DILexicalBlock(scope: !1181, file: !83, line: 338, column: 7)
!1181 = distinct !DILexicalBlock(scope: !1173, file: !83, line: 335, column: 27)
!1182 = !DILocation(line: 0, scope: !1181)
!1183 = !DILocation(line: 337, column: 17, scope: !1179)
!1184 = !DILocation(line: 337, column: 24, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1186, file: !83, line: 337, column: 13)
!1186 = distinct !DILexicalBlock(scope: !1179, file: !83, line: 337, column: 17)
!1187 = !DILocation(line: 337, column: 18, scope: !1185)
!1188 = !DILocation(line: 337, column: 13, scope: !1186)
!1189 = !DILocation(line: 337, column: 11, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1185, file: !83, line: 337, column: 35)
!1191 = !DILocation(line: 339, column: 19, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1186, file: !83, line: 339, column: 13)
!1193 = !DILocation(line: 339, column: 29, scope: !1192)
!1194 = !DILocation(line: 339, column: 13, scope: !1192)
!1195 = !DILocation(line: 339, column: 13, scope: !1186)
!1196 = !DILocation(line: 342, column: 30, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1198, file: !83, line: 341, column: 11)
!1198 = distinct !DILexicalBlock(scope: !1199, file: !83, line: 340, column: 11)
!1199 = distinct !DILexicalBlock(scope: !1192, file: !83, line: 339, column: 35)
!1200 = !DILocation(line: 342, column: 40, scope: !1197)
!1201 = !DILocation(line: 342, column: 24, scope: !1197)
!1202 = !DILocation(line: 342, column: 11, scope: !1197)
!1203 = !DILocation(line: 345, column: 9, scope: !1199)
!1204 = !DILocation(line: 337, column: 11, scope: !1186)
!1205 = distinct !{!1205, !1178, !1206}
!1206 = !DILocation(line: 338, column: 7, scope: !1179)
!1207 = !DILocation(line: 340, column: 7, scope: !1179)
!1208 = !DILocation(line: 346, column: 24, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1210, file: !83, line: 344, column: 7)
!1210 = distinct !DILexicalBlock(scope: !1181, file: !83, line: 343, column: 7)
!1211 = !DILocation(line: 346, column: 12, scope: !1209)
!1212 = !DILocation(line: 346, column: 7, scope: !1209)
!1213 = !DILocation(line: 349, column: 5, scope: !1181)
!1214 = !DILocation(line: 350, column: 3, scope: !1174)
!1215 = !DILocation(line: 349, column: 3, scope: !1170)
!1216 = distinct !DISubprogram(name: "lakai_setmode", scope: !83, file: !83, line: 173, type: !746, scopeLine: 174, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1217 = !DILocalVariable(name: "handle", arg: 1, scope: !1216, file: !83, line: 173, type: !212)
!1218 = !DILocation(line: 0, scope: !1216)
!1219 = !DILocalVariable(name: "mode", arg: 2, scope: !1216, file: !83, line: 173, type: !13)
!1220 = !DILocalVariable(name: "__cil_tmp4", scope: !1216, file: !83, line: 176, type: !15)
!1221 = !DILocation(line: 176, column: 9, scope: !1216)
!1222 = !DILocalVariable(name: "__cil_tmp5", scope: !1216, file: !83, line: 177, type: !15)
!1223 = !DILocation(line: 177, column: 9, scope: !1216)
!1224 = !DILocalVariable(name: "__cil_tmp6", scope: !1216, file: !83, line: 178, type: !15)
!1225 = !DILocation(line: 178, column: 9, scope: !1216)
!1226 = !DILocalVariable(name: "__cil_tmp7", scope: !1216, file: !83, line: 179, type: !15)
!1227 = !DILocation(line: 179, column: 9, scope: !1216)
!1228 = !DILocalVariable(name: "__cil_tmp8", scope: !1216, file: !83, line: 180, type: !15)
!1229 = !DILocation(line: 180, column: 9, scope: !1216)
!1230 = !DILocation(line: 189, column: 12, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1232, file: !83, line: 189, column: 7)
!1232 = distinct !DILexicalBlock(scope: !1216, file: !83, line: 182, column: 3)
!1233 = !DILocation(line: 189, column: 7, scope: !1232)
!1234 = !DILocation(line: 191, column: 15, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1231, file: !83, line: 189, column: 18)
!1236 = !DILocation(line: 192, column: 15, scope: !1235)
!1237 = !DILocation(line: 193, column: 3, scope: !1235)
!1238 = !DILocation(line: 194, column: 12, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1231, file: !83, line: 194, column: 7)
!1240 = !DILocation(line: 194, column: 7, scope: !1231)
!1241 = !DILocation(line: 196, column: 15, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1239, file: !83, line: 194, column: 18)
!1243 = !DILocation(line: 197, column: 15, scope: !1242)
!1244 = !DILocation(line: 198, column: 3, scope: !1242)
!1245 = !DILocation(line: 199, column: 12, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1239, file: !83, line: 199, column: 7)
!1247 = !DILocation(line: 199, column: 7, scope: !1239)
!1248 = !DILocation(line: 201, column: 15, scope: !1249)
!1249 = distinct !DILexicalBlock(scope: !1246, file: !83, line: 199, column: 18)
!1250 = !DILocation(line: 202, column: 15, scope: !1249)
!1251 = !DILocation(line: 203, column: 3, scope: !1249)
!1252 = !DILocation(line: 206, column: 38, scope: !1253)
!1253 = distinct !DILexicalBlock(scope: !1254, file: !83, line: 205, column: 5)
!1254 = distinct !DILexicalBlock(scope: !1255, file: !83, line: 204, column: 5)
!1255 = distinct !DILexicalBlock(scope: !1246, file: !83, line: 203, column: 10)
!1256 = !DILocation(line: 206, column: 5, scope: !1253)
!1257 = !DILocation(line: 207, column: 5, scope: !1255)
!1258 = !DILocation(line: 210, column: 7, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1232, file: !83, line: 210, column: 7)
!1260 = !DILocation(line: 210, column: 24, scope: !1259)
!1261 = !DILocation(line: 210, column: 7, scope: !1232)
!1262 = !DILocation(line: 212, column: 38, scope: !1263)
!1263 = distinct !DILexicalBlock(scope: !1264, file: !83, line: 212, column: 5)
!1264 = distinct !DILexicalBlock(scope: !1265, file: !83, line: 211, column: 5)
!1265 = distinct !DILexicalBlock(scope: !1259, file: !83, line: 210, column: 31)
!1266 = !DILocation(line: 212, column: 5, scope: !1263)
!1267 = !DILocation(line: 213, column: 5, scope: !1265)
!1268 = !DILocation(line: 210, column: 14, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1259, file: !83, line: 210, column: 7)
!1270 = !DILocation(line: 212, column: 38, scope: !1271)
!1271 = distinct !DILexicalBlock(scope: !1272, file: !83, line: 212, column: 5)
!1272 = distinct !DILexicalBlock(scope: !1273, file: !83, line: 211, column: 5)
!1273 = distinct !DILexicalBlock(scope: !1269, file: !83, line: 210, column: 19)
!1274 = !DILocation(line: 212, column: 5, scope: !1271)
!1275 = !DILocation(line: 213, column: 5, scope: !1273)
!1276 = !DILocation(line: 210, column: 14, scope: !1277)
!1277 = distinct !DILexicalBlock(scope: !1269, file: !83, line: 210, column: 7)
!1278 = !DILocation(line: 210, column: 7, scope: !1269)
!1279 = !DILocation(line: 212, column: 38, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !1281, file: !83, line: 212, column: 5)
!1281 = distinct !DILexicalBlock(scope: !1282, file: !83, line: 211, column: 5)
!1282 = distinct !DILexicalBlock(scope: !1277, file: !83, line: 210, column: 20)
!1283 = !DILocation(line: 212, column: 5, scope: !1280)
!1284 = !DILocation(line: 213, column: 5, scope: !1282)
!1285 = !DILocation(line: 216, column: 22, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1287, file: !83, line: 216, column: 3)
!1287 = distinct !DILexicalBlock(scope: !1232, file: !83, line: 215, column: 3)
!1288 = !DILocation(line: 216, column: 9, scope: !1286)
!1289 = !DILocalVariable(name: "tmp", scope: !1216, file: !83, line: 175, type: !13)
!1290 = !DILocation(line: 216, column: 11, scope: !1291)
!1291 = distinct !DILexicalBlock(scope: !1232, file: !83, line: 216, column: 7)
!1292 = !DILocation(line: 216, column: 7, scope: !1232)
!1293 = !DILocation(line: 218, column: 38, scope: !1294)
!1294 = distinct !DILexicalBlock(scope: !1295, file: !83, line: 218, column: 5)
!1295 = distinct !DILexicalBlock(scope: !1296, file: !83, line: 217, column: 5)
!1296 = distinct !DILexicalBlock(scope: !1291, file: !83, line: 216, column: 17)
!1297 = !DILocation(line: 218, column: 5, scope: !1294)
!1298 = !DILocation(line: 219, column: 5, scope: !1296)
!1299 = !DILocation(line: 221, column: 3, scope: !1232)
!1300 = !DILocation(line: 0, scope: !1232)
!1301 = !DILocation(line: 223, column: 1, scope: !1216)
!1302 = distinct !DISubprogram(name: "send_command", scope: !83, file: !83, line: 1324, type: !1303, scopeLine: 1326, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!13, !13, !15, !13, !58, !13, !58, !13}
!1305 = !DILocalVariable(name: "sg_fd", arg: 1, scope: !1302, file: !83, line: 1324, type: !13)
!1306 = !DILocation(line: 0, scope: !1302)
!1307 = !DILocalVariable(name: "cmdblk___14", arg: 2, scope: !1302, file: !83, line: 1324, type: !15)
!1308 = !DILocalVariable(name: "dirflag", arg: 3, scope: !1302, file: !83, line: 1324, type: !13)
!1309 = !DILocalVariable(name: "tosamp_ptr", arg: 4, scope: !1302, file: !83, line: 1324, type: !58)
!1310 = !DILocalVariable(name: "tosamp_len", arg: 5, scope: !1302, file: !83, line: 1325, type: !13)
!1311 = !DILocalVariable(name: "fromsamp_ptr", arg: 6, scope: !1302, file: !83, line: 1325, type: !58)
!1312 = !DILocalVariable(name: "fromsamp_len", arg: 7, scope: !1302, file: !83, line: 1325, type: !13)
!1313 = !DILocalVariable(name: "io_hdr", scope: !1302, file: !83, line: 1327, type: !1314)
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "sg_io_hdr_t", file: !369, line: 43, baseType: !1315)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sg_io_hdr", file: !369, line: 43, size: 704, elements: !1316)
!1316 = !{!1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "interface_id", scope: !1315, file: !369, line: 44, baseType: !13, size: 32)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "dxfer_direction", scope: !1315, file: !369, line: 45, baseType: !13, size: 32, offset: 32)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_len", scope: !1315, file: !369, line: 46, baseType: !73, size: 8, offset: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "mx_sb_len", scope: !1315, file: !369, line: 47, baseType: !73, size: 8, offset: 72)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "iovec_count", scope: !1315, file: !369, line: 48, baseType: !43, size: 16, offset: 80)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "dxfer_len", scope: !1315, file: !369, line: 49, baseType: !65, size: 32, offset: 96)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "dxferp", scope: !1315, file: !369, line: 50, baseType: !58, size: 64, offset: 128)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "cmdp", scope: !1315, file: !369, line: 51, baseType: !78, size: 64, offset: 192)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "sbp", scope: !1315, file: !369, line: 52, baseType: !78, size: 64, offset: 256)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !1315, file: !369, line: 53, baseType: !65, size: 32, offset: 320)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1315, file: !369, line: 54, baseType: !65, size: 32, offset: 352)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "pack_id", scope: !1315, file: !369, line: 55, baseType: !13, size: 32, offset: 384)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "usr_ptr", scope: !1315, file: !369, line: 56, baseType: !58, size: 64, offset: 448)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !1315, file: !369, line: 57, baseType: !73, size: 8, offset: 512)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "masked_status", scope: !1315, file: !369, line: 58, baseType: !73, size: 8, offset: 520)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "msg_status", scope: !1315, file: !369, line: 59, baseType: !73, size: 8, offset: 528)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "sb_len_wr", scope: !1315, file: !369, line: 60, baseType: !73, size: 8, offset: 536)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "host_status", scope: !1315, file: !369, line: 61, baseType: !43, size: 16, offset: 544)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "driver_status", scope: !1315, file: !369, line: 62, baseType: !43, size: 16, offset: 560)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "resid", scope: !1315, file: !369, line: 63, baseType: !13, size: 32, offset: 576)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1315, file: !369, line: 64, baseType: !65, size: 32, offset: 608)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1315, file: !369, line: 65, baseType: !65, size: 32, offset: 640)
!1339 = !DILocation(line: 1327, column: 15, scope: !1302)
!1340 = !DILocalVariable(name: "sense_buffer", scope: !1302, file: !83, line: 1328, type: !1341)
!1341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 256, elements: !1342)
!1342 = !{!1343}
!1343 = !DISubrange(count: 32)
!1344 = !DILocation(line: 1328, column: 17, scope: !1302)
!1345 = !DILocalVariable(name: "__cil_tmp11", scope: !1302, file: !83, line: 1330, type: !58)
!1346 = !DILocation(line: 1330, column: 9, scope: !1302)
!1347 = !DILocalVariable(name: "__cil_tmp12", scope: !1302, file: !83, line: 1331, type: !15)
!1348 = !DILocation(line: 1331, column: 9, scope: !1302)
!1349 = !DILocalVariable(name: "__cil_tmp13", scope: !1302, file: !83, line: 1332, type: !15)
!1350 = !DILocation(line: 1332, column: 9, scope: !1302)
!1351 = !DILocalVariable(name: "__cil_tmp14", scope: !1302, file: !83, line: 1333, type: !15)
!1352 = !DILocation(line: 1333, column: 9, scope: !1302)
!1353 = !DILocalVariable(name: "__cil_tmp15", scope: !1302, file: !83, line: 1334, type: !15)
!1354 = !DILocation(line: 1334, column: 9, scope: !1302)
!1355 = !DILocation(line: 1332, column: 10, scope: !1356)
!1356 = distinct !DILexicalBlock(scope: !1357, file: !83, line: 1338, column: 3)
!1357 = distinct !DILexicalBlock(scope: !1358, file: !83, line: 1337, column: 3)
!1358 = distinct !DILexicalBlock(scope: !1302, file: !83, line: 1336, column: 3)
!1359 = !DILocation(line: 1332, column: 3, scope: !1356)
!1360 = !DILocation(line: 1333, column: 10, scope: !1357)
!1361 = !DILocation(line: 1333, column: 23, scope: !1357)
!1362 = !DILocation(line: 1334, column: 10, scope: !1357)
!1363 = !DILocation(line: 1334, column: 18, scope: !1357)
!1364 = !DILocation(line: 1336, column: 10, scope: !1357)
!1365 = !DILocation(line: 1336, column: 20, scope: !1357)
!1366 = !DILocation(line: 1338, column: 15, scope: !1367)
!1367 = distinct !DILexicalBlock(scope: !1358, file: !83, line: 1338, column: 7)
!1368 = !DILocation(line: 1338, column: 7, scope: !1358)
!1369 = !DILocation(line: 1341, column: 12, scope: !1370)
!1370 = distinct !DILexicalBlock(scope: !1367, file: !83, line: 1338, column: 21)
!1371 = !DILocation(line: 1341, column: 28, scope: !1370)
!1372 = !DILocation(line: 1342, column: 12, scope: !1370)
!1373 = !DILocation(line: 1342, column: 22, scope: !1370)
!1374 = !DILocation(line: 1343, column: 12, scope: !1370)
!1375 = !DILocation(line: 1343, column: 19, scope: !1370)
!1376 = !DILocation(line: 1344, column: 3, scope: !1370)
!1377 = !DILocation(line: 1348, column: 12, scope: !1378)
!1378 = distinct !DILexicalBlock(scope: !1367, file: !83, line: 1344, column: 10)
!1379 = !DILocation(line: 1348, column: 28, scope: !1378)
!1380 = !DILocation(line: 1349, column: 12, scope: !1378)
!1381 = !DILocation(line: 1349, column: 22, scope: !1378)
!1382 = !DILocation(line: 1350, column: 12, scope: !1378)
!1383 = !DILocation(line: 1350, column: 19, scope: !1378)
!1384 = !DILocation(line: 1360, column: 10, scope: !1385)
!1385 = distinct !DILexicalBlock(scope: !1358, file: !83, line: 1352, column: 3)
!1386 = !DILocation(line: 1360, column: 15, scope: !1385)
!1387 = !DILocation(line: 1361, column: 16, scope: !1385)
