; ModuleID = '/tmp/tmp.ll'
source_filename = "c/libgsm-1.0.13.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.fmtdesc = type { i8*, i8*, i8*, i32 ()*, i32 ()*, i32 (i16*)*, i32 (i16*)* }
%struct.stat = type { i64, i16, i64, i32, i32, i32, i32, i64, i16, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.gsm_state = type { [280 x i16], [50 x i16], i16, i64, i32, [8 x i16], [2 x [8 x i16]], i16, i16, i16, [9 x i16], i16, i8, i8, i8, i8, i8 }
%struct.utimbuf = type { i64, i64 }

@in = common global %struct._IO_FILE* null, align 8, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "in", scope: !2, file: !132, line: 26, type: !23, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !156, nameTableKind: GNU)
!3 = !DIFile(filename: "c/libgsm-1.0.13.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !7, !8, !9, !10, !11, !14, !16, !18, !20, !21, !23, !82, !13, !74, !83, !85, !89, !125, !15, !126, !129, !130, !148}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "longword", file: !12, line: 13, baseType: !13)
!12 = !DIFile(filename: "./inc/private.h", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!13 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "ulongword", file: !12, line: 16, baseType: !15)
!15 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "word", file: !12, line: 12, baseType: !17)
!17 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsm_signal", file: !19, line: 40, baseType: !17)
!19 = !DIFile(filename: "./inc/gsm.h", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!20 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !25, line: 49, baseType: !26)
!25 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !27, line: 271, size: 1728, elements: !28)
!27 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !49, !50, !51, !52, !55, !56, !58, !62, !65, !69, !70, !71, !72, !73, !77, !78}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !26, file: !27, line: 272, baseType: !6, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !26, file: !27, line: 273, baseType: !10, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !26, file: !27, line: 274, baseType: !10, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !26, file: !27, line: 275, baseType: !10, size: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !26, file: !27, line: 276, baseType: !10, size: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !26, file: !27, line: 277, baseType: !10, size: 64, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !26, file: !27, line: 278, baseType: !10, size: 64, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !26, file: !27, line: 279, baseType: !10, size: 64, offset: 448)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !26, file: !27, line: 280, baseType: !10, size: 64, offset: 512)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !26, file: !27, line: 281, baseType: !10, size: 64, offset: 576)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !26, file: !27, line: 282, baseType: !10, size: 64, offset: 640)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !26, file: !27, line: 283, baseType: !10, size: 64, offset: 704)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !26, file: !27, line: 284, baseType: !42, size: 64, offset: 768)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !27, line: 186, size: 192, elements: !44)
!44 = !{!45, !46, !48}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !43, file: !27, line: 187, baseType: !42, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !43, file: !27, line: 188, baseType: !47, size: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !43, file: !27, line: 189, baseType: !6, size: 32, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !26, file: !27, line: 285, baseType: !47, size: 64, offset: 832)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !26, file: !27, line: 286, baseType: !6, size: 32, offset: 896)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !26, file: !27, line: 287, baseType: !6, size: 32, offset: 928)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !26, file: !27, line: 288, baseType: !53, size: 64, offset: 960)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !54, line: 141, baseType: !13)
!54 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !26, file: !27, line: 289, baseType: !20, size: 16, offset: 1024)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !26, file: !27, line: 290, baseType: !57, size: 8, offset: 1040)
!57 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !26, file: !27, line: 291, baseType: !59, size: 8, offset: 1048)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 1)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !26, file: !27, line: 292, baseType: !63, size: 64, offset: 1088)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !27, line: 180, baseType: null)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !26, file: !27, line: 293, baseType: !66, size: 64, offset: 1152)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !54, line: 142, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !54, line: 56, baseType: !68)
!68 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !26, file: !27, line: 294, baseType: !9, size: 64, offset: 1216)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !26, file: !27, line: 295, baseType: !9, size: 64, offset: 1280)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !26, file: !27, line: 296, baseType: !9, size: 64, offset: 1344)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !26, file: !27, line: 297, baseType: !9, size: 64, offset: 1408)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !26, file: !27, line: 298, baseType: !74, size: 32, offset: 1472)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 211, baseType: !76)
!75 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!76 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !26, file: !27, line: 299, baseType: !6, size: 32, offset: 1504)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !26, file: !27, line: 300, baseType: !79, size: 192, offset: 1536)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 24)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "uword", file: !12, line: 15, baseType: !20)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 272, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 17)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsm", file: !19, line: 39, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsm_state", file: !12, line: 18, size: 6080, elements: !92)
!92 = !{!93, !97, !101, !102, !103, !104, !108, !112, !113, !114, !115, !119, !120, !121, !122, !123, !124}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "dp0", scope: !91, file: !12, line: 19, baseType: !94, size: 4480)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 4480, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 280)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !91, file: !12, line: 20, baseType: !98, size: 800, offset: 4480)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 800, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 50)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "z1", scope: !91, file: !12, line: 21, baseType: !16, size: 16, offset: 5280)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "L_z2", scope: !91, file: !12, line: 22, baseType: !11, size: 64, offset: 5312)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "mp", scope: !91, file: !12, line: 23, baseType: !6, size: 32, offset: 5376)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !91, file: !12, line: 24, baseType: !105, size: 128, offset: 5408)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 128, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 8)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "LARpp", scope: !91, file: !12, line: 25, baseType: !109, size: 256, offset: 5536)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 256, elements: !110)
!110 = !{!111, !107}
!111 = !DISubrange(count: 2)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !91, file: !12, line: 26, baseType: !16, size: 16, offset: 5792)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ltp_cut", scope: !91, file: !12, line: 27, baseType: !16, size: 16, offset: 5808)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "nrp", scope: !91, file: !12, line: 28, baseType: !16, size: 16, offset: 5824)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !91, file: !12, line: 29, baseType: !116, size: 144, offset: 5840)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 144, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 9)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "msr", scope: !91, file: !12, line: 30, baseType: !16, size: 16, offset: 5984)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !91, file: !12, line: 31, baseType: !7, size: 8, offset: 6000)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "fast", scope: !91, file: !12, line: 32, baseType: !7, size: 8, offset: 6008)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "wav_fmt", scope: !91, file: !12, line: 33, baseType: !7, size: 8, offset: 6016)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "frame_index", scope: !91, file: !12, line: 34, baseType: !8, size: 8, offset: 6024)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "frame_chain", scope: !91, file: !12, line: 35, baseType: !8, size: 8, offset: 6032)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsm_byte", file: !19, line: 41, baseType: !8)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !6}
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !54, line: 140, baseType: !76)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fmtdesc", file: !132, line: 52, size: 448, elements: !133)
!132 = !DIFile(filename: "/home/wslee/benchmarks/sound/libgsm-1.0.13/src/toast.c", directory: "")
!133 = !{!134, !135, !136, !137, !141, !142, !147}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !132, line: 53, baseType: !10, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "longname", scope: !131, file: !132, line: 54, baseType: !10, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "suffix", scope: !131, file: !132, line: 55, baseType: !10, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "init_input", scope: !131, file: !132, line: 56, baseType: !138, size: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!6}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "init_output", scope: !131, file: !132, line: 57, baseType: !138, size: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !131, file: !132, line: 58, baseType: !143, size: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!6, !146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !131, file: !132, line: 59, baseType: !143, size: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utimbuf", file: !151, line: 38, size: 128, elements: !152)
!151 = !DIFile(filename: "/usr/include/utime.h", directory: "")
!152 = !{!153, !155}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "actime", scope: !150, file: !151, line: 39, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !54, line: 149, baseType: !13)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "modtime", scope: !150, file: !151, line: 40, baseType: !154, size: 64, offset: 64)
!156 = !{!157, !160, !162, !164, !166, !168, !173, !175, !180, !182, !184, !186, !188, !190, !192, !194, !196, !198, !200, !202, !204, !206, !211, !0, !213, !215, !217, !219, !221, !255, !257, !259, !261, !263, !269, !274, !277, !282}
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "gsm_A", scope: !2, file: !159, line: 25, type: !105, isLocal: false, isDefinition: true)
!159 = !DIFile(filename: "/home/wslee/benchmarks/sound/libgsm-1.0.13/src/table.c", directory: "")
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "gsm_B", scope: !2, file: !159, line: 26, type: !105, isLocal: false, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "gsm_MIC", scope: !2, file: !159, line: 27, type: !105, isLocal: false, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "gsm_MAC", scope: !2, file: !159, line: 28, type: !105, isLocal: false, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "gsm_INVA", scope: !2, file: !159, line: 33, type: !105, isLocal: false, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "gsm_DLB", scope: !2, file: !159, line: 39, type: !170, isLocal: false, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 64, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 4)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "gsm_QLB", scope: !2, file: !159, line: 45, type: !170, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "gsm_H", scope: !2, file: !159, line: 51, type: !177, isLocal: false, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 176, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 11)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "gsm_NRFAC", scope: !2, file: !159, line: 57, type: !105, isLocal: false, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "gsm_FAC", scope: !2, file: !159, line: 63, type: !105, isLocal: false, isDefinition: true)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "f_decode", scope: !2, file: !132, line: 16, type: !6, isLocal: false, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "f_cat", scope: !2, file: !132, line: 17, type: !6, isLocal: false, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "f_force", scope: !2, file: !132, line: 18, type: !6, isLocal: false, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "f_precious", scope: !2, file: !132, line: 19, type: !6, isLocal: false, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "f_fast", scope: !2, file: !132, line: 20, type: !6, isLocal: false, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "f_verbose", scope: !2, file: !132, line: 21, type: !6, isLocal: false, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "f_ltp_cut", scope: !2, file: !132, line: 22, type: !6, isLocal: false, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "f_audio", scope: !2, file: !132, line: 52, type: !131, isLocal: false, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "f_ulaw", scope: !2, file: !132, line: 52, type: !131, isLocal: false, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "f_alaw", scope: !2, file: !132, line: 52, type: !131, isLocal: false, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "f_linear", scope: !2, file: !132, line: 52, type: !131, isLocal: false, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "alldescs", scope: !2, file: !132, line: 92, type: !208, isLocal: false, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 320, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 5)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "f_format", scope: !2, file: !132, line: 102, type: !130, isLocal: false, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "out", scope: !2, file: !132, line: 26, type: !23, isLocal: false, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "inname", scope: !2, file: !132, line: 27, type: !10, isLocal: false, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "progname", scope: !2, file: !132, line: 14, type: !10, isLocal: false, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "input", scope: !2, file: !132, line: 45, type: !143, isLocal: false, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "instat", scope: !2, file: !132, line: 24, type: !223, isLocal: false, isDefinition: true)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !224, line: 43, size: 1152, elements: !225)
!224 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!225 = !{!226, !230, !231, !233, !235, !236, !238, !240, !241, !242, !243, !245, !247, !248, !249, !250, !251, !252, !253, !254}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !223, file: !224, line: 44, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !54, line: 134, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_quad_t", file: !54, line: 57, baseType: !229)
!229 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !223, file: !224, line: 45, baseType: !20, size: 16, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !223, file: !224, line: 46, baseType: !232, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !54, line: 137, baseType: !15)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !223, file: !224, line: 47, baseType: !234, size: 32, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !54, line: 139, baseType: !76)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !223, file: !224, line: 48, baseType: !129, size: 32, offset: 224)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !223, file: !224, line: 49, baseType: !237, size: 32, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !54, line: 135, baseType: !76)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !223, file: !224, line: 50, baseType: !239, size: 32, offset: 288)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !54, line: 136, baseType: !76)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !223, file: !224, line: 51, baseType: !227, size: 64, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !223, file: !224, line: 52, baseType: !20, size: 16, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !223, file: !224, line: 53, baseType: !53, size: 64, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !223, file: !224, line: 54, baseType: !244, size: 64, offset: 512)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !54, line: 164, baseType: !13)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !223, file: !224, line: 55, baseType: !246, size: 64, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !54, line: 169, baseType: !13)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "st_atime", scope: !223, file: !224, line: 56, baseType: !154, size: 64, offset: 640)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimensec", scope: !223, file: !224, line: 57, baseType: !15, size: 64, offset: 704)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtime", scope: !223, file: !224, line: 58, baseType: !154, size: 64, offset: 768)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimensec", scope: !223, file: !224, line: 59, baseType: !15, size: 64, offset: 832)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctime", scope: !223, file: !224, line: 60, baseType: !154, size: 64, offset: 896)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimensec", scope: !223, file: !224, line: 61, baseType: !15, size: 64, offset: 960)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__unused4", scope: !223, file: !224, line: 62, baseType: !15, size: 64, offset: 1024)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__unused5", scope: !223, file: !224, line: 63, baseType: !15, size: 64, offset: 1088)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "outname", scope: !2, file: !132, line: 27, type: !10, isLocal: false, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "output", scope: !2, file: !132, line: 45, type: !143, isLocal: false, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "init_input", scope: !2, file: !132, line: 47, type: !138, isLocal: false, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "init_output", scope: !2, file: !132, line: 47, type: !138, isLocal: false, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "u2s", scope: !2, file: !265, line: 19, type: !266, isLocal: true, isDefinition: true)
!265 = !DIFile(filename: "/home/wslee/benchmarks/sound/libgsm-1.0.13/src/toast_ulaw.c", directory: "")
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 4096, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 256)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "s2u", scope: !2, file: !265, line: 54, type: !271, isLocal: true, isDefinition: true)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 65536, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 8192)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "a2s", scope: !2, file: !276, line: 19, type: !266, isLocal: true, isDefinition: true)
!276 = !DIFile(filename: "/home/wslee/benchmarks/sound/libgsm-1.0.13/src/toast_alaw.c", directory: "")
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "s2a", scope: !2, file: !276, line: 57, type: !279, isLocal: true, isDefinition: true)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32768, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 4096)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "bitoff", scope: !2, file: !284, line: 98, type: !285, isLocal: true, isDefinition: true)
!284 = !DIFile(filename: "/home/wslee/benchmarks/sound/libgsm-1.0.13/src/add.c", directory: "")
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 2048, elements: !267)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!287 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!288 = !{i32 2, !"Dwarf Version", i32 4}
!289 = !{i32 2, !"Debug Info Version", i32 3}
!290 = !{i32 1, !"wchar_size", i32 4}
!291 = !{i32 7, !"PIC Level", i32 2}
!292 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!293 = distinct !DISubprogram(name: "gsm_option", scope: !294, file: !294, line: 14, type: !295, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!294 = !DIFile(filename: "/home/wslee/benchmarks/sound/libgsm-1.0.13/src/gsm_option.c", directory: "")
!295 = !DISubroutineType(types: !296)
!296 = !{!6, !89, !6, !297}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!298 = !DILocalVariable(name: "r", arg: 1, scope: !293, file: !294, line: 14, type: !89)
!299 = !DILocation(line: 0, scope: !293)
!300 = !DILocalVariable(name: "opt", arg: 2, scope: !293, file: !294, line: 14, type: !6)
!301 = !DILocalVariable(name: "val", arg: 3, scope: !293, file: !294, line: 14, type: !297)
!302 = !DILocalVariable(name: "result", scope: !293, file: !294, line: 16, type: !6)
!303 = !DILocation(line: 19, column: 11, scope: !304)
