; ModuleID = '/tmp/tmp.ll'
source_filename = "c/mcf-spec2000.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct.basket = type { %struct.arc*, i64, i64 }
%struct.arc = type { %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, i64, i64, i64, i64 }
%struct.node = type { i64, i8*, %struct.node*, %struct.node*, %struct.node*, %struct.node*, i64, i64, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i32, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i32, [44 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.network = type { [200 x i8], [200 x i8], i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, double, i64, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i64 }

@perm = internal global [401 x %struct.basket*] zeroinitializer, align 16, !dbg !0
@initialize = internal global i64 1, align 8, !dbg !163
@basket = internal global [401 x %struct.basket] zeroinitializer, align 16, !dbg !111
@nr_group = internal global i64 0, align 8, !dbg !122
@group_pos = internal global i64 0, align 8, !dbg !124
@basket_size = internal global i64 0, align 8, !dbg !108
@.str = private unnamed_addr constant [5 x i8] c"%ld\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "perm", scope: !2, file: !110, line: 77, type: !165, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !107, nameTableKind: GNU)
!3 = !DIFile(filename: "c/mcf-spec2000.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !7, !10, !49, !36, !9, !50, !15, !24, !52, !31, !38, !21, !22, !106}
!6 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !8, line: 60, baseType: !9)
!8 = !DIFile(filename: "/local/sparrow_test/test/SPEC2000/CINT2000/181.mcf/src/defines.h", directory: "")
!9 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !8, line: 108, baseType: !12)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !8, line: 108, size: 512, elements: !13)
!13 = !{!14, !42, !43, !44, !45, !46, !47, !48}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !12, file: !8, line: 109, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_t", file: !8, line: 91, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !8, line: 91, size: 960, elements: !18)
!18 = !{!19, !20, !23, !25, !26, !27, !28, !29, !30, !32, !33, !34, !35, !37, !41}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !17, file: !8, line: 92, baseType: !9, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !17, file: !8, line: 93, baseType: !21, size: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !17, file: !8, line: 94, baseType: !24, size: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !17, file: !8, line: 95, baseType: !24, size: 64, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !17, file: !8, line: 96, baseType: !24, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !17, file: !8, line: 97, baseType: !24, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !17, file: !8, line: 98, baseType: !9, size: 64, offset: 384)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !17, file: !8, line: 99, baseType: !9, size: 64, offset: 448)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !17, file: !8, line: 100, baseType: !31, size: 64, offset: 512)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !17, file: !8, line: 101, baseType: !31, size: 64, offset: 576)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !17, file: !8, line: 102, baseType: !31, size: 64, offset: 640)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !17, file: !8, line: 103, baseType: !7, size: 64, offset: 704)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !17, file: !8, line: 104, baseType: !36, size: 64, offset: 768)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !8, line: 59, baseType: !9)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !17, file: !8, line: 105, baseType: !38, size: 32, offset: 832)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !39, line: 213, baseType: !40)
!39 = !DIFile(filename: "/usr/lib/gcc-lib/i486-linux/3.3.5/include/stddef.h", directory: "")
!40 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !17, file: !8, line: 106, baseType: !9, size: 64, offset: 896)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !12, file: !8, line: 110, baseType: !15, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !12, file: !8, line: 111, baseType: !31, size: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !12, file: !8, line: 112, baseType: !31, size: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !12, file: !8, line: 113, baseType: !7, size: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !12, file: !8, line: 114, baseType: !7, size: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !12, file: !8, line: 115, baseType: !36, size: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !12, file: !8, line: 116, baseType: !9, size: 64, offset: 448)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !54, line: 46, baseType: !55)
!54 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !56, line: 264, size: 1728, elements: !57)
!56 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!57 = !{!58, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !79, !80, !81, !82, !85, !87, !89, !93, !96, !99, !100, !101, !102}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !55, file: !56, line: 265, baseType: !59, size: 32)
!59 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !55, file: !56, line: 266, baseType: !21, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !55, file: !56, line: 267, baseType: !21, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !55, file: !56, line: 268, baseType: !21, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !55, file: !56, line: 269, baseType: !21, size: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !55, file: !56, line: 270, baseType: !21, size: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !55, file: !56, line: 271, baseType: !21, size: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !55, file: !56, line: 272, baseType: !21, size: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !55, file: !56, line: 273, baseType: !21, size: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !55, file: !56, line: 274, baseType: !21, size: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !55, file: !56, line: 275, baseType: !21, size: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !55, file: !56, line: 276, baseType: !21, size: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !55, file: !56, line: 277, baseType: !72, size: 64, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !56, line: 179, size: 192, elements: !74)
!74 = !{!75, !76, !78}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !73, file: !56, line: 180, baseType: !72, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !73, file: !56, line: 181, baseType: !77, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !73, file: !56, line: 182, baseType: !59, size: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !55, file: !56, line: 278, baseType: !77, size: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !55, file: !56, line: 279, baseType: !59, size: 32, offset: 896)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !55, file: !56, line: 280, baseType: !59, size: 32, offset: 928)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !55, file: !56, line: 281, baseType: !83, size: 64, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !84, line: 143, baseType: !9)
!84 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !55, file: !56, line: 282, baseType: !86, size: 16, offset: 1024)
!86 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !55, file: !56, line: 283, baseType: !88, size: 8, offset: 1040)
!88 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !55, file: !56, line: 284, baseType: !90, size: 8, offset: 1048)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 1)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !55, file: !56, line: 285, baseType: !94, size: 64, offset: 1088)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !56, line: 173, baseType: null)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !55, file: !56, line: 286, baseType: !97, size: 64, offset: 1152)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !84, line: 144, baseType: !98)
!98 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !55, file: !56, line: 287, baseType: !49, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !55, file: !56, line: 288, baseType: !49, size: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !55, file: !56, line: 289, baseType: !59, size: 32, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !55, file: !56, line: 290, baseType: !103, size: 352, offset: 1376)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 352, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 44)
!106 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!107 = !{!108, !111, !0, !122, !124, !126, !163}
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "basket_size", scope: !2, file: !110, line: 75, type: !9, isLocal: true, isDefinition: true)
!110 = !DIFile(filename: "/local/sparrow_test/test/SPEC2000/CINT2000/181.mcf/src/pbeampp.c", directory: "")
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "basket", scope: !2, file: !110, line: 76, type: !113, isLocal: true, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 76992, elements: !120)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "BASKET", file: !110, line: 68, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basket", file: !110, line: 68, size: 192, elements: !116)
!116 = !{!117, !118, !119}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !115, file: !110, line: 69, baseType: !10, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !115, file: !110, line: 70, baseType: !7, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "abs_cost", scope: !115, file: !110, line: 71, baseType: !7, size: 64, offset: 128)
!120 = !{!121}
!121 = !DISubrange(count: 401)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "nr_group", scope: !2, file: !110, line: 128, type: !9, isLocal: true, isDefinition: true)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "group_pos", scope: !2, file: !110, line: 129, type: !9, isLocal: true, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "net", scope: !2, file: !128, line: 22, type: !129, isLocal: false, isDefinition: true)
!128 = !DIFile(filename: "/local/sparrow_test/test/SPEC2000/CINT2000/181.mcf/src/mcf.c", directory: "")
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "network_t", file: !8, line: 119, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "network", file: !8, line: 119, size: 4864, elements: !131)
!131 = !{!132, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "inputfile", scope: !130, file: !8, line: 120, baseType: !133, size: 1600)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1600, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 200)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "clustfile", scope: !130, file: !8, line: 121, baseType: !133, size: 1600, offset: 1600)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !130, file: !8, line: 122, baseType: !9, size: 64, offset: 3200)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "n_trips", scope: !130, file: !8, line: 123, baseType: !9, size: 64, offset: 3264)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "max_m", scope: !130, file: !8, line: 124, baseType: !9, size: 64, offset: 3328)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !130, file: !8, line: 125, baseType: !9, size: 64, offset: 3392)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "m_org", scope: !130, file: !8, line: 126, baseType: !9, size: 64, offset: 3456)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "m_impl", scope: !130, file: !8, line: 127, baseType: !9, size: 64, offset: 3520)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "primal_unbounded", scope: !130, file: !8, line: 128, baseType: !9, size: 64, offset: 3584)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "dual_unbounded", scope: !130, file: !8, line: 129, baseType: !9, size: 64, offset: 3648)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "perturbed", scope: !130, file: !8, line: 130, baseType: !9, size: 64, offset: 3712)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "feasible", scope: !130, file: !8, line: 131, baseType: !9, size: 64, offset: 3776)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !130, file: !8, line: 132, baseType: !9, size: 64, offset: 3840)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "opt_tol", scope: !130, file: !8, line: 133, baseType: !9, size: 64, offset: 3904)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "feas_tol", scope: !130, file: !8, line: 134, baseType: !9, size: 64, offset: 3968)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "pert_val", scope: !130, file: !8, line: 135, baseType: !9, size: 64, offset: 4032)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "bigM", scope: !130, file: !8, line: 136, baseType: !9, size: 64, offset: 4096)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "optcost", scope: !130, file: !8, line: 137, baseType: !106, size: 64, offset: 4160)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_impl", scope: !130, file: !8, line: 138, baseType: !7, size: 64, offset: 4224)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !130, file: !8, line: 139, baseType: !15, size: 64, offset: 4288)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "stop_nodes", scope: !130, file: !8, line: 140, baseType: !15, size: 64, offset: 4352)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !130, file: !8, line: 141, baseType: !10, size: 64, offset: 4416)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "stop_arcs", scope: !130, file: !8, line: 142, baseType: !10, size: 64, offset: 4480)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_arcs", scope: !130, file: !8, line: 143, baseType: !10, size: 64, offset: 4544)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "stop_dummy", scope: !130, file: !8, line: 144, baseType: !10, size: 64, offset: 4608)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !130, file: !8, line: 145, baseType: !9, size: 64, offset: 4672)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "bound_exchanges", scope: !130, file: !8, line: 146, baseType: !9, size: 64, offset: 4736)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !130, file: !8, line: 147, baseType: !9, size: 64, offset: 4800)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "initialize", scope: !2, file: !110, line: 132, type: !9, isLocal: true, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 25664, elements: !120)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!167 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!168 = !{i32 2, !"Dwarf Version", i32 4}
!169 = !{i32 2, !"Debug Info Version", i32 3}
!170 = !{i32 1, !"wchar_size", i32 4}
!171 = !{i32 7, !"PIC Level", i32 2}
!172 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!173 = distinct !DISubprogram(name: "bea_compute_red_cost", scope: !110, file: !110, line: 35, type: !174, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!174 = !DISubroutineType(types: !175)
!175 = !{!7, !10}
!176 = !DILocalVariable(name: "arc", arg: 1, scope: !173, file: !110, line: 35, type: !10)
!177 = !DILocation(line: 0, scope: !173)
!178 = !DILocation(line: 41, column: 17, scope: !179)
!179 = distinct !DILexicalBlock(scope: !173, file: !110, line: 39, column: 3)
!180 = !DILocation(line: 41, column: 30, scope: !179)
!181 = !DILocation(line: 41, column: 37, scope: !179)
!182 = !DILocation(line: 41, column: 22, scope: !179)
!183 = !DILocation(line: 41, column: 56, scope: !179)
!184 = !DILocation(line: 41, column: 63, scope: !179)
!185 = !DILocation(line: 41, column: 48, scope: !179)
!186 = !DILocation(line: 41, column: 3, scope: !179)
!187 = distinct !DISubprogram(name: "bea_is_dual_infeasible", scope: !110, file: !110, line: 51, type: !188, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!188 = !DISubroutineType(types: !189)
!189 = !{!59, !10, !7}
!190 = !DILocalVariable(name: "arc", arg: 1, scope: !187, file: !110, line: 51, type: !10)
!191 = !DILocation(line: 0, scope: !187)
!192 = !DILocalVariable(name: "red_cost", arg: 2, scope: !187, file: !110, line: 51, type: !7)
!193 = !DILocation(line: 58, column: 16, scope: !194)
!194 = distinct !DILexicalBlock(scope: !195, file: !110, line: 58, column: 7)
!195 = distinct !DILexicalBlock(scope: !187, file: !110, line: 55, column: 3)
!196 = !DILocation(line: 58, column: 7, scope: !195)
!197 = !DILocation(line: 58, column: 14, scope: !198)
!198 = distinct !DILexicalBlock(scope: !199, file: !110, line: 58, column: 9)
!199 = distinct !DILexicalBlock(scope: !194, file: !110, line: 58, column: 22)
!200 = !DILocation(line: 58, column: 20, scope: !198)
!201 = !DILocation(line: 58, column: 9, scope: !199)
!202 = !DILocalVariable(name: "tmp", scope: !187, file: !110, line: 53, type: !59)
!203 = !DILocation(line: 59, column: 5, scope: !204)
!204 = distinct !DILexicalBlock(scope: !198, file: !110, line: 58, column: 27)
!205 = !DILocation(line: 58, column: 7, scope: !206)
!206 = distinct !DILexicalBlock(scope: !198, file: !110, line: 59, column: 12)
!207 = !DILocation(line: 60, column: 3, scope: !199)
!208 = !DILocation(line: 58, column: 16, scope: !209)
!209 = distinct !DILexicalBlock(scope: !194, file: !110, line: 58, column: 7)
!210 = !DILocation(line: 58, column: 7, scope: !194)
!211 = !DILocation(line: 58, column: 14, scope: !212)
!212 = distinct !DILexicalBlock(scope: !213, file: !110, line: 58, column: 9)
!213 = distinct !DILexicalBlock(scope: !209, file: !110, line: 58, column: 22)
!214 = !DILocation(line: 58, column: 20, scope: !212)
!215 = !DILocation(line: 58, column: 9, scope: !213)
!216 = !DILocation(line: 59, column: 5, scope: !217)
!217 = distinct !DILexicalBlock(scope: !212, file: !110, line: 58, column: 27)
!218 = !DILocation(line: 0, scope: !212)
!219 = !DILocation(line: 60, column: 3, scope: !213)
!220 = !DILocation(line: 0, scope: !209)
!221 = !DILocation(line: 0, scope: !194)
!222 = !DILocation(line: 58, column: 3, scope: !195)
