; ModuleID = '/tmp/tmp.ll'
source_filename = "c/mp3rename-0.6.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [82 x i8] c"Mp3rename\0A\0Ausage: [-vfhsbia] [file ...]\0A\0AUse 'mp3rename -h' for a usage summary\0A\0A\00", align 1
@.str.1 = private unnamed_addr constant [8 x i8] c"vfhsbia\00", align 1
@optind = external global i32, align 4
@.str.2 = private unnamed_addr constant [51 x i8] c"Info modus can not be used with other arguments.\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"HOME\00", align 1
@.str.4 = private unnamed_addr constant [14 x i8] c"%s/.mp3rename\00", align 1
@.str.5 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.6 = private unnamed_addr constant [8 x i8] c"(&a)-&t\00", align 1
@.str.7 = private unnamed_addr constant [67 x i8] c"Using default look, please use the -s option to set your own look\0A\00", align 1
@.str.8 = private unnamed_addr constant [5 x i8] c".mp3\00", align 1
@.str.9 = private unnamed_addr constant [4 x i8] c"rb+\00", align 1

!0 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"PIC Level", i32 2}
!5 = distinct !DICompileUnit(language: DW_LANG_C99, file: !6, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !8, nameTableKind: GNU)
!6 = !DIFile(filename: "c/mp3rename-0.6.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!7 = !{}
!8 = !{!9, !74, !76, !18, !19, !61, !66, !16, !78, !79, !81}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !11, line: 49, baseType: !12)
!11 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !13, line: 271, size: 1728, elements: !14)
!13 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!14 = !{!15, !17, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !38, !39, !40, !41, !45, !47, !49, !53, !56, !60, !62, !63, !64, !65, !69, !70}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !12, file: !13, line: 272, baseType: !16, size: 32)
!16 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !12, file: !13, line: 273, baseType: !18, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !12, file: !13, line: 274, baseType: !18, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !12, file: !13, line: 275, baseType: !18, size: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !12, file: !13, line: 276, baseType: !18, size: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !12, file: !13, line: 277, baseType: !18, size: 64, offset: 320)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !12, file: !13, line: 278, baseType: !18, size: 64, offset: 384)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !12, file: !13, line: 279, baseType: !18, size: 64, offset: 448)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !12, file: !13, line: 280, baseType: !18, size: 64, offset: 512)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !12, file: !13, line: 281, baseType: !18, size: 64, offset: 576)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !12, file: !13, line: 282, baseType: !18, size: 64, offset: 640)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !12, file: !13, line: 283, baseType: !18, size: 64, offset: 704)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !12, file: !13, line: 284, baseType: !31, size: 64, offset: 768)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !13, line: 186, size: 192, elements: !33)
!33 = !{!34, !35, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !32, file: !13, line: 187, baseType: !31, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !32, file: !13, line: 188, baseType: !36, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !32, file: !13, line: 189, baseType: !16, size: 32, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !12, file: !13, line: 285, baseType: !36, size: 64, offset: 832)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !12, file: !13, line: 286, baseType: !16, size: 32, offset: 896)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !12, file: !13, line: 287, baseType: !16, size: 32, offset: 928)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !12, file: !13, line: 288, baseType: !42, size: 64, offset: 960)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !43, line: 141, baseType: !44)
!43 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!44 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !12, file: !13, line: 289, baseType: !46, size: 16, offset: 1024)
!46 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !12, file: !13, line: 290, baseType: !48, size: 8, offset: 1040)
!48 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !12, file: !13, line: 291, baseType: !50, size: 8, offset: 1048)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 1)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !12, file: !13, line: 292, baseType: !54, size: 64, offset: 1088)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !13, line: 180, baseType: null)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !12, file: !13, line: 293, baseType: !57, size: 64, offset: 1152)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !43, line: 142, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !43, line: 56, baseType: !59)
!59 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !12, file: !13, line: 294, baseType: !61, size: 64, offset: 1216)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !12, file: !13, line: 295, baseType: !61, size: 64, offset: 1280)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !12, file: !13, line: 296, baseType: !61, size: 64, offset: 1344)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !12, file: !13, line: 297, baseType: !61, size: 64, offset: 1408)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !12, file: !13, line: 298, baseType: !66, size: 32, offset: 1472)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !67, line: 211, baseType: !68)
!67 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!68 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !12, file: !13, line: 299, baseType: !16, size: 32, offset: 1504)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !12, file: !13, line: 300, baseType: !71, size: 192, offset: 1536)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 192, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 24)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!78 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!81 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!82 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!83 = distinct !DISubprogram(name: "main", scope: !84, file: !84, line: 25, type: !85, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, retainedNodes: !7)
!84 = !DIFile(filename: "/home/wslee/benchmarks/sound/mp3rename-0.6/mp3rename.c", directory: "")
!85 = !DISubroutineType(types: !86)
!86 = !{!16, !16, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!88 = !DILocalVariable(name: "argc", arg: 1, scope: !83, file: !84, line: 25, type: !16)
!89 = !DILocation(line: 0, scope: !83)
!90 = !DILocalVariable(name: "argv", arg: 2, scope: !83, file: !84, line: 25, type: !87)
!91 = !DILocalVariable(name: "sig", scope: !83, file: !84, line: 34, type: !92)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 24, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 3)
!95 = !DILocation(line: 34, column: 17, scope: !83)
!96 = !DILocalVariable(name: "genre", scope: !83, file: !84, line: 35, type: !50)
!97 = !DILocation(line: 35, column: 8, scope: !83)
!98 = !DILocalVariable(name: "filenamelook", scope: !83, file: !84, line: 41, type: !99)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 800, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 100)
!102 = !DILocation(line: 41, column: 8, scope: !83)
!103 = !DILocalVariable(name: "str", scope: !83, file: !84, line: 42, type: !99)
!104 = !DILocation(line: 42, column: 8, scope: !83)
!105 = !DILocalVariable(name: "title", scope: !83, file: !84, line: 44, type: !106)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 248, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 31)
!109 = !DILocation(line: 44, column: 8, scope: !83)
!110 = !DILocalVariable(name: "artist", scope: !83, file: !84, line: 46, type: !106)
!111 = !DILocation(line: 46, column: 8, scope: !83)
!112 = !DILocalVariable(name: "album", scope: !83, file: !84, line: 48, type: !106)
!113 = !DILocation(line: 48, column: 8, scope: !83)
!114 = !DILocalVariable(name: "year", scope: !83, file: !84, line: 50, type: !115)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 40, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 5)
!118 = !DILocation(line: 50, column: 8, scope: !83)
!119 = !DILocalVariable(name: "comment", scope: !83, file: !84, line: 52, type: !106)
!120 = !DILocation(line: 52, column: 8, scope: !83)
!121 = !DILocalVariable(name: "fbuf", scope: !83, file: !84, line: 54, type: !122)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 32, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 4)
!125 = !DILocation(line: 54, column: 8, scope: !83)
!126 = !DILocalVariable(name: "newfilename", scope: !83, file: !84, line: 55, type: !127)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 1280, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 160)
!130 = !DILocation(line: 55, column: 8, scope: !83)
!131 = !DILocalVariable(name: "nieuw", scope: !83, file: !84, line: 57, type: !132)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 1200, elements: !133)
!133 = !{!134}
