; ModuleID = '/tmp/tmp.ll'
source_filename = "c/mp3wrap-0.5.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.__dirstream = type opaque

@id3 = global <{ [442 x i8], [18 x i8] }> <{ [442 x i8] c"ID3\03\00\00\00\00\03BTRCK\00\00\00\03\00\00\0000TENC\00\00\00\11@\00\00Mp3Wrap  v.  0.0WXXX\00\00\00 \00\00\00\00http://mp3wrap.sourceforge.netTCOP\00\00\00\01\00\00\00TOPE\00\00\00\01\00\00\00TCOM\00\00\00\01\00\00\00COMM\00\00\00\A0\00\00\00\00e \00This file is wrapped with Mp3Wrap. Get mp3splt, the free tool to split original files at http://mp3splt.sourceforge.net. Please do not remove this comment.TCON\00\00\00\01\00\00\00TYER\00\00\00\01\00\00\00TALB\00\00\00\1F\00\00\00http://mp3splt.sourceforge.netTPE1\00\00\00\1A\00\00\00File wrapped with Mp3WrapTIT2\00\00\00&\00\00\00Use Mp3Splt to obtain original tracks", [18 x i8] zeroinitializer }>, align 16, !dbg !0
@.str = private unnamed_addr constant [69 x i8] c"Mp3Wrap Version 0.5 (2003/Jan/16). See README and COPYING for more!\0A\00", align 1
@.str.1 = private unnamed_addr constant [73 x i8] c"Written and copyrights by Matteo Trotta - <matteo.trotta@lib.unimib.it>\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "id3", scope: !2, file: !89, line: 36, type: !90, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !79, nameTableKind: GNU)
!3 = !DIFile(filename: "c/mp3wrap-0.5.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !7, !10, !13, !14, !63, !68, !76, !12, !77, !78, !46, !9}
!6 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !16, line: 49, baseType: !17)
!16 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !18, line: 271, size: 1728, elements: !19)
!18 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !40, !41, !42, !43, !47, !49, !51, !55, !58, !62, !64, !65, !66, !67, !71, !72}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !17, file: !18, line: 272, baseType: !13, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !17, file: !18, line: 273, baseType: !12, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !17, file: !18, line: 274, baseType: !12, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !17, file: !18, line: 275, baseType: !12, size: 64, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !17, file: !18, line: 276, baseType: !12, size: 64, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !17, file: !18, line: 277, baseType: !12, size: 64, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !17, file: !18, line: 278, baseType: !12, size: 64, offset: 384)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !17, file: !18, line: 279, baseType: !12, size: 64, offset: 448)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !17, file: !18, line: 280, baseType: !12, size: 64, offset: 512)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !17, file: !18, line: 281, baseType: !12, size: 64, offset: 576)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !17, file: !18, line: 282, baseType: !12, size: 64, offset: 640)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !17, file: !18, line: 283, baseType: !12, size: 64, offset: 704)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !17, file: !18, line: 284, baseType: !33, size: 64, offset: 768)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !18, line: 186, size: 192, elements: !35)
!35 = !{!36, !37, !39}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !34, file: !18, line: 187, baseType: !33, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !34, file: !18, line: 188, baseType: !38, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !34, file: !18, line: 189, baseType: !13, size: 32, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !17, file: !18, line: 285, baseType: !38, size: 64, offset: 832)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !17, file: !18, line: 286, baseType: !13, size: 32, offset: 896)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !17, file: !18, line: 287, baseType: !13, size: 32, offset: 928)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !17, file: !18, line: 288, baseType: !44, size: 64, offset: 960)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !45, line: 141, baseType: !46)
!45 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!46 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !17, file: !18, line: 289, baseType: !48, size: 16, offset: 1024)
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !17, file: !18, line: 290, baseType: !50, size: 8, offset: 1040)
!50 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !17, file: !18, line: 291, baseType: !52, size: 8, offset: 1048)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 1)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !17, file: !18, line: 292, baseType: !56, size: 64, offset: 1088)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !18, line: 180, baseType: null)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !17, file: !18, line: 293, baseType: !59, size: 64, offset: 1152)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !45, line: 142, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !45, line: 56, baseType: !61)
!61 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !17, file: !18, line: 294, baseType: !63, size: 64, offset: 1216)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !17, file: !18, line: 295, baseType: !63, size: 64, offset: 1280)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !17, file: !18, line: 296, baseType: !63, size: 64, offset: 1344)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !17, file: !18, line: 297, baseType: !63, size: 64, offset: 1408)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !17, file: !18, line: 298, baseType: !68, size: 32, offset: 1472)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 211, baseType: !70)
!69 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!70 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !17, file: !18, line: 299, baseType: !13, size: 32, offset: 1504)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !17, file: !18, line: 300, baseType: !73, size: 192, offset: 1536)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 24)
!76 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!77 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!79 = !{!0, !80}
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "crctab", scope: !2, file: !82, line: 31, type: !83, isLocal: true, isDefinition: true)
!82 = !DIFile(filename: "/home/wslee/benchmarks/sound/mp3wrap-0.5/crc.c", directory: "")
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8192, elements: !87)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32_t", file: !86, line: 203, baseType: !70)
!86 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!87 = !{!88}
!88 = !DISubrange(count: 256)
!89 = !DIFile(filename: "/home/wslee/benchmarks/sound/mp3wrap-0.5/mp3wrap.c", directory: "")
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 3680, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 460)
!93 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!94 = !{i32 2, !"Dwarf Version", i32 4}
!95 = !{i32 2, !"Debug Info Version", i32 3}
!96 = !{i32 1, !"wchar_size", i32 4}
!97 = !{i32 7, !"PIC Level", i32 2}
!98 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!99 = distinct !DISubprogram(name: "main", scope: !89, file: !89, line: 68, type: !100, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!100 = !DISubroutineType(types: !101)
!101 = !{!13, !13, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!103 = !DILocalVariable(name: "argc", arg: 1, scope: !99, file: !89, line: 68, type: !13)
!104 = !DILocation(line: 0, scope: !99)
!105 = !DILocalVariable(name: "argv", arg: 2, scope: !99, file: !89, line: 68, type: !102)
!106 = !DILocalVariable(name: "splitpoints", scope: !99, file: !89, line: 72, type: !107)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 16384, elements: !87)
!108 = !DILocation(line: 72, column: 17, scope: !99)
!109 = !DILocalVariable(name: "filename", scope: !99, file: !89, line: 78, type: !110)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 4096, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 512)
!113 = !DILocation(line: 78, column: 17, scope: !99)
!114 = !DILocalVariable(name: "ext", scope: !99, file: !89, line: 81, type: !110)
!115 = !DILocation(line: 81, column: 17, scope: !99)
!116 = !DILocalVariable(name: "__cil_tmp71", scope: !99, file: !89, line: 138, type: !63)
!117 = !DILocation(line: 138, column: 9, scope: !99)
!118 = !DILocalVariable(name: "__cil_tmp72", scope: !99, file: !89, line: 139, type: !63)
!119 = !DILocation(line: 139, column: 9, scope: !99)
!120 = !DILocalVariable(name: "__cil_tmp73", scope: !99, file: !89, line: 140, type: !63)
!121 = !DILocation(line: 140, column: 9, scope: !99)
!122 = !DILocalVariable(name: "__cil_tmp74", scope: !99, file: !89, line: 141, type: !12)
!123 = !DILocation(line: 141, column: 9, scope: !99)
!124 = !DILocalVariable(name: "__cil_tmp75", scope: !99, file: !89, line: 142, type: !12)
!125 = !DILocation(line: 142, column: 9, scope: !99)
!126 = !DILocalVariable(name: "__cil_tmp76", scope: !99, file: !89, line: 143, type: !12)
!127 = !DILocation(line: 143, column: 9, scope: !99)
!128 = !DILocalVariable(name: "__cil_tmp77", scope: !99, file: !89, line: 144, type: !12)
!129 = !DILocation(line: 144, column: 9, scope: !99)
!130 = !DILocalVariable(name: "__cil_tmp78", scope: !99, file: !89, line: 145, type: !12)
!131 = !DILocation(line: 145, column: 9, scope: !99)
