; ModuleID = '/tmp/tmp.ll'
source_filename = "c/nlkain-1.3.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct.__anonstruct_SYSTEM_24 = type { i32, i32, double, double, double, double*, double*, double*, double*, %struct.nka_state* }
%struct.nka_state = type { i32, i32, i32, i32, double, double**, double**, double**, i32, i32, i32, i32*, i32*, double (i32, double*, double*)* }

@.str = private unnamed_addr constant [21 x i8] c"\0AACCELERATED SOLVE\0A\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"\0AUNACCELERATED SOLVE\0A\0A\00", align 1
@.str.2 = private unnamed_addr constant [41 x i8] c"Iter Residual Norm    Reduction    Rate\0A\00", align 1
@.str.3 = private unnamed_addr constant [12 x i8] c"%3d:%14.6E\0A\00", align 1
@.str.4 = private unnamed_addr constant [23 x i8] c"%3d:%14.6E%13.3E%8.3f\0A\00", align 1

; Function Attrs: noinline nounwind ssp uwtable
define i32 @main() #0 !dbg !43 {
entry:
  %sys = alloca %struct.__anonstruct_SYSTEM_24, align 8
  call void @llvm.dbg.declare(metadata %struct.__anonstruct_SYSTEM_24* %sys, metadata !47, metadata !DIExpression()), !dbg !61
  call void @llvm.dbg.value(metadata i32 50, metadata !62, metadata !DIExpression()), !dbg !63
  call void @llvm.dbg.value(metadata double 2.000000e-02, metadata !64, metadata !DIExpression()), !dbg !63
  call void @llvm.dbg.value(metadata i32 2, metadata !65, metadata !DIExpression()), !dbg !63

!0 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"PIC Level", i32 2}
!5 = distinct !DICompileUnit(language: DW_LANG_C99, file: !6, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !8, nameTableKind: GNU)
!6 = !DIFile(filename: "c/nlkain-1.3.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!7 = !{}
!8 = !{!9, !10, !11, !12, !16, !17, !20, !32, !39}
!9 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DISubroutineType(types: !14)
!14 = !{!9, !15, !11, !11}
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "NKA", file: !21, line: 3, baseType: !22)
!21 = !DIFile(filename: "/home/wslee/projects/uav/test/nlkain-1.3/src-C/nonlinear_krylov_accelerator.h", directory: "")
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nka_state", file: !24, line: 167, size: 704, elements: !25)
!24 = !DIFile(filename: "/home/wslee/projects/uav/test/nlkain-1.3/src-C/nonlinear_krylov_accelerator.c", directory: "")
!25 = !{!26, !27, !28, !29, !30, !31, !33, !34, !35, !36, !37, !38, !40, !41}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "subspace", scope: !23, file: !24, line: 168, baseType: !15, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !23, file: !24, line: 169, baseType: !15, size: 32, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "vsize", scope: !23, file: !24, line: 170, baseType: !15, size: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "mvec", scope: !23, file: !24, line: 171, baseType: !15, size: 32, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "vtol", scope: !23, file: !24, line: 172, baseType: !9, size: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !23, file: !24, line: 173, baseType: !32, size: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !24, line: 174, baseType: !32, size: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !23, file: !24, line: 175, baseType: !32, size: 64, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !23, file: !24, line: 176, baseType: !15, size: 32, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !23, file: !24, line: 177, baseType: !15, size: 32, offset: 416)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !23, file: !24, line: 178, baseType: !15, size: 32, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !23, file: !24, line: 179, baseType: !39, size: 64, offset: 512)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !23, file: !24, line: 180, baseType: !39, size: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "dp", scope: !23, file: !24, line: 181, baseType: !12, size: 64, offset: 640)
!42 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!43 = distinct !DISubprogram(name: "main", scope: !44, file: !44, line: 77, type: !45, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, retainedNodes: !7)
!44 = !DIFile(filename: "/home/wslee/projects/uav/test/nlkain-1.3/src-C/nka_c_test.c", directory: "")
!45 = !DISubroutineType(types: !46)
!46 = !{!15}
!47 = !DILocalVariable(name: "sys", scope: !43, file: !44, line: 84, type: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSTEM", file: !44, line: 63, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_SYSTEM_24", file: !44, line: 63, size: 576, elements: !50)
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58, !59, !60}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "nx", scope: !49, file: !44, line: 64, baseType: !15, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ny", scope: !49, file: !44, line: 65, baseType: !15, size: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !49, file: !44, line: 66, baseType: !9, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "hx", scope: !49, file: !44, line: 67, baseType: !9, size: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "hy", scope: !49, file: !44, line: 68, baseType: !9, size: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ax", scope: !49, file: !44, line: 69, baseType: !11, size: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ay", scope: !49, file: !44, line: 70, baseType: !11, size: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ac", scope: !49, file: !44, line: 71, baseType: !11, size: 64, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !49, file: !44, line: 72, baseType: !11, size: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "nka", scope: !49, file: !44, line: 73, baseType: !20, size: 64, offset: 512)
!61 = !DILocation(line: 84, column: 10, scope: !43)
!62 = !DILocalVariable(name: "N", scope: !43, file: !44, line: 79, type: !15)
!63 = !DILocation(line: 0, scope: !43)
!64 = !DILocalVariable(name: "A", scope: !43, file: !44, line: 80, type: !9)
!65 = !DILocalVariable(name: "nsweep", scope: !43, file: !44, line: 82, type: !15)
!66 = !DILocalVariable(name: "omega", scope: !43, file: !44, line: 83, type: !9)
!67 = !DILocation(line: 87, column: 7, scope: !68)
!68 = distinct !DILexicalBlock(scope: !69, file: !44, line: 93, column: 3)
!69 = distinct !DILexicalBlock(scope: !43, file: !44, line: 92, column: 3)
!70 = !DILocation(line: 87, column: 9, scope: !68)
!71 = !DILocation(line: 88, column: 7, scope: !68)
!72 = !DILocation(line: 88, column: 10, scope: !68)
!73 = !DILocation(line: 89, column: 7, scope: !68)
!74 = !DILocation(line: 89, column: 10, scope: !68)
!75 = !DILocation(line: 90, column: 31, scope: !68)
!76 = !DILocation(line: 90, column: 18, scope: !68)
!77 = !DILocation(line: 90, column: 16, scope: !68)
!78 = !DILocation(line: 90, column: 7, scope: !68)
!79 = !DILocation(line: 90, column: 10, scope: !68)
!80 = !DILocation(line: 91, column: 31, scope: !68)
!81 = !DILocation(line: 91, column: 18, scope: !68)
!82 = !DILocation(line: 91, column: 16, scope: !68)
!83 = !DILocation(line: 91, column: 7, scope: !68)
!84 = !DILocation(line: 91, column: 10, scope: !68)
!85 = !DILocation(line: 92, column: 37, scope: !86)
!86 = distinct !DILexicalBlock(scope: !68, file: !44, line: 92, column: 3)
!87 = !DILocation(line: 92, column: 47, scope: !86)
!88 = !DILocation(line: 92, column: 50, scope: !86)
!89 = !DILocation(line: 92, column: 40, scope: !86)
!90 = !DILocation(line: 92, column: 16, scope: !86)
!91 = !DILocation(line: 92, column: 56, scope: !86)
!92 = !DILocation(line: 92, column: 9, scope: !86)
!93 = !DILocalVariable(name: "tmp", scope: !43, file: !44, line: 86, type: !16)
!94 = !DILocation(line: 92, column: 12, scope: !68)
!95 = !DILocation(line: 92, column: 7, scope: !68)
!96 = !DILocation(line: 92, column: 10, scope: !68)
!97 = !DILocation(line: 93, column: 41, scope: !98)
!98 = distinct !DILexicalBlock(scope: !68, file: !44, line: 93, column: 3)
!99 = !DILocation(line: 93, column: 51, scope: !98)
!100 = !DILocation(line: 93, column: 54, scope: !98)
!101 = !DILocation(line: 93, column: 44, scope: !98)
!102 = !DILocation(line: 93, column: 20, scope: !98)
!103 = !DILocation(line: 93, column: 60, scope: !98)
!104 = !DILocation(line: 93, column: 13, scope: !98)
!105 = !DILocalVariable(name: "tmp___0", scope: !43, file: !44, line: 87, type: !16)
!106 = !DILocation(line: 93, column: 12, scope: !68)
!107 = !DILocation(line: 93, column: 7, scope: !68)
!108 = !DILocation(line: 93, column: 10, scope: !68)
!109 = !DILocation(line: 94, column: 41, scope: !110)
!110 = distinct !DILexicalBlock(scope: !68, file: !44, line: 94, column: 3)
!111 = !DILocation(line: 94, column: 50, scope: !110)
!112 = !DILocation(line: 94, column: 44, scope: !110)
!113 = !DILocation(line: 94, column: 20, scope: !110)
!114 = !DILocation(line: 94, column: 54, scope: !110)
!115 = !DILocation(line: 94, column: 13, scope: !110)
!116 = !DILocalVariable(name: "tmp___1", scope: !43, file: !44, line: 88, type: !16)
!117 = !DILocation(line: 94, column: 12, scope: !68)
!118 = !DILocation(line: 94, column: 7, scope: !68)
!119 = !DILocation(line: 94, column: 10, scope: !68)
!120 = !DILocation(line: 95, column: 41, scope: !121)
!121 = distinct !DILexicalBlock(scope: !68, file: !44, line: 95, column: 3)
!122 = !DILocation(line: 95, column: 50, scope: !121)
!123 = !DILocation(line: 95, column: 44, scope: !121)
!124 = !DILocation(line: 95, column: 20, scope: !121)
!125 = !DILocation(line: 95, column: 54, scope: !121)
!126 = !DILocation(line: 95, column: 13, scope: !121)
!127 = !DILocalVariable(name: "tmp___2", scope: !43, file: !44, line: 89, type: !16)
