; ModuleID = '/tmp/tmp.ll'
source_filename = "c/normalize-audio-0.7.7.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.progress_struct = type { i64, i64, i64*, i64, i64, i32 }
%struct.fid_desc = type { i8*, i8* }
%struct.frame_convert = type { i8*, i8*, i32 (%struct.id3_frame_struct*, i8*, i8*, i32)* }
%struct.id3_frame_struct = type { [5 x i8], i32, i16, i8, i32, i8*, i8*, i64, %struct.id3_struct*, %struct.id3_frame_struct* }
%struct.id3_struct = type { %struct._IO_FILE*, i64, i64, i8*, i8, i8, i32, i32, i32, i32, i32, %struct.id3_frame_struct*, %struct.id3_frame_struct*, i16, [2 x i8], %struct.id3v1_struct }
%struct.id3v1_struct = type { i8, [31 x i8], [31 x i8], [31 x i8], [5 x i8], [31 x i8], i8, [4 x i8], i8, [4 x i8] }
%struct.imgtype_mimetype_struct = type { i8*, i8* }
%struct.signal_info = type { double, double, i64, i64, i32, i32, i32, i64, i32 }
%struct.stat = type { i64, i16, i64, i32, i32, i32, i32, i64, i16, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct._AFfilesetup = type opaque
%struct._AFfilehandle = type opaque
%struct.__anonstruct_datasmooth_t_27 = type { double*, i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "do_compute_levels", scope: !2, file: !318, line: 161, type: !51, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !47, globals: !309, nameTableKind: GNU)
!3 = !DIFile(filename: "c/normalize-audio-0.7.7.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{!5, !12, !18, !30, !37}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "id3_pad_policy", file: !6, line: 47, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/home/wslee/benchmarks/sound/normalize-audio-0.7.7/nid3lib/nid3.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "ID3_PADDING_DEFAULT", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "ID3_PADDING_NONE", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "ID3_PADDING_CUSTOM", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "id3_text_encoding", file: !6, line: 30, baseType: !7, size: 32, elements: !13)
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "ID3_TEXT_ISO", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "ID3_TEXT_UTF16", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "ID3_TEXT_UTF16BE", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "ID3_TEXT_UTF8", value: 3, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "id3_rva_channel", file: !6, line: 73, baseType: !7, size: 32, elements: !19)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29}
!20 = !DIEnumerator(name: "ID3_CHANNEL_OTHER", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "ID3_CHANNEL_MASTER", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "ID3_CHANNEL_FRIGHT", value: 2, isUnsigned: true)
!23 = !DIEnumerator(name: "ID3_CHANNEL_FLEFT", value: 3, isUnsigned: true)
!24 = !DIEnumerator(name: "ID3_CHANNEL_BRIGHT", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "ID3_CHANNEL_BLEFT", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "ID3_CHANNEL_FCENTER", value: 6, isUnsigned: true)
!27 = !DIEnumerator(name: "ID3_CHANNEL_BCENTER", value: 7, isUnsigned: true)
!28 = !DIEnumerator(name: "ID3_CHANNEL_SUB", value: 8, isUnsigned: true)
!29 = !DIEnumerator(name: "ID3_CHANNEL_ANY", value: 255, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "id3_version", file: !6, line: 38, baseType: !7, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35, !36}
!32 = !DIEnumerator(name: "ID3_VERSION_NONE", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "ID3_VERSION_1", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "ID3_VERSION_2_2", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "ID3_VERSION_2_3", value: 3, isUnsigned: true)
!36 = !DIEnumerator(name: "ID3_VERSION_2_4", value: 4, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "id3_fflag", file: !6, line: 57, baseType: !7, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46}
!39 = !DIEnumerator(name: "ID3_FFLAG_TAGALTER_PRESERVE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "ID3_FFLAG_FILEALTER_PRESERVE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "ID3_FFLAG_READONLY", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "ID3_FFLAG_HAS_GROUPID", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "ID3_FFLAG_IS_COMPRESSED", value: 4, isUnsigned: true)
!44 = !DIEnumerator(name: "ID3_FFLAG_IS_ENCRYPTED", value: 5, isUnsigned: true)
!45 = !DIEnumerator(name: "ID3_FFLAG_IS_UNSYNCED", value: 6, isUnsigned: true)
!46 = !DIEnumerator(name: "ID3_FFLAG_HAS_DATALEN", value: 7, isUnsigned: true)
!47 = !{!48, !51, !52, !54, !55, !63, !105, !50, !115, !116, !118, !120, !121, !125, !7, !88, !127, !128, !137, !140, !141, !143, !152, !138, !153, !154, !189, !202, !119, !205, !30, !270, !288, !206, !222, !5, !37, !90, !290, !123, !291, !292, !293, !294, !296, !12, !297, !18, !298}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!50 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!51 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !53, line: 211, baseType: !7)
!53 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!54 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !57, line: 49, baseType: !58)
!57 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 271, size: 1728, elements: !60)
!59 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!60 = !{!61, !62, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !82, !83, !84, !85, !89, !91, !93, !97, !100, !104, !106, !107, !108, !109, !110, !111}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !58, file: !59, line: 272, baseType: !51, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !58, file: !59, line: 273, baseType: !63, size: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !58, file: !59, line: 274, baseType: !63, size: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !58, file: !59, line: 275, baseType: !63, size: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !58, file: !59, line: 276, baseType: !63, size: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !58, file: !59, line: 277, baseType: !63, size: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !58, file: !59, line: 278, baseType: !63, size: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !58, file: !59, line: 279, baseType: !63, size: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !58, file: !59, line: 280, baseType: !63, size: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !58, file: !59, line: 281, baseType: !63, size: 64, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !58, file: !59, line: 282, baseType: !63, size: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !58, file: !59, line: 283, baseType: !63, size: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !58, file: !59, line: 284, baseType: !75, size: 64, offset: 768)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !59, line: 186, size: 192, elements: !77)
!77 = !{!78, !79, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !76, file: !59, line: 187, baseType: !75, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !76, file: !59, line: 188, baseType: !80, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !76, file: !59, line: 189, baseType: !51, size: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !58, file: !59, line: 285, baseType: !80, size: 64, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !58, file: !59, line: 286, baseType: !51, size: 32, offset: 896)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !58, file: !59, line: 287, baseType: !51, size: 32, offset: 928)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !58, file: !59, line: 288, baseType: !86, size: 64, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !87, line: 141, baseType: !88)
!87 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!88 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !58, file: !59, line: 289, baseType: !90, size: 16, offset: 1024)
!90 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !58, file: !59, line: 290, baseType: !92, size: 8, offset: 1040)
!92 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !58, file: !59, line: 291, baseType: !94, size: 8, offset: 1048)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 1)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !58, file: !59, line: 292, baseType: !98, size: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !59, line: 180, baseType: null)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !58, file: !59, line: 293, baseType: !101, size: 64, offset: 1152)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !87, line: 142, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !87, line: 56, baseType: !103)
!103 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !58, file: !59, line: 294, baseType: !105, size: 64, offset: 1216)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !58, file: !59, line: 295, baseType: !105, size: 64, offset: 1280)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !58, file: !59, line: 296, baseType: !105, size: 64, offset: 1344)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !58, file: !59, line: 297, baseType: !105, size: 64, offset: 1408)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !58, file: !59, line: 298, baseType: !52, size: 32, offset: 1472)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !58, file: !59, line: 299, baseType: !51, size: 32, offset: 1504)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !58, file: !59, line: 300, baseType: !112, size: 192, offset: 1536)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 192, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 24)
!115 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!120 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "AFfilesetup", file: !122, line: 44, baseType: !123)
!122 = !DIFile(filename: "/usr/include/audiofile.h", directory: "")
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_AFfilesetup", file: !122, line: 44, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_AFfilehandle", file: !122, line: 45, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "datasmooth_t", file: !130, line: 111, baseType: !131)
!130 = !DIFile(filename: "/home/wslee/benchmarks/sound/normalize-audio-0.7.7/src/volume.c", directory: "")
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_datasmooth_t_27", file: !130, line: 111, size: 192, elements: !132)
!132 = !{!133, !134, !135, !136}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !131, file: !130, line: 112, baseType: !127, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !131, file: !130, line: 113, baseType: !51, size: 32, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !131, file: !130, line: 114, baseType: !51, size: 32, offset: 96)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !131, file: !130, line: 115, baseType: !51, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "AFframecount", file: !122, line: 48, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !139, line: 88, baseType: !86)
!139 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !146, line: 79, size: 256, elements: !147)
!146 = !DIFile(filename: "./getopt.h", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!147 = !{!148, !149, !150, !151}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !145, file: !146, line: 80, baseType: !48, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !145, file: !146, line: 81, baseType: !51, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !145, file: !146, line: 82, baseType: !140, size: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !145, file: !146, line: 83, baseType: !51, size: 32, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !156, line: 43, size: 1152, elements: !157)
!156 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!157 = !{!158, !162, !163, !165, !167, !169, !171, !173, !174, !175, !176, !178, !180, !182, !183, !184, !185, !186, !187, !188}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !155, file: !156, line: 44, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !87, line: 134, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_quad_t", file: !87, line: 57, baseType: !161)
!161 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !155, file: !156, line: 45, baseType: !90, size: 16, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !155, file: !156, line: 46, baseType: !164, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !87, line: 137, baseType: !115)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !155, file: !156, line: 47, baseType: !166, size: 32, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !87, line: 139, baseType: !7)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !155, file: !156, line: 48, baseType: !168, size: 32, offset: 224)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !87, line: 140, baseType: !7)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !155, file: !156, line: 49, baseType: !170, size: 32, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !87, line: 135, baseType: !7)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !155, file: !156, line: 50, baseType: !172, size: 32, offset: 288)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !87, line: 136, baseType: !7)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !155, file: !156, line: 51, baseType: !159, size: 64, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !155, file: !156, line: 52, baseType: !90, size: 16, offset: 384)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !155, file: !156, line: 53, baseType: !86, size: 64, offset: 448)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !155, file: !156, line: 54, baseType: !177, size: 64, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !87, line: 164, baseType: !88)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !155, file: !156, line: 55, baseType: !179, size: 64, offset: 576)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !87, line: 169, baseType: !88)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "st_atime", scope: !155, file: !156, line: 56, baseType: !181, size: 64, offset: 640)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !87, line: 149, baseType: !88)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimensec", scope: !155, file: !156, line: 57, baseType: !115, size: 64, offset: 704)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtime", scope: !155, file: !156, line: 58, baseType: !181, size: 64, offset: 768)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimensec", scope: !155, file: !156, line: 59, baseType: !115, size: 64, offset: 832)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctime", scope: !155, file: !156, line: 60, baseType: !181, size: 64, offset: 896)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimensec", scope: !155, file: !156, line: 61, baseType: !115, size: 64, offset: 960)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__unused4", scope: !155, file: !156, line: 62, baseType: !115, size: 64, offset: 1024)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__unused5", scope: !155, file: !156, line: 63, baseType: !115, size: 64, offset: 1088)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "signal_info", file: !191, line: 49, size: 512, elements: !192)
!191 = !DIFile(filename: "/home/wslee/benchmarks/sound/normalize-audio-0.7.7/src/common.h", directory: "")
!192 = !{!193, !194, !195, !196, !197, !198, !199, !200, !201}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !190, file: !191, line: 50, baseType: !54, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "peak", scope: !190, file: !191, line: 51, baseType: !54, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "max_sample", scope: !190, file: !191, line: 52, baseType: !88, size: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "min_sample", scope: !190, file: !191, line: 53, baseType: !88, size: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !190, file: !191, line: 54, baseType: !51, size: 32, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_sample", scope: !190, file: !191, line: 55, baseType: !51, size: 32, offset: 288)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "samples_per_sec", scope: !190, file: !191, line: 56, baseType: !7, size: 32, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "file_size", scope: !190, file: !191, line: 57, baseType: !138, size: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "orig_index", scope: !190, file: !191, line: 58, baseType: !51, size: 32, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !204, line: 76, baseType: !181)
!204 = !DIFile(filename: "/usr/include/time.h", directory: "")
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "id3_frame_t", file: !6, line: 22, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "id3_frame_struct", file: !208, line: 81, size: 512, elements: !209)
!208 = !DIFile(filename: "/home/wslee/benchmarks/sound/normalize-audio-0.7.7/nid3lib/nid3P.h", directory: "")
!209 = !{!210, !214, !215, !216, !217, !218, !219, !220, !221, !269}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !207, file: !208, line: 82, baseType: !211, size: 40)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 40, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 5)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !207, file: !208, line: 83, baseType: !51, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !207, file: !208, line: 84, baseType: !90, size: 16, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "groupid", scope: !207, file: !208, line: 85, baseType: !119, size: 8, offset: 112)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "datalen", scope: !207, file: !208, line: 86, baseType: !51, size: 32, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !207, file: !208, line: 87, baseType: !118, size: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "curr_txt", scope: !207, file: !208, line: 88, baseType: !63, size: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !207, file: !208, line: 89, baseType: !138, size: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "id3", scope: !207, file: !208, line: 90, baseType: !222, size: 64, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "id3_t", file: !6, line: 21, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "id3_struct", file: !208, line: 47, size: 1728, elements: !225)
!225 = !{!226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !224, file: !208, line: 48, baseType: !55, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !224, file: !208, line: 49, baseType: !138, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "curr_off", scope: !224, file: !208, line: 50, baseType: !138, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !224, file: !208, line: 51, baseType: !63, size: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !224, file: !208, line: 52, baseType: !119, size: 8, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !224, file: !208, line: 53, baseType: !119, size: 8, offset: 264)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tagsz", scope: !224, file: !208, line: 54, baseType: !51, size: 32, offset: 288)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !224, file: !208, line: 55, baseType: !51, size: 32, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !224, file: !208, line: 56, baseType: !51, size: 32, offset: 352)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "pad_policy", scope: !224, file: !208, line: 57, baseType: !5, size: 32, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "requested_sz", scope: !224, file: !208, line: 58, baseType: !51, size: 32, offset: 416)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "frame_hd", scope: !224, file: !208, line: 59, baseType: !205, size: 64, offset: 448)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "frame_tl", scope: !224, file: !208, line: 60, baseType: !205, size: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "unsync", scope: !224, file: !208, line: 61, baseType: !7, size: 1, offset: 576, flags: DIFlagBitField, extraData: i64 576)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "has_ext_hdr", scope: !224, file: !208, line: 62, baseType: !7, size: 1, offset: 577, flags: DIFlagBitField, extraData: i64 576)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "experimental", scope: !224, file: !208, line: 63, baseType: !7, size: 1, offset: 578, flags: DIFlagBitField, extraData: i64 576)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "has_footer", scope: !224, file: !208, line: 64, baseType: !7, size: 1, offset: 579, flags: DIFlagBitField, extraData: i64 576)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !224, file: !208, line: 65, baseType: !7, size: 1, offset: 580, flags: DIFlagBitField, extraData: i64 576)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "has_crc", scope: !224, file: !208, line: 66, baseType: !7, size: 1, offset: 581, flags: DIFlagBitField, extraData: i64 576)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "has_restrict", scope: !224, file: !208, line: 67, baseType: !7, size: 1, offset: 582, flags: DIFlagBitField, extraData: i64 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !224, file: !208, line: 68, baseType: !7, size: 1, offset: 583, flags: DIFlagBitField, extraData: i64 576)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "append", scope: !224, file: !208, line: 69, baseType: !7, size: 1, offset: 584, flags: DIFlagBitField, extraData: i64 576)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "append_req", scope: !224, file: !208, line: 70, baseType: !7, size: 1, offset: 585, flags: DIFlagBitField, extraData: i64 576)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !224, file: !208, line: 71, baseType: !250, size: 1120, offset: 608)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "id3v1_struct", file: !208, line: 33, size: 1120, elements: !251)
!251 = !{!252, !253, !254, !258, !259, !260, !261, !262, !263, !267, !268}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !250, file: !208, line: 34, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "requested", scope: !250, file: !208, line: 35, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !250, file: !208, line: 36, baseType: !255, size: 248, offset: 8)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 248, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 31)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "artist", scope: !250, file: !208, line: 37, baseType: !255, size: 248, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "album", scope: !250, file: !208, line: 38, baseType: !255, size: 248, offset: 504)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !250, file: !208, line: 39, baseType: !211, size: 40, offset: 752)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !250, file: !208, line: 40, baseType: !255, size: 248, offset: 792)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !250, file: !208, line: 41, baseType: !119, size: 8, offset: 1040)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "trackstr", scope: !250, file: !208, line: 42, baseType: !264, size: 32, offset: 1048)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 32, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 4)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "genre", scope: !250, file: !208, line: 43, baseType: !119, size: 8, offset: 1080)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "genrestr", scope: !250, file: !208, line: 44, baseType: !264, size: 32, offset: 1088)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !208, line: 91, baseType: !206, size: 64, offset: 448)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !57, line: 91, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "_G_fpos_t", file: !273, line: 22, baseType: !274)
!273 = !DIFile(filename: "/usr/include/_G_config.h", directory: "")
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct__G_fpos_t_4", file: !273, line: 22, size: 128, elements: !275)
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__pos", scope: !274, file: !273, line: 23, baseType: !86, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !274, file: !273, line: 24, baseType: !278, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !279, line: 83, baseType: !280)
!279 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct___mbstate_t_2", file: !279, line: 83, size: 64, elements: !281)
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !280, file: !279, line: 84, baseType: !51, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !280, file: !279, line: 85, baseType: !284, size: 32, offset: 32)
!284 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion___value_3", file: !279, line: 83, size: 32, elements: !285)
!285 = !{!286, !287}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !284, file: !279, line: 84, baseType: !7, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !284, file: !279, line: 85, baseType: !264, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !139, line: 197, baseType: !51)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !139, line: 195, baseType: !92)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !139, line: 196, baseType: !295)
!295 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_convert", file: !301, line: 55, size: 192, elements: !302)
!301 = !DIFile(filename: "/home/wslee/benchmarks/sound/normalize-audio-0.7.7/nid3lib/versions.c", directory: "")
!302 = !{!303, !304, !305}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !300, file: !301, line: 56, baseType: !48, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !300, file: !301, line: 57, baseType: !48, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "converter", scope: !300, file: !301, line: 58, baseType: !306, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!51, !205, !48, !48, !51}
!309 = !{!310, !316, !319, !321, !323, !325, !0, !327, !329, !331, !333, !335, !337, !339, !341, !343, !345, !347, !349, !351, !353, !355, !357, !367, !373, !379, !382, !388, !390, !401, !406, !416}
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "version", scope: !2, file: !312, line: 3, type: !313, isLocal: false, isDefinition: true)
!312 = !DIFile(filename: "/home/wslee/benchmarks/sound/normalize-audio-0.7.7/src/version.c", directory: "")
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 48, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 6)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !318, line: 156, type: !51, isLocal: false, isDefinition: true)
!318 = !DIFile(filename: "/home/wslee/benchmarks/sound/normalize-audio-0.7.7/src/normalize.c", directory: "")
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "do_print_only", scope: !2, file: !318, line: 157, type: !51, isLocal: false, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "do_apply_gain", scope: !2, file: !318, line: 158, type: !51, isLocal: false, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "target", scope: !2, file: !318, line: 159, type: !54, isLocal: false, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "threshold", scope: !2, file: !318, line: 160, type: !54, isLocal: false, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "output_bitwidth", scope: !2, file: !318, line: 162, type: !51, isLocal: false, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "gain_in_decibels", scope: !2, file: !318, line: 163, type: !51, isLocal: false, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "batch_mode", scope: !2, file: !318, line: 164, type: !51, isLocal: false, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "mix_mode", scope: !2, file: !318, line: 165, type: !51, isLocal: false, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "use_limiter", scope: !2, file: !318, line: 166, type: !51, isLocal: false, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "use_peak", scope: !2, file: !318, line: 167, type: !51, isLocal: false, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "use_fractions", scope: !2, file: !318, line: 168, type: !51, isLocal: false, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "show_progress", scope: !2, file: !318, line: 169, type: !51, isLocal: false, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "do_query", scope: !2, file: !318, line: 170, type: !51, isLocal: false, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "frontend", scope: !2, file: !318, line: 171, type: !51, isLocal: false, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "lmtr_lvl", scope: !2, file: !318, line: 172, type: !54, isLocal: false, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "adjust_thresh", scope: !2, file: !318, line: 173, type: !54, isLocal: false, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "id3_compat", scope: !2, file: !318, line: 174, type: !51, isLocal: false, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "id3_unsync", scope: !2, file: !318, line: 175, type: !51, isLocal: false, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "progname", scope: !2, file: !318, line: 94, type: !63, isLocal: false, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "progress_info", scope: !2, file: !318, line: 95, type: !359, isLocal: false, isDefinition: true)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "progress_struct", file: !191, line: 66, size: 384, elements: !360)
!360 = !{!361, !362, !363, !364, !365, !366}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "file_start", scope: !359, file: !191, line: 67, baseType: !203, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "batch_start", scope: !359, file: !191, line: 68, baseType: !203, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "file_sizes", scope: !359, file: !191, line: 69, baseType: !153, size: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "batch_size", scope: !359, file: !191, line: 70, baseType: !138, size: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "finished_size", scope: !359, file: !191, line: 71, baseType: !138, size: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "on_file", scope: !359, file: !191, line: 72, baseType: !51, size: 32, offset: 320)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "sfx", scope: !2, file: !369, line: 626, type: !370, isLocal: true, isDefinition: true)
!369 = !DIFile(filename: "/home/wslee/benchmarks/sound/normalize-audio-0.7.7/src/adjust.c", directory: "")
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 56, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 7)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "_genre_map", scope: !2, file: !375, line: 37, type: !376, isLocal: true, isDefinition: true)
!375 = !DIFile(filename: "/home/wslee/benchmarks/sound/normalize-audio-0.7.7/nid3lib/genre.c", directory: "")
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 9536, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 149)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "sfx___0", scope: !2, file: !381, line: 910, type: !370, isLocal: true, isDefinition: true)
!381 = !DIFile(filename: "/home/wslee/benchmarks/sound/normalize-audio-0.7.7/nid3lib/write.c", directory: "")
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "v4_fflag_masks", scope: !2, file: !384, line: 77, type: !385, isLocal: true, isDefinition: true)
!384 = !DIFile(filename: "/home/wslee/benchmarks/sound/normalize-audio-0.7.7/nid3lib/nid3.c", directory: "")
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 128, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 8)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "v3_fflag_masks", scope: !2, file: !384, line: 73, type: !385, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "fid_desc_map", scope: !2, file: !392, line: 40, type: !393, isLocal: true, isDefinition: true)
!392 = !DIFile(filename: "/home/wslee/benchmarks/sound/normalize-audio-0.7.7/nid3lib/frame_desc.c", directory: "")
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 19968, elements: !399)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fid_desc", file: !392, line: 35, size: 128, elements: !396)
!396 = !{!397, !398}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !395, file: !392, line: 36, baseType: !48, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !395, file: !392, line: 37, baseType: !48, size: 64, offset: 64)
!399 = !{!400}
!400 = !DISubrange(count: 156)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "_convert_map_v2to3", scope: !2, file: !301, line: 67, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 12480, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 65)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "imgtype_mimetype_map", scope: !2, file: !301, line: 193, type: !408, isLocal: true, isDefinition: true)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 1408, elements: !414)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imgtype_mimetype_struct", file: !301, line: 188, size: 128, elements: !411)
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "imgtype", scope: !410, file: !301, line: 189, baseType: !48, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "mimetype", scope: !410, file: !301, line: 190, baseType: !48, size: 64, offset: 64)
!414 = !{!415}
!415 = !DISubrange(count: 11)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "_convert_map_v3to4", scope: !2, file: !301, line: 137, type: !418, isLocal: true, isDefinition: true)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 5760, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 30)
!421 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!422 = !{i32 2, !"Dwarf Version", i32 4}
!423 = !{i32 2, !"Debug Info Version", i32 3}
!424 = !{i32 1, !"wchar_size", i32 4}
!425 = !{i32 7, !"PIC Level", i32 2}
!426 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!427 = distinct !DISubprogram(name: "apply_gain", scope: !369, file: !369, line: 518, type: !428, scopeLine: 519, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !430)
!428 = !DISubroutineType(types: !429)
!429 = !{!51, !63, !54, !189}
!430 = !{}
!431 = !DILocalVariable(name: "filename", arg: 1, scope: !427, file: !369, line: 518, type: !63)
!432 = !DILocation(line: 0, scope: !427)
!433 = !DILocalVariable(name: "gain", arg: 2, scope: !427, file: !369, line: 518, type: !54)
!434 = !DILocalVariable(name: "si", arg: 3, scope: !427, file: !369, line: 518, type: !189)
!435 = !DILocalVariable(name: "stbuf", scope: !427, file: !369, line: 525, type: !155)
!436 = !DILocation(line: 525, column: 15, scope: !427)
!437 = !DILocalVariable(name: "__cil_tmp32", scope: !427, file: !369, line: 548, type: !63)
!438 = !DILocation(line: 548, column: 9, scope: !427)
!439 = !DILocalVariable(name: "__cil_tmp33", scope: !427, file: !369, line: 549, type: !63)
!440 = !DILocation(line: 549, column: 9, scope: !427)
!441 = !DILocalVariable(name: "__cil_tmp34", scope: !427, file: !369, line: 550, type: !63)
!442 = !DILocation(line: 550, column: 9, scope: !427)
!443 = !DILocalVariable(name: "__cil_tmp35", scope: !427, file: !369, line: 551, type: !63)
!444 = !DILocation(line: 551, column: 9, scope: !427)
!445 = !DILocalVariable(name: "__cil_tmp36", scope: !427, file: !369, line: 552, type: !63)
!446 = !DILocation(line: 552, column: 9, scope: !427)
!447 = !DILocalVariable(name: "__cil_tmp37", scope: !427, file: !369, line: 553, type: !63)
!448 = !DILocation(line: 553, column: 9, scope: !427)
!449 = !DILocalVariable(name: "__cil_tmp38", scope: !427, file: !369, line: 554, type: !63)
!450 = !DILocation(line: 554, column: 9, scope: !427)
!451 = !DILocation(line: 531, column: 9, scope: !452)
!452 = distinct !DILexicalBlock(scope: !453, file: !369, line: 558, column: 3)
!453 = distinct !DILexicalBlock(scope: !454, file: !369, line: 557, column: 3)
!454 = distinct !DILexicalBlock(scope: !427, file: !369, line: 556, column: 3)
!455 = !DILocalVariable(name: "tmp", scope: !427, file: !369, line: 528, type: !52)
!456 = !DILocalVariable(name: "i", scope: !427, file: !369, line: 520, type: !51)
!457 = !DILocation(line: 532, column: 9, scope: !458)
!458 = distinct !DILexicalBlock(scope: !454, file: !369, line: 532, column: 7)
!459 = !DILocation(line: 532, column: 7, scope: !454)
!460 = !DILocation(line: 533, column: 24, scope: !461)
!461 = distinct !DILexicalBlock(scope: !462, file: !369, line: 533, column: 5)
!462 = distinct !DILexicalBlock(scope: !458, file: !369, line: 532, column: 15)
!463 = !DILocation(line: 533, column: 29, scope: !461)
!464 = !DILocalVariable(name: "suffix", scope: !427, file: !369, line: 523, type: !63)
!465 = !DILocation(line: 534, column: 15, scope: !466)
!466 = distinct !DILexicalBlock(scope: !461, file: !369, line: 534, column: 5)
!467 = !DILocalVariable(name: "tmp___1", scope: !427, file: !369, line: 530, type: !51)
!468 = !DILocation(line: 534, column: 9, scope: !469)
!469 = distinct !DILexicalBlock(scope: !462, file: !369, line: 534, column: 9)
!470 = !DILocation(line: 534, column: 9, scope: !462)
