; ModuleID = '/tmp/tmp.ll'
source_filename = "c/psutils-1.17.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct.papersize = type { i8*, i32, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.pagespec = type { i32, i32, i32, i32, double, double, double, %struct.pagespec* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@width = global double -1.000000e+00, align 8, !dbg !0
@height = global double -1.000000e+00, align 8, !dbg !101
@.str = private unnamed_addr constant [15 x i8] c"out of memory\0A\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"pt\00", align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"in\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"cm\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"mm\00", align 1
@.str.5 = private unnamed_addr constant [23 x i8] c"width not initialised\0A\00", align 1
@.str.6 = private unnamed_addr constant [24 x i8] c"height not initialised\0A\00", align 1
@pages = common global i32 0, align 4, !dbg !104
@.str.7 = private unnamed_addr constant [23 x i8] c"%%BeginProcSet: PStoPS\00", align 1
@.str.8 = private unnamed_addr constant [8 x i8] c"-nobind\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "width", scope: !2, file: !103, line: 15, type: !20, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !100, nameTableKind: GNU)
!3 = !DIFile(filename: "c/psutils-1.17.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !9, !25, !26, !27, !20, !24, !29, !15, !28, !31, !39, !71, !97, !99}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !7, line: 211, baseType: !8)
!7 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!8 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "PageSpec", file: !11, line: 15, baseType: !12)
!11 = !DIFile(filename: "/home/wslee/benchmarks/textformat/psutils-1.17/psspec.h", directory: "")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pagespec", file: !11, line: 15, size: 384, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !21, !22, !23}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "reversed", scope: !12, file: !11, line: 16, baseType: !15, size: 32)
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "pageno", scope: !12, file: !11, line: 17, baseType: !15, size: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !12, file: !11, line: 18, baseType: !15, size: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "rotate", scope: !12, file: !11, line: 19, baseType: !15, size: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !12, file: !11, line: 20, baseType: !20, size: 64, offset: 128)
!20 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "yoff", scope: !12, file: !11, line: 21, baseType: !20, size: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !12, file: !11, line: 22, baseType: !20, size: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !11, line: 23, baseType: !24, size: 64, offset: 320)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!25 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paper", file: !33, line: 19, baseType: !34)
!33 = !DIFile(filename: "/home/wslee/benchmarks/textformat/psutils-1.17/psutil.h", directory: "")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "papersize", file: !33, line: 19, size: 128, elements: !35)
!35 = !{!36, !37, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !34, file: !33, line: 20, baseType: !27, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !34, file: !33, line: 21, baseType: !15, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !34, file: !33, line: 22, baseType: !15, size: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !41, line: 49, baseType: !42)
!41 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !43, line: 271, size: 1728, elements: !44)
!43 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !65, !66, !67, !68, !72, !74, !76, !80, !83, !87, !88, !89, !90, !91, !92, !93}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !42, file: !43, line: 272, baseType: !15, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !42, file: !43, line: 273, baseType: !27, size: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !42, file: !43, line: 274, baseType: !27, size: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !42, file: !43, line: 275, baseType: !27, size: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !42, file: !43, line: 276, baseType: !27, size: 64, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !42, file: !43, line: 277, baseType: !27, size: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !42, file: !43, line: 278, baseType: !27, size: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !42, file: !43, line: 279, baseType: !27, size: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !42, file: !43, line: 280, baseType: !27, size: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !42, file: !43, line: 281, baseType: !27, size: 64, offset: 576)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !42, file: !43, line: 282, baseType: !27, size: 64, offset: 640)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !42, file: !43, line: 283, baseType: !27, size: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !42, file: !43, line: 284, baseType: !58, size: 64, offset: 768)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !43, line: 186, size: 192, elements: !60)
!60 = !{!61, !62, !64}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !59, file: !43, line: 187, baseType: !58, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !59, file: !43, line: 188, baseType: !63, size: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !59, file: !43, line: 189, baseType: !15, size: 32, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !42, file: !43, line: 285, baseType: !63, size: 64, offset: 832)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !42, file: !43, line: 286, baseType: !15, size: 32, offset: 896)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !42, file: !43, line: 287, baseType: !15, size: 32, offset: 928)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !42, file: !43, line: 288, baseType: !69, size: 64, offset: 960)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !70, line: 141, baseType: !71)
!70 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!71 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !42, file: !43, line: 289, baseType: !73, size: 16, offset: 1024)
!73 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !42, file: !43, line: 290, baseType: !75, size: 8, offset: 1040)
!75 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !42, file: !43, line: 291, baseType: !77, size: 8, offset: 1048)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 1)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !42, file: !43, line: 292, baseType: !81, size: 64, offset: 1088)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !43, line: 180, baseType: null)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !42, file: !43, line: 293, baseType: !84, size: 64, offset: 1152)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !70, line: 142, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !70, line: 56, baseType: !86)
!86 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !42, file: !43, line: 294, baseType: !26, size: 64, offset: 1216)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !42, file: !43, line: 295, baseType: !26, size: 64, offset: 1280)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !42, file: !43, line: 296, baseType: !26, size: 64, offset: 1344)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !42, file: !43, line: 297, baseType: !26, size: 64, offset: 1408)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !42, file: !43, line: 298, baseType: !6, size: 32, offset: 1472)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !42, file: !43, line: 299, baseType: !15, size: 32, offset: 1504)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !42, file: !43, line: 300, baseType: !94, size: 192, offset: 1536)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 192, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 24)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!100 = !{!0, !101, !104, !106, !111, !113, !115, !117, !119, !122, !124, !126, !131, !136, !138, !140, !142, !144, !146, !148, !150, !152}
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "height", scope: !2, file: !103, line: 16, type: !20, isLocal: false, isDefinition: true)
!103 = !DIFile(filename: "/home/wslee/benchmarks/textformat/psutils-1.17/psspec.c", directory: "")
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "pages", scope: !2, file: !33, line: 47, type: !15, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "pagelabel", scope: !2, file: !33, line: 51, type: !108, isLocal: false, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 65536, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 8192)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !33, line: 48, type: !15, isLocal: false, isDefinition: true)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "infile", scope: !2, file: !33, line: 49, type: !39, isLocal: false, isDefinition: true)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "outfile", scope: !2, file: !33, line: 50, type: !39, isLocal: false, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "pageno", scope: !2, file: !33, line: 52, type: !15, isLocal: false, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "buffer", scope: !2, file: !121, line: 34, type: !108, isLocal: true, isDefinition: true)
!121 = !DIFile(filename: "/home/wslee/benchmarks/textformat/psutils-1.17/psutil.c", directory: "")
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "pageptr", scope: !2, file: !121, line: 43, type: !99, isLocal: true, isDefinition: true)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "program", scope: !2, file: !33, line: 46, type: !27, isLocal: false, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "prologue", scope: !2, file: !103, line: 94, type: !128, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1984, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 31)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "papersizes", scope: !2, file: !121, line: 46, type: !133, isLocal: true, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2304, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 18)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "maxpages", scope: !2, file: !121, line: 42, type: !15, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "headerpos", scope: !2, file: !121, line: 37, type: !71, isLocal: true, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "pagescmt", scope: !2, file: !121, line: 36, type: !71, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "endsetup", scope: !2, file: !121, line: 38, type: !71, isLocal: true, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "beginprocset", scope: !2, file: !121, line: 39, type: !71, isLocal: true, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "endprocset", scope: !2, file: !121, line: 40, type: !71, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "bytes", scope: !2, file: !121, line: 35, type: !71, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "outputpage", scope: !2, file: !121, line: 41, type: !15, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "column", scope: !2, file: !154, line: 27, type: !15, isLocal: true, isDefinition: true)
!154 = !DIFile(filename: "/home/wslee/benchmarks/textformat/psutils-1.17/pserror.c", directory: "")
!155 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!156 = !{i32 2, !"Dwarf Version", i32 4}
!157 = !{i32 2, !"Debug Info Version", i32 3}
!158 = !{i32 1, !"wchar_size", i32 4}
!159 = !{i32 7, !"PIC Level", i32 2}
!160 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!161 = distinct !DISubprogram(name: "newspec", scope: !103, file: !103, line: 19, type: !162, scopeLine: 20, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!162 = !DISubroutineType(types: !163)
!163 = !{!9}
!164 = !DILocalVariable(name: "__cil_tmp7", scope: !161, file: !103, line: 27, type: !27)
!165 = !DILocation(line: 27, column: 9, scope: !161)
!166 = !DILocation(line: 21, column: 9, scope: !167)
!167 = distinct !DILexicalBlock(scope: !168, file: !103, line: 31, column: 3)
!168 = distinct !DILexicalBlock(scope: !169, file: !103, line: 30, column: 3)
!169 = distinct !DILexicalBlock(scope: !161, file: !103, line: 29, column: 3)
!170 = !DILocalVariable(name: "tmp", scope: !161, file: !103, line: 22, type: !26)
!171 = !DILocation(line: 0, scope: !161)
!172 = !DILocation(line: 21, column: 10, scope: !168)
!173 = !DILocalVariable(name: "temp", scope: !161, file: !103, line: 21, type: !9)
!174 = !DILocation(line: 22, column: 7, scope: !175)
!175 = distinct !DILexicalBlock(scope: !169, file: !103, line: 22, column: 7)
!176 = !DILocation(line: 22, column: 28, scope: !175)
!177 = !DILocation(line: 22, column: 7, scope: !169)
!178 = !DILocation(line: 23, column: 5, scope: !179)
!179 = distinct !DILexicalBlock(scope: !180, file: !103, line: 24, column: 5)
!180 = distinct !DILexicalBlock(scope: !181, file: !103, line: 23, column: 5)
!181 = distinct !DILexicalBlock(scope: !175, file: !103, line: 22, column: 60)
!182 = !DILocation(line: 26, column: 3, scope: !181)
!183 = !DILocalVariable(name: "tmp___2", scope: !161, file: !103, line: 25, type: !15)
!184 = !DILocation(line: 24, column: 9, scope: !169)
!185 = !DILocation(line: 24, column: 16, scope: !169)
!186 = !DILocalVariable(name: "tmp___1", scope: !161, file: !103, line: 24, type: !15)
!187 = !DILocation(line: 24, column: 15, scope: !169)
!188 = !DILocalVariable(name: "tmp___0", scope: !161, file: !103, line: 23, type: !15)
!189 = !DILocation(line: 24, column: 18, scope: !169)
!190 = !DILocation(line: 25, column: 9, scope: !169)
!191 = !DILocation(line: 25, column: 15, scope: !169)
!192 = !DILocalVariable(name: "tmp___3", scope: !161, file: !103, line: 26, type: !20)
!193 = !DILocation(line: 26, column: 9, scope: !169)
!194 = !DILocation(line: 26, column: 14, scope: !169)
!195 = !DILocation(line: 27, column: 9, scope: !169)
!196 = !DILocation(line: 27, column: 14, scope: !169)
!197 = !DILocation(line: 28, column: 3, scope: !169)
!198 = distinct !DISubprogram(name: "message", scope: !154, file: !154, line: 24, type: !199, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !15, !27, null}
!201 = !DILocalVariable(name: "flags", arg: 1, scope: !198, file: !154, line: 24, type: !15)
!202 = !DILocation(line: 0, scope: !198)
!203 = !DILocalVariable(name: "format", arg: 2, scope: !198, file: !154, line: 24, type: !27)
!204 = !DILocalVariable(name: "args", scope: !198, file: !154, line: 26, type: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !206, line: 102, baseType: !207)
!206 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stdarg.h", directory: "")
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !206, line: 40, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 26, baseType: !209)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 192, elements: !78)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 26, size: 192, elements: !211)
!211 = !{!212, !213, !214, !215}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !210, file: !3, line: 26, baseType: !8, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !210, file: !3, line: 26, baseType: !8, size: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !210, file: !3, line: 26, baseType: !26, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !210, file: !3, line: 26, baseType: !26, size: 64, offset: 128)
!216 = !DILocation(line: 26, column: 11, scope: !198)
!217 = !DILocalVariable(name: "msgbuf", scope: !198, file: !154, line: 27, type: !218)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 2048, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 256)
!221 = !DILocation(line: 27, column: 8, scope: !198)
!222 = !DILocalVariable(name: "fmtbuf", scope: !198, file: !154, line: 36, type: !223)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 128, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 16)
!226 = !DILocation(line: 36, column: 8, scope: !198)
!227 = !DILocalVariable(name: "__cil_tmp38", scope: !198, file: !154, line: 57, type: !26)
!228 = !DILocation(line: 57, column: 9, scope: !198)
!229 = !DILocalVariable(name: "__cil_tmp39", scope: !198, file: !154, line: 58, type: !26)
!230 = !DILocation(line: 58, column: 9, scope: !198)
!231 = !DILocation(line: 29, column: 12, scope: !232)
!232 = distinct !DILexicalBlock(scope: !198, file: !154, line: 60, column: 3)
!233 = !DILocalVariable(name: "bufptr", scope: !198, file: !154, line: 28, type: !27)
!234 = !DILocation(line: 31, column: 13, scope: !235)
!235 = distinct !DILexicalBlock(scope: !232, file: !154, line: 31, column: 7)
!236 = !DILocation(line: 31, column: 7, scope: !232)
!237 = !DILocation(line: 31, column: 9, scope: !238)
!238 = distinct !DILexicalBlock(scope: !239, file: !154, line: 31, column: 9)
!239 = distinct !DILexicalBlock(scope: !235, file: !154, line: 31, column: 18)
!240 = !DILocation(line: 31, column: 16, scope: !238)
!241 = !DILocation(line: 31, column: 9, scope: !239)
!242 = !DILocation(line: 32, column: 22, scope: !243)
!243 = distinct !DILexicalBlock(scope: !244, file: !154, line: 33, column: 7)
!244 = distinct !DILexicalBlock(scope: !245, file: !154, line: 32, column: 7)
!245 = distinct !DILexicalBlock(scope: !238, file: !154, line: 31, column: 22)
!246 = !DILocation(line: 32, column: 7, scope: !243)
!247 = !DILocation(line: 33, column: 14, scope: !244)
!248 = !DILocation(line: 35, column: 5, scope: !245)
!249 = !DILocation(line: 36, column: 3, scope: !239)
!250 = !DILocation(line: 36, column: 13, scope: !251)
!251 = distinct !DILexicalBlock(scope: !232, file: !154, line: 36, column: 7)
!252 = !DILocation(line: 36, column: 7, scope: !232)
!253 = !DILocation(line: 37, column: 78, scope: !254)
!254 = distinct !DILexicalBlock(scope: !255, file: !154, line: 38, column: 5)
!255 = distinct !DILexicalBlock(scope: !256, file: !154, line: 37, column: 5)
!256 = distinct !DILexicalBlock(scope: !251, file: !154, line: 36, column: 18)
!257 = !DILocation(line: 37, column: 5, scope: !254)
!258 = !DILocation(line: 38, column: 34, scope: !259)
!259 = distinct !DILexicalBlock(scope: !255, file: !154, line: 39, column: 5)
!260 = !DILocation(line: 38, column: 11, scope: !259)
!261 = !DILocalVariable(name: "tmp", scope: !198, file: !154, line: 29, type: !6)
!262 = !DILocation(line: 38, column: 12, scope: !255)
!263 = !DILocalVariable(name: "tmp___0", scope: !198, file: !154, line: 30, type: !27)
!264 = !DILocation(line: 39, column: 12, scope: !255)
!265 = !DILocation(line: 39, column: 14, scope: !255)
!266 = !DILocalVariable(name: "tmp___1", scope: !198, file: !154, line: 31, type: !27)
!267 = !DILocation(line: 40, column: 12, scope: !255)
!268 = !DILocation(line: 40, column: 14, scope: !255)
!269 = !DILocation(line: 42, column: 3, scope: !256)
!270 = !DILocation(line: 0, scope: !232)
!271 = !DILocation(line: 43, column: 3, scope: !272)
!272 = distinct !DILexicalBlock(scope: !273, file: !154, line: 44, column: 3)
!273 = distinct !DILexicalBlock(scope: !232, file: !154, line: 43, column: 3)
!274 = !DILocation(line: 44, column: 7, scope: !275)
!275 = distinct !DILexicalBlock(scope: !232, file: !154, line: 44, column: 7)
!276 = !DILocation(line: 44, column: 30, scope: !275)
