; ModuleID = '/tmp/tmp.ll'
source_filename = "c/rotix-0.83.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [8 x i8] c"Usage:\0A\00", align 1
@.str.1 = private unnamed_addr constant [57 x i8] c"       rotix [ -f <file> ] [ -o <file> ] [ -r <value> ]\0A\00", align 1
@.str.2 = private unnamed_addr constant [54 x i8] c"       rotix -t <text> [ -o <file> ] [ -r <value> ]\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [31 x i8] c"-f <file>  specify input-file\0A\00", align 1
@.str.4 = private unnamed_addr constant [32 x i8] c"-o <file>  specify output-file\0A\00", align 1
@.str.5 = private unnamed_addr constant [45 x i8] c"-r <value> specify the value to rotate with\0A\00", align 1
@.str.6 = private unnamed_addr constant [47 x i8] c"-a         use all sane values to rotate with\0A\00", align 1
@.str.7 = private unnamed_addr constant [25 x i8] c"-R         rotate right\0A\00", align 1
@.str.8 = private unnamed_addr constant [24 x i8] c"-L         rotate left\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "rotix_options", scope: !2, file: !87, line: 60, type: !88, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !86, nameTableKind: GNU)
!3 = !DIFile(filename: "c/rotix-0.83.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !9, !8, !10, !11, !12, !73, !75, !83, !85, !65}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 49, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !16, line: 271, size: 1728, elements: !17)
!16 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !38, !39, !40, !41, !45, !47, !49, !53, !56, !60, !61, !62, !63, !64, !68, !69}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !15, file: !16, line: 272, baseType: !9, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !15, file: !16, line: 273, baseType: !10, size: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !15, file: !16, line: 274, baseType: !10, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !15, file: !16, line: 275, baseType: !10, size: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !15, file: !16, line: 276, baseType: !10, size: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !15, file: !16, line: 277, baseType: !10, size: 64, offset: 320)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !15, file: !16, line: 278, baseType: !10, size: 64, offset: 384)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !15, file: !16, line: 279, baseType: !10, size: 64, offset: 448)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !15, file: !16, line: 280, baseType: !10, size: 64, offset: 512)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !15, file: !16, line: 281, baseType: !10, size: 64, offset: 576)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !15, file: !16, line: 282, baseType: !10, size: 64, offset: 640)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !15, file: !16, line: 283, baseType: !10, size: 64, offset: 704)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !15, file: !16, line: 284, baseType: !31, size: 64, offset: 768)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !16, line: 186, size: 192, elements: !33)
!33 = !{!34, !35, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !32, file: !16, line: 187, baseType: !31, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !32, file: !16, line: 188, baseType: !36, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !32, file: !16, line: 189, baseType: !9, size: 32, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !15, file: !16, line: 285, baseType: !36, size: 64, offset: 832)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !15, file: !16, line: 286, baseType: !9, size: 32, offset: 896)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !15, file: !16, line: 287, baseType: !9, size: 32, offset: 928)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !15, file: !16, line: 288, baseType: !42, size: 64, offset: 960)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !43, line: 141, baseType: !44)
!43 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!44 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !15, file: !16, line: 289, baseType: !46, size: 16, offset: 1024)
!46 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !15, file: !16, line: 290, baseType: !48, size: 8, offset: 1040)
!48 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !15, file: !16, line: 291, baseType: !50, size: 8, offset: 1048)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 1)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !15, file: !16, line: 292, baseType: !54, size: 64, offset: 1088)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !16, line: 180, baseType: null)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !15, file: !16, line: 293, baseType: !57, size: 64, offset: 1152)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !43, line: 142, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !43, line: 56, baseType: !59)
!59 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !15, file: !16, line: 294, baseType: !11, size: 64, offset: 1216)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !15, file: !16, line: 295, baseType: !11, size: 64, offset: 1280)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !15, file: !16, line: 296, baseType: !11, size: 64, offset: 1344)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !15, file: !16, line: 297, baseType: !11, size: 64, offset: 1408)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !15, file: !16, line: 298, baseType: !65, size: 32, offset: 1472)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !66, line: 211, baseType: !67)
!66 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!67 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !15, file: !16, line: 299, baseType: !9, size: 32, offset: 1504)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !15, file: !16, line: 300, baseType: !70, size: 192, offset: 1536)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 192, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 24)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !78, line: 106, size: 256, elements: !79)
!78 = !DIFile(filename: "/usr/include/getopt.h", directory: "")
!79 = !{!80, !81, !82, !84}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !77, file: !78, line: 107, baseType: !6, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !77, file: !78, line: 108, baseType: !9, size: 32, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !77, file: !78, line: 109, baseType: !83, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !77, file: !78, line: 110, baseType: !9, size: 32, offset: 192)
!85 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!86 = !{!0}
!87 = !DIFile(filename: "/home/wslee/benchmarks/textformat/rotix-0.83/rotix.c", directory: "")
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 2560, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 10)
!91 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!92 = !{i32 2, !"Dwarf Version", i32 4}
!93 = !{i32 2, !"Debug Info Version", i32 3}
!94 = !{i32 1, !"wchar_size", i32 4}
!95 = !{i32 7, !"PIC Level", i32 2}
!96 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!97 = distinct !DISubprogram(name: "display_help", scope: !98, file: !98, line: 34, type: !99, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!98 = !DIFile(filename: "/home/wslee/benchmarks/textformat/rotix-0.83/help.c", directory: "")
!99 = !DISubroutineType(types: !100)
!100 = !{null}
!101 = !DILocalVariable(name: "__cil_tmp13", scope: !97, file: !98, line: 48, type: !10)
!102 = !DILocation(line: 48, column: 9, scope: !97)
!103 = !DILocalVariable(name: "__cil_tmp14", scope: !97, file: !98, line: 49, type: !10)
!104 = !DILocation(line: 49, column: 9, scope: !97)
!105 = !DILocalVariable(name: "__cil_tmp15", scope: !97, file: !98, line: 50, type: !10)
!106 = !DILocation(line: 50, column: 9, scope: !97)
!107 = !DILocalVariable(name: "__cil_tmp16", scope: !97, file: !98, line: 51, type: !10)
!108 = !DILocation(line: 51, column: 9, scope: !97)
!109 = !DILocalVariable(name: "__cil_tmp17", scope: !97, file: !98, line: 52, type: !10)
!110 = !DILocation(line: 52, column: 9, scope: !97)
!111 = !DILocalVariable(name: "__cil_tmp18", scope: !97, file: !98, line: 53, type: !10)
!112 = !DILocation(line: 53, column: 9, scope: !97)
!113 = !DILocalVariable(name: "__cil_tmp19", scope: !97, file: !98, line: 54, type: !10)
!114 = !DILocation(line: 54, column: 9, scope: !97)
!115 = !DILocalVariable(name: "__cil_tmp20", scope: !97, file: !98, line: 55, type: !10)
!116 = !DILocation(line: 55, column: 9, scope: !97)
!117 = !DILocalVariable(name: "__cil_tmp21", scope: !97, file: !98, line: 56, type: !10)
!118 = !DILocation(line: 56, column: 9, scope: !97)
!119 = !DILocalVariable(name: "__cil_tmp22", scope: !97, file: !98, line: 57, type: !10)
!120 = !DILocation(line: 57, column: 9, scope: !97)
!121 = !DILocalVariable(name: "__cil_tmp23", scope: !97, file: !98, line: 58, type: !10)
!122 = !DILocation(line: 58, column: 9, scope: !97)
!123 = !DILocalVariable(name: "__cil_tmp24", scope: !97, file: !98, line: 59, type: !10)
!124 = !DILocation(line: 59, column: 9, scope: !97)
!125 = !DILocalVariable(name: "__cil_tmp25", scope: !97, file: !98, line: 60, type: !10)
!126 = !DILocation(line: 60, column: 9, scope: !97)
!127 = !DILocation(line: 36, column: 9, scope: !128)
!128 = distinct !DILexicalBlock(scope: !129, file: !98, line: 64, column: 3)
!129 = distinct !DILexicalBlock(scope: !130, file: !98, line: 63, column: 3)
!130 = distinct !DILexicalBlock(scope: !97, file: !98, line: 62, column: 3)
!131 = !DILocalVariable(name: "tmp", scope: !97, file: !98, line: 36, type: !10)
!132 = !DILocation(line: 0, scope: !97)
!133 = !DILocation(line: 36, column: 3, scope: !134)
!134 = distinct !DILexicalBlock(scope: !129, file: !98, line: 38, column: 3)
!135 = !DILocation(line: 37, column: 13, scope: !136)
!136 = distinct !DILexicalBlock(scope: !129, file: !98, line: 38, column: 3)
!137 = !DILocalVariable(name: "tmp___0", scope: !97, file: !98, line: 37, type: !10)
!138 = !DILocation(line: 37, column: 3, scope: !139)
!139 = distinct !DILexicalBlock(scope: !129, file: !98, line: 39, column: 3)
!140 = !DILocation(line: 38, column: 13, scope: !141)
!141 = distinct !DILexicalBlock(scope: !129, file: !98, line: 39, column: 3)
!142 = !DILocalVariable(name: "tmp___1", scope: !97, file: !98, line: 38, type: !10)
