; ModuleID = '/tmp/tmp.ll'
source_filename = "c/since-0.5.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.stat = type { i64, i16, i64, i32, i32, i32, i32, i64, i16, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, i64, i64 }
%struct.timespec = type { i64, i64 }

@line_offset = global i32 0, align 4, !dbg !0
@line_length = global i32 0, align 4, !dbg !83
@.str = private unnamed_addr constant [4 x i8] c".gz\00", align 1
@.str.1 = private unnamed_addr constant [5 x i8] c".bz2\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c".bz\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c".zip\00", align 1
@compressed_extensions = global [5 x i8*] [i8* getelementptr inbounds ([4 x i8], [4 x i8]* @.str, i32 0, i32 0), i8* getelementptr inbounds ([5 x i8], [5 x i8]* @.str.1, i32 0, i32 0), i8* getelementptr inbounds ([4 x i8], [4 x i8]* @.str.2, i32 0, i32 0), i8* getelementptr inbounds ([5 x i8], [5 x i8]* @.str.3, i32 0, i32 0), i8* null], align 16, !dbg !86
@stderr = external global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "line_offset", scope: !2, file: !85, line: 39, type: !9, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !82, nameTableKind: GNU)
!3 = !DIFile(filename: "c/since-0.5.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !9, !10, !18, !65, !73, !8, !74, !60, !76, !43, !77, !79}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !12, line: 49, baseType: !13)
!12 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !14, line: 271, size: 1728, elements: !15)
!14 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!15 = !{!16, !17, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !37, !38, !39, !40, !44, !46, !48, !52, !55, !59, !61, !62, !63, !64, !68, !69}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !13, file: !14, line: 272, baseType: !9, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !13, file: !14, line: 273, baseType: !18, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !13, file: !14, line: 274, baseType: !18, size: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !13, file: !14, line: 275, baseType: !18, size: 64, offset: 192)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !13, file: !14, line: 276, baseType: !18, size: 64, offset: 256)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !13, file: !14, line: 277, baseType: !18, size: 64, offset: 320)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !13, file: !14, line: 278, baseType: !18, size: 64, offset: 384)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !13, file: !14, line: 279, baseType: !18, size: 64, offset: 448)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !13, file: !14, line: 280, baseType: !18, size: 64, offset: 512)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !13, file: !14, line: 281, baseType: !18, size: 64, offset: 576)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !13, file: !14, line: 282, baseType: !18, size: 64, offset: 640)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !13, file: !14, line: 283, baseType: !18, size: 64, offset: 704)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !13, file: !14, line: 284, baseType: !30, size: 64, offset: 768)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !14, line: 186, size: 192, elements: !32)
!32 = !{!33, !34, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !31, file: !14, line: 187, baseType: !30, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !31, file: !14, line: 188, baseType: !35, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !31, file: !14, line: 189, baseType: !9, size: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !13, file: !14, line: 285, baseType: !35, size: 64, offset: 832)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !13, file: !14, line: 286, baseType: !9, size: 32, offset: 896)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !13, file: !14, line: 287, baseType: !9, size: 32, offset: 928)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !13, file: !14, line: 288, baseType: !41, size: 64, offset: 960)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !42, line: 141, baseType: !43)
!42 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!43 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !13, file: !14, line: 289, baseType: !45, size: 16, offset: 1024)
!45 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !13, file: !14, line: 290, baseType: !47, size: 8, offset: 1040)
!47 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !13, file: !14, line: 291, baseType: !49, size: 8, offset: 1048)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 1)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !13, file: !14, line: 292, baseType: !53, size: 64, offset: 1088)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !14, line: 180, baseType: null)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !13, file: !14, line: 293, baseType: !56, size: 64, offset: 1152)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !42, line: 142, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !42, line: 56, baseType: !58)
!58 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !13, file: !14, line: 294, baseType: !60, size: 64, offset: 1216)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !13, file: !14, line: 295, baseType: !60, size: 64, offset: 1280)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !13, file: !14, line: 296, baseType: !60, size: 64, offset: 1344)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !13, file: !14, line: 297, baseType: !60, size: 64, offset: 1408)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !13, file: !14, line: 298, baseType: !65, size: 32, offset: 1472)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !66, line: 211, baseType: !67)
!66 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!67 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !13, file: !14, line: 299, baseType: !9, size: 32, offset: 1504)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !13, file: !14, line: 300, baseType: !70, size: 192, offset: 1536)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 192, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 24)
!73 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !75, line: 88, baseType: !41)
!75 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !9}
!82 = !{!0, !83, !86, !91}
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "line_length", scope: !2, file: !85, line: 40, type: !9, isLocal: false, isDefinition: true)
!85 = !DIFile(filename: "/home/wslee/benchmarks/textformat/since-0.5/since.c", directory: "")
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "compressed_extensions", scope: !2, file: !85, line: 41, type: !88, isLocal: false, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 320, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 5)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "since_format", scope: !2, file: !85, line: 38, type: !93, isLocal: false, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 256)
!96 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!97 = !{i32 2, !"Dwarf Version", i32 4}
!98 = !{i32 2, !"Debug Info Version", i32 3}
!99 = !{i32 1, !"wchar_size", i32 4}
!100 = !{i32 7, !"PIC Level", i32 2}
!101 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!102 = distinct !DISubprogram(name: "test_exclusion", scope: !85, file: !85, line: 46, type: !103, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!103 = !DISubroutineType(types: !104)
!104 = !{!9, !18}
!105 = !DILocalVariable(name: "s", arg: 1, scope: !102, file: !85, line: 46, type: !18)
!106 = !DILocation(line: 0, scope: !102)
!107 = !DILocation(line: 51, column: 9, scope: !108)
!108 = distinct !DILexicalBlock(scope: !109, file: !85, line: 57, column: 3)
!109 = distinct !DILexicalBlock(scope: !110, file: !85, line: 56, column: 3)
!110 = distinct !DILexicalBlock(scope: !102, file: !85, line: 55, column: 3)
!111 = !DILocalVariable(name: "tmp", scope: !102, file: !85, line: 52, type: !65)
!112 = !DILocalVariable(name: "m", scope: !102, file: !85, line: 51, type: !9)
!113 = !DILocalVariable(name: "k", scope: !102, file: !85, line: 50, type: !9)
!114 = !DILocation(line: 53, column: 3, scope: !115)
!115 = distinct !DILexicalBlock(scope: !116, file: !85, line: 56, column: 3)
!116 = distinct !DILexicalBlock(scope: !110, file: !85, line: 55, column: 3)
!117 = !DILocation(line: 0, scope: !110)
!118 = !DILocation(line: 53, column: 13, scope: !115)
!119 = !DILocation(line: 53, column: 11, scope: !120)
!120 = distinct !DILexicalBlock(scope: !121, file: !85, line: 53, column: 9)
!121 = distinct !DILexicalBlock(scope: !115, file: !85, line: 53, column: 13)
!122 = !DILocation(line: 53, column: 9, scope: !121)
!123 = !DILocation(line: 53, column: 7, scope: !124)
!124 = distinct !DILexicalBlock(scope: !120, file: !85, line: 53, column: 37)
!125 = !DILocation(line: 55, column: 22, scope: !126)
!126 = distinct !DILexicalBlock(scope: !127, file: !85, line: 56, column: 5)
!127 = distinct !DILexicalBlock(scope: !121, file: !85, line: 55, column: 5)
!128 = !DILocation(line: 55, column: 15, scope: !126)
!129 = !DILocalVariable(name: "tmp___0", scope: !102, file: !85, line: 53, type: !65)
!130 = !DILocalVariable(name: "j", scope: !102, file: !85, line: 49, type: !9)
!131 = !DILocation(line: 56, column: 11, scope: !132)
!132 = distinct !DILexicalBlock(scope: !121, file: !85, line: 56, column: 9)
!133 = !DILocation(line: 56, column: 9, scope: !121)
!134 = !DILocalVariable(name: "i", scope: !102, file: !85, line: 48, type: !9)
!135 = !DILocation(line: 62, column: 7, scope: !136)
!136 = distinct !DILexicalBlock(scope: !137, file: !85, line: 64, column: 7)
!137 = distinct !DILexicalBlock(scope: !138, file: !85, line: 63, column: 7)
!138 = distinct !DILexicalBlock(scope: !132, file: !85, line: 56, column: 17)
!139 = !DILocation(line: 0, scope: !121)
!140 = !DILocation(line: 0, scope: !138)
!141 = !DILocation(line: 62, column: 17, scope: !136)
!142 = !DILocation(line: 62, column: 15, scope: !143)
!143 = distinct !DILexicalBlock(scope: !144, file: !85, line: 62, column: 13)
!144 = distinct !DILexicalBlock(scope: !136, file: !85, line: 62, column: 17)
!145 = !DILocation(line: 62, column: 13, scope: !144)
!146 = !DILocation(line: 62, column: 28, scope: !147)
!147 = distinct !DILexicalBlock(scope: !148, file: !85, line: 62, column: 15)
!148 = distinct !DILexicalBlock(scope: !143, file: !85, line: 62, column: 21)
!149 = !DILocation(line: 62, column: 24, scope: !147)
!150 = !DILocation(line: 62, column: 18, scope: !147)
!151 = !DILocation(line: 62, column: 44, scope: !147)
!152 = !DILocation(line: 62, column: 69, scope: !147)
!153 = !DILocation(line: 62, column: 42, scope: !147)
!154 = !DILocation(line: 62, column: 36, scope: !147)
!155 = !DILocation(line: 62, column: 33, scope: !147)
!156 = !DILocation(line: 62, column: 15, scope: !148)
!157 = !DILocation(line: 62, column: 13, scope: !158)
!158 = distinct !DILexicalBlock(scope: !147, file: !85, line: 62, column: 76)
!159 = !DILocation(line: 64, column: 9, scope: !148)
!160 = !DILocation(line: 62, column: 11, scope: !161)
!161 = distinct !DILexicalBlock(scope: !143, file: !85, line: 64, column: 16)
!162 = !DILocation(line: 62, column: 11, scope: !144)
!163 = distinct !{!163, !135, !164}
!164 = !DILocation(line: 63, column: 7, scope: !136)
!165 = !DILocation(line: 65, column: 7, scope: !136)
!166 = !DILocation(line: 64, column: 13, scope: !167)
!167 = distinct !DILexicalBlock(scope: !138, file: !85, line: 64, column: 11)
!168 = !DILocation(line: 64, column: 11, scope: !138)
!169 = !DILocation(line: 66, column: 9, scope: !170)
!170 = distinct !DILexicalBlock(scope: !167, file: !85, line: 64, column: 18)
!171 = !DILocation(line: 68, column: 5, scope: !138)
!172 = !DILocation(line: 53, column: 7, scope: !121)
!173 = distinct !{!173, !114, !174}
!174 = !DILocation(line: 54, column: 3, scope: !115)
!175 = !DILocation(line: 56, column: 3, scope: !115)
!176 = !DILocation(line: 71, column: 3, scope: !110)
!177 = !DILocation(line: 73, column: 1, scope: !102)
!178 = distinct !DISubprogram(name: "guess_size", scope: !85, file: !85, line: 78, type: !179, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!179 = !DISubroutineType(types: !180)
!180 = !{!9, !9, !18, !9}
!181 = !DILocalVariable(name: "type", arg: 1, scope: !178, file: !85, line: 78, type: !9)
!182 = !DILocation(line: 0, scope: !178)
!183 = !DILocalVariable(name: "s", arg: 2, scope: !178, file: !85, line: 78, type: !18)
!184 = !DILocalVariable(name: "len", arg: 3, scope: !178, file: !85, line: 78, type: !9)
!185 = !DILocalVariable(name: "__cil_tmp12", scope: !178, file: !85, line: 88, type: !18)
!186 = !DILocation(line: 88, column: 9, scope: !178)
!187 = !DILocalVariable(name: "__cil_tmp13", scope: !178, file: !85, line: 89, type: !18)
!188 = !DILocation(line: 89, column: 9, scope: !178)
!189 = !DILocalVariable(name: "__cil_tmp14", scope: !178, file: !85, line: 90, type: !18)
!190 = !DILocation(line: 90, column: 9, scope: !178)
!191 = !DILocation(line: 83, column: 11, scope: !192)
!192 = distinct !DILexicalBlock(scope: !193, file: !85, line: 83, column: 7)
!193 = distinct !DILexicalBlock(scope: !178, file: !85, line: 92, column: 3)
!194 = !DILocation(line: 83, column: 7, scope: !193)
!195 = !DILocation(line: 85, column: 38, scope: !196)
!196 = distinct !DILexicalBlock(scope: !197, file: !85, line: 85, column: 5)
!197 = distinct !DILexicalBlock(scope: !198, file: !85, line: 84, column: 5)
!198 = distinct !DILexicalBlock(scope: !192, file: !85, line: 83, column: 16)
!199 = !DILocation(line: 85, column: 5, scope: !196)
!200 = !DILocation(line: 87, column: 5, scope: !201)
!201 = distinct !DILexicalBlock(scope: !197, file: !85, line: 87, column: 5)
!202 = !DILocation(line: 91, column: 18, scope: !203)
!203 = distinct !DILexicalBlock(scope: !204, file: !85, line: 92, column: 3)
!204 = distinct !DILexicalBlock(scope: !193, file: !85, line: 91, column: 3)
!205 = !DILocation(line: 90, column: 7, scope: !203)
!206 = !DILocalVariable(name: "i", scope: !178, file: !85, line: 80, type: !9)
!207 = !DILocation(line: 92, column: 26, scope: !208)
!208 = distinct !DILexicalBlock(scope: !193, file: !85, line: 92, column: 7)
!209 = !DILocation(line: 92, column: 23, scope: !208)
!210 = !DILocation(line: 92, column: 7, scope: !193)
!211 = !DILocation(line: 96, column: 26, scope: !212)
!212 = distinct !DILexicalBlock(scope: !213, file: !85, line: 96, column: 9)
!213 = distinct !DILexicalBlock(scope: !208, file: !85, line: 92, column: 49)
!214 = !DILocation(line: 96, column: 23, scope: !212)
!215 = !DILocation(line: 96, column: 9, scope: !213)
!216 = !DILocalVariable(name: "tmp", scope: !178, file: !85, line: 81, type: !9)
!217 = !DILocation(line: 98, column: 9, scope: !218)
!218 = distinct !DILexicalBlock(scope: !212, file: !85, line: 96, column: 48)
!219 = !DILocation(line: 98, column: 11, scope: !218)
!220 = !DILocation(line: 98, column: 18, scope: !218)
!221 = !DILocation(line: 99, column: 5, scope: !218)
!222 = !DILocation(line: 100, column: 31, scope: !223)
!223 = distinct !DILexicalBlock(scope: !212, file: !85, line: 100, column: 9)
!224 = !DILocation(line: 100, column: 28, scope: !223)
!225 = !DILocation(line: 100, column: 9, scope: !212)
!226 = !DILocalVariable(name: "tmp___0", scope: !178, file: !85, line: 82, type: !9)
!227 = !DILocation(line: 102, column: 9, scope: !228)
!228 = distinct !DILexicalBlock(scope: !223, file: !85, line: 100, column: 53)
!229 = !DILocation(line: 102, column: 11, scope: !228)
!230 = !DILocation(line: 102, column: 22, scope: !228)
!231 = !DILocalVariable(name: "tmp___1", scope: !178, file: !85, line: 83, type: !9)
!232 = !DILocation(line: 103, column: 9, scope: !228)
!233 = !DILocation(line: 103, column: 11, scope: !228)
!234 = !DILocation(line: 103, column: 22, scope: !228)
!235 = !DILocation(line: 104, column: 5, scope: !228)
!236 = !DILocation(line: 105, column: 27, scope: !237)
!237 = distinct !DILexicalBlock(scope: !223, file: !85, line: 105, column: 9)
!238 = !DILocation(line: 105, column: 24, scope: !237)
!239 = !DILocation(line: 105, column: 9, scope: !223)
!240 = !DILocalVariable(name: "tmp___2", scope: !178, file: !85, line: 84, type: !9)
!241 = !DILocation(line: 107, column: 9, scope: !242)
!242 = distinct !DILexicalBlock(scope: !237, file: !85, line: 105, column: 49)
!243 = !DILocation(line: 107, column: 11, scope: !242)
!244 = !DILocation(line: 107, column: 22, scope: !242)
!245 = !DILocation(line: 108, column: 5, scope: !242)
!246 = !DILocation(line: 109, column: 26, scope: !247)
!247 = distinct !DILexicalBlock(scope: !237, file: !85, line: 109, column: 9)
!248 = !DILocation(line: 109, column: 23, scope: !247)
!249 = !DILocation(line: 109, column: 9, scope: !237)
!250 = !DILocalVariable(name: "tmp___3", scope: !178, file: !85, line: 85, type: !9)
!251 = !DILocation(line: 111, column: 9, scope: !252)
!252 = distinct !DILexicalBlock(scope: !247, file: !85, line: 109, column: 48)
!253 = !DILocation(line: 111, column: 11, scope: !252)
!254 = !DILocation(line: 111, column: 22, scope: !252)
!255 = !DILocalVariable(name: "tmp___4", scope: !178, file: !85, line: 86, type: !9)
!256 = !DILocation(line: 112, column: 9, scope: !252)
!257 = !DILocation(line: 112, column: 11, scope: !252)
!258 = !DILocation(line: 112, column: 22, scope: !252)
!259 = !DILocation(line: 113, column: 5, scope: !252)
!260 = !DILocation(line: 116, column: 40, scope: !261)
!261 = distinct !DILexicalBlock(scope: !262, file: !85, line: 115, column: 7)
!262 = distinct !DILexicalBlock(scope: !263, file: !85, line: 114, column: 7)
!263 = distinct !DILexicalBlock(scope: !247, file: !85, line: 113, column: 12)
!264 = !DILocation(line: 116, column: 7, scope: !261)
!265 = !DILocation(line: 118, column: 7, scope: !266)
!266 = distinct !DILexicalBlock(scope: !262, file: !85, line: 119, column: 7)
!267 = !DILocation(line: 0, scope: !237)
!268 = !DILocation(line: 0, scope: !223)
!269 = !DILocation(line: 0, scope: !212)
!270 = !DILocation(line: 122, column: 3, scope: !213)
!271 = !DILocation(line: 0, scope: !193)
!272 = !DILocalVariable(name: "tmp___5", scope: !178, file: !85, line: 87, type: !9)
!273 = !DILocation(line: 121, column: 5, scope: !193)
!274 = !DILocation(line: 121, column: 7, scope: !193)
!275 = !DILocation(line: 121, column: 18, scope: !193)
!276 = !DILocation(line: 122, column: 7, scope: !193)
!277 = !DILocation(line: 122, column: 12, scope: !193)
!278 = !DILocation(line: 124, column: 3, scope: !193)
!279 = distinct !DISubprogram(name: "prepare_format", scope: !85, file: !85, line: 133, type: !280, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!280 = !DISubroutineType(types: !281)
!281 = !{null}
!282 = !DILocalVariable(name: "st", scope: !279, file: !85, line: 135, type: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !284, line: 43, size: 1152, elements: !285)
!284 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!285 = !{!286, !290, !291, !293, !295, !297, !299, !301, !302, !303, !304, !306, !308, !315, !316, !317, !318}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !283, file: !284, line: 44, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !42, line: 134, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_quad_t", file: !42, line: 57, baseType: !289)
!289 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !283, file: !284, line: 45, baseType: !45, size: 16, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !283, file: !284, line: 46, baseType: !292, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !42, line: 137, baseType: !73)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !283, file: !284, line: 47, baseType: !294, size: 32, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !42, line: 139, baseType: !67)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !283, file: !284, line: 48, baseType: !296, size: 32, offset: 224)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !42, line: 140, baseType: !67)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !283, file: !284, line: 49, baseType: !298, size: 32, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !42, line: 135, baseType: !67)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !283, file: !284, line: 50, baseType: !300, size: 32, offset: 288)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !42, line: 136, baseType: !67)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !283, file: !284, line: 51, baseType: !287, size: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !283, file: !284, line: 52, baseType: !45, size: 16, offset: 384)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !283, file: !284, line: 53, baseType: !41, size: 64, offset: 448)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !283, file: !284, line: 54, baseType: !305, size: 64, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !42, line: 164, baseType: !43)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !283, file: !284, line: 55, baseType: !307, size: 64, offset: 576)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !42, line: 169, baseType: !43)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !283, file: !284, line: 56, baseType: !309, size: 128, offset: 640)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !310, line: 120, size: 128, elements: !311)
!310 = !DIFile(filename: "/usr/include/time.h", directory: "")
!311 = !{!312, !314}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !309, file: !310, line: 121, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !42, line: 149, baseType: !43)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !309, file: !310, line: 122, baseType: !43, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !283, file: !284, line: 57, baseType: !309, size: 128, offset: 768)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !283, file: !284, line: 58, baseType: !309, size: 128, offset: 896)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__unused4", scope: !283, file: !284, line: 59, baseType: !73, size: 64, offset: 1024)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__unused5", scope: !283, file: !284, line: 60, baseType: !73, size: 64, offset: 1088)
!319 = !DILocation(line: 135, column: 15, scope: !279)
!320 = !DILocalVariable(name: "buffer", scope: !279, file: !85, line: 136, type: !93)
!321 = !DILocation(line: 136, column: 8, scope: !279)
!322 = !DILocalVariable(name: "__cil_tmp13", scope: !279, file: !85, line: 147, type: !60)
!323 = !DILocation(line: 147, column: 9, scope: !279)
!324 = !DILocalVariable(name: "__cil_tmp14", scope: !279, file: !85, line: 148, type: !18)
!325 = !DILocation(line: 148, column: 9, scope: !279)
!326 = !DILocalVariable(name: "i", scope: !279, file: !85, line: 139, type: !9)
!327 = !DILocation(line: 0, scope: !279)
!328 = !DILocation(line: 141, column: 58, scope: !329)
!329 = distinct !DILexicalBlock(scope: !330, file: !85, line: 140, column: 3)
!330 = distinct !DILexicalBlock(scope: !331, file: !85, line: 151, column: 3)
!331 = distinct !DILexicalBlock(scope: !279, file: !85, line: 150, column: 3)
!332 = !DILocation(line: 141, column: 67, scope: !329)
!333 = !DILocation(line: 141, column: 9, scope: !329)
!334 = !DILocalVariable(name: "tmp", scope: !279, file: !85, line: 140, type: !9)
!335 = !DILocation(line: 141, column: 5, scope: !330)
!336 = !DILocalVariable(name: "tmp___0", scope: !279, file: !85, line: 141, type: !9)
!337 = !DILocation(line: 142, column: 5, scope: !330)
!338 = !DILocation(line: 142, column: 3, scope: !330)
!339 = !DILocation(line: 142, column: 25, scope: !330)
!340 = !DILocation(line: 143, column: 62, scope: !341)
!341 = distinct !DILexicalBlock(scope: !330, file: !85, line: 143, column: 3)
!342 = !DILocation(line: 143, column: 71, scope: !341)
!343 = !DILocation(line: 143, column: 13, scope: !341)
!344 = !DILocalVariable(name: "tmp___1", scope: !279, file: !85, line: 142, type: !9)
!345 = !DILocation(line: 143, column: 5, scope: !330)
!346 = !DILocalVariable(name: "tmp___2", scope: !279, file: !85, line: 143, type: !9)
!347 = !DILocation(line: 144, column: 5, scope: !330)
!348 = !DILocation(line: 144, column: 3, scope: !330)
!349 = !DILocation(line: 144, column: 25, scope: !330)
!350 = !DILocation(line: 145, column: 63, scope: !351)
!351 = distinct !DILexicalBlock(scope: !330, file: !85, line: 145, column: 3)
!352 = !DILocation(line: 145, column: 72, scope: !351)
!353 = !DILocation(line: 145, column: 13, scope: !351)
!354 = !DILocalVariable(name: "tmp___3", scope: !279, file: !85, line: 144, type: !9)
!355 = !DILocation(line: 145, column: 5, scope: !330)
!356 = !DILocalVariable(name: "tmp___4", scope: !279, file: !85, line: 145, type: !9)
!357 = !DILocation(line: 146, column: 5, scope: !330)
!358 = !DILocation(line: 146, column: 3, scope: !330)
!359 = !DILocation(line: 146, column: 25, scope: !330)
!360 = !DILocalVariable(name: "tmp___5", scope: !279, file: !85, line: 146, type: !9)
!361 = !DILocation(line: 147, column: 5, scope: !330)
!362 = !DILocation(line: 147, column: 3, scope: !330)
!363 = !DILocation(line: 147, column: 25, scope: !330)
!364 = !DILocation(line: 153, column: 49, scope: !365)
!365 = distinct !DILexicalBlock(scope: !330, file: !85, line: 148, column: 3)
!366 = !DILocation(line: 154, column: 27, scope: !365)
!367 = !DILocation(line: 154, column: 38, scope: !365)
!368 = !DILocation(line: 154, column: 49, scope: !365)
!369 = !DILocation(line: 153, column: 15, scope: !365)
!370 = !DILocalVariable(name: "print_len", scope: !279, file: !85, line: 137, type: !9)
!371 = !DILocalVariable(name: "calc_len", scope: !279, file: !85, line: 138, type: !9)
!372 = !DILocation(line: 159, column: 16, scope: !373)
!373 = distinct !DILexicalBlock(scope: !331, file: !85, line: 159, column: 7)
!374 = !DILocation(line: 159, column: 7, scope: !331)
!375 = !DILocation(line: 161, column: 38, scope: !376)
!376 = distinct !DILexicalBlock(scope: !377, file: !85, line: 161, column: 5)
!377 = distinct !DILexicalBlock(scope: !378, file: !85, line: 160, column: 5)
