; ModuleID = '/tmp/tmp.ll'
source_filename = "c/spell-1.0.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i32, [44 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.str = type { i8*, i32, i32 }
%struct.stat = type { i64, i16, i64, i32, i32, i32, i32, i64, i16, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, i64, i64 }
%struct.timespec = type { i64, i64 }
%struct.pipe = type { i32, i32, i32, i32, i32, i32, %struct.__anonstruct_fd_set_13 }
%struct.__anonstruct_fd_set_13 = type { [16 x i64] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.timeval = type { i64, i64 }

@.str = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@version = constant [12 x i8] c"version 1.0\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [11 x i8] c"all-chains\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c"british\00", align 1
@.str.3 = private unnamed_addr constant [11 x i8] c"dictionary\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"help\00", align 1
@.str.5 = private unnamed_addr constant [7 x i8] c"ispell\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "version", scope: !2, file: !147, line: 107, type: !179, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !12, globals: !144, nameTableKind: GNU)
!3 = !DIFile(filename: "c/spell-1.0.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "add_line_return", file: !6, line: 29, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/abs/pronto/test-suite/spell-1.0/str.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "ADD_LINE_OK", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "ADD_LINE_ERR", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "ADD_LINE_EOF", value: 2, isUnsigned: true)
!12 = !{!13, !15, !20, !25, !21, !23, !26, !28, !69, !71, !40, !72, !5, !7, !122, !124, !125, !135, !141}
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !14, line: 213, baseType: !7)
!14 = !DIFile(filename: "/usr/lib/gcc-lib/i486-linux/3.3.5/include/stddef.h", directory: "")
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "str_t", file: !6, line: 42, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "str", file: !6, line: 36, size: 128, elements: !18)
!18 = !{!19, !22, !24}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !17, file: !6, line: 37, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !17, file: !6, line: 38, baseType: !23, size: 32, offset: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !17, file: !6, line: 39, baseType: !13, size: 32, offset: 96)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !30, line: 36, size: 1152, elements: !31)
!30 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!31 = !{!32, !36, !38, !41, !43, !45, !47, !49, !50, !51, !54, !56, !58, !65, !66, !67, !68}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !29, file: !30, line: 37, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !34, line: 136, baseType: !35)
!34 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!35 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !29, file: !30, line: 38, baseType: !37, size: 16, offset: 64)
!37 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !29, file: !30, line: 39, baseType: !39, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !34, line: 139, baseType: !40)
!40 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !29, file: !30, line: 40, baseType: !42, size: 32, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !34, line: 141, baseType: !7)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !29, file: !30, line: 41, baseType: !44, size: 32, offset: 224)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !34, line: 142, baseType: !7)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !29, file: !30, line: 42, baseType: !46, size: 32, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !34, line: 137, baseType: !7)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !29, file: !30, line: 43, baseType: !48, size: 32, offset: 288)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !34, line: 138, baseType: !7)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !29, file: !30, line: 44, baseType: !33, size: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !29, file: !30, line: 45, baseType: !37, size: 16, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !29, file: !30, line: 46, baseType: !52, size: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !34, line: 143, baseType: !53)
!53 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !29, file: !30, line: 47, baseType: !55, size: 64, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !34, line: 166, baseType: !53)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !29, file: !30, line: 48, baseType: !57, size: 64, offset: 576)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !34, line: 171, baseType: !53)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !29, file: !30, line: 49, baseType: !59, size: 128, offset: 640)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !60, line: 118, size: 128, elements: !61)
!60 = !DIFile(filename: "/usr/include/time.h", directory: "")
!61 = !{!62, !64}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !59, file: !60, line: 119, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !34, line: 151, baseType: !53)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !59, file: !60, line: 120, baseType: !53, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !29, file: !30, line: 50, baseType: !59, size: 128, offset: 768)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !29, file: !30, line: 51, baseType: !59, size: 128, offset: 896)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__unused4", scope: !29, file: !30, line: 52, baseType: !40, size: 64, offset: 1024)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__unused5", scope: !29, file: !30, line: 53, baseType: !40, size: 64, offset: 1088)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !74, line: 46, baseType: !75)
!74 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !76, line: 264, size: 1728, elements: !77)
!76 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !98, !99, !100, !101, !102, !103, !105, !109, !112, !115, !116, !117, !118}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !75, file: !76, line: 265, baseType: !23, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !75, file: !76, line: 266, baseType: !20, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !75, file: !76, line: 267, baseType: !20, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !75, file: !76, line: 268, baseType: !20, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !75, file: !76, line: 269, baseType: !20, size: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !75, file: !76, line: 270, baseType: !20, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !75, file: !76, line: 271, baseType: !20, size: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !75, file: !76, line: 272, baseType: !20, size: 64, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !75, file: !76, line: 273, baseType: !20, size: 64, offset: 512)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !75, file: !76, line: 274, baseType: !20, size: 64, offset: 576)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !75, file: !76, line: 275, baseType: !20, size: 64, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !75, file: !76, line: 276, baseType: !20, size: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !75, file: !76, line: 277, baseType: !91, size: 64, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !76, line: 179, size: 192, elements: !93)
!93 = !{!94, !95, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !92, file: !76, line: 180, baseType: !91, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !92, file: !76, line: 181, baseType: !96, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !92, file: !76, line: 182, baseType: !23, size: 32, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !75, file: !76, line: 278, baseType: !96, size: 64, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !75, file: !76, line: 279, baseType: !23, size: 32, offset: 896)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !75, file: !76, line: 280, baseType: !23, size: 32, offset: 928)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !75, file: !76, line: 281, baseType: !52, size: 64, offset: 960)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !75, file: !76, line: 282, baseType: !37, size: 16, offset: 1024)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !75, file: !76, line: 283, baseType: !104, size: 8, offset: 1040)
!104 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !75, file: !76, line: 284, baseType: !106, size: 8, offset: 1048)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 1)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !75, file: !76, line: 285, baseType: !110, size: 64, offset: 1088)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !76, line: 173, baseType: null)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !75, file: !76, line: 286, baseType: !113, size: 64, offset: 1152)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !34, line: 144, baseType: !114)
!114 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !75, file: !76, line: 287, baseType: !25, size: 64, offset: 1216)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !75, file: !76, line: 288, baseType: !25, size: 64, offset: 1280)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !75, file: !76, line: 289, baseType: !23, size: 32, offset: 1344)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !75, file: !76, line: 290, baseType: !119, size: 352, offset: 1376)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 352, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 44)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !34, line: 153, baseType: !53)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !127, line: 67, baseType: !128)
!127 = !DIFile(filename: "/usr/include/sys/select.h", directory: "")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_fd_set_13", file: !127, line: 67, size: 1024, elements: !129)
!129 = !{!130}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__fds_bits", scope: !128, file: !127, line: 68, baseType: !131, size: 1024)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 1024, elements: !133)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !127, line: 55, baseType: !53)
!133 = !{!134}
!134 = !DISubrange(count: 16)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !137, line: 69, size: 128, elements: !138)
!137 = !DIFile(filename: "/usr/include/bits/time.h", directory: "")
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !136, file: !137, line: 70, baseType: !63, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !136, file: !137, line: 71, baseType: !124, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !23}
!144 = !{!0, !145, !159, !161, !163, !165, !167, !169, !171, !173, !175, !177}
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !147, line: 110, type: !148, isLocal: false, isDefinition: true)
!147 = !DIFile(filename: "/abs/pronto/test-suite/spell-1.0/spell.c", directory: "")
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 3328, elements: !157)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !151, line: 78, size: 256, elements: !152)
!151 = !DIFile(filename: "/abs/pronto/test-suite/spell-1.0/getopt.h", directory: "")
!152 = !{!153, !154, !155, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !150, file: !151, line: 79, baseType: !26, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !150, file: !151, line: 80, baseType: !23, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !150, file: !151, line: 81, baseType: !71, size: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !150, file: !151, line: 82, baseType: !23, size: 32, offset: 192)
!157 = !{!158}
!158 = !DISubrange(count: 13)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "program_name", scope: !2, file: !147, line: 128, type: !20, isLocal: false, isDefinition: true)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "ispell_prog", scope: !2, file: !147, line: 131, type: !20, isLocal: false, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "dictionary", scope: !2, file: !147, line: 134, type: !20, isLocal: false, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "show_ispell_version", scope: !2, file: !147, line: 137, type: !23, isLocal: false, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "read_stdin", scope: !2, file: !147, line: 140, type: !23, isLocal: false, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "british", scope: !2, file: !147, line: 143, type: !23, isLocal: false, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !147, line: 147, type: !23, isLocal: false, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "number_lines", scope: !2, file: !147, line: 150, type: !23, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "print_file_names", scope: !2, file: !147, line: 154, type: !23, isLocal: false, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "interactive", scope: !2, file: !147, line: 157, type: !23, isLocal: false, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 96, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 12)
!182 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!183 = !{i32 2, !"Dwarf Version", i32 4}
!184 = !{i32 2, !"Debug Info Version", i32 3}
!185 = !{i32 1, !"wchar_size", i32 4}
!186 = !{i32 7, !"PIC Level", i32 2}
!187 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!188 = distinct !DISubprogram(name: "str_make", scope: !189, file: !189, line: 77, type: !190, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !192)
!189 = !DIFile(filename: "/abs/pronto/test-suite/spell-1.0/str.c", directory: "")
!190 = !DISubroutineType(types: !191)
!191 = !{!15, !15}
!192 = !{}
!193 = !DILocalVariable(name: "str", arg: 1, scope: !188, file: !189, line: 77, type: !15)
!194 = !DILocation(line: 0, scope: !188)
!195 = !DILocation(line: 80, column: 9, scope: !196)
!196 = distinct !DILexicalBlock(scope: !197, file: !189, line: 80, column: 7)
!197 = distinct !DILexicalBlock(scope: !188, file: !189, line: 85, column: 3)
!198 = !DILocation(line: 80, column: 7, scope: !197)
!199 = !DILocation(line: 82, column: 11, scope: !200)
!200 = distinct !DILexicalBlock(scope: !201, file: !189, line: 81, column: 5)
!201 = distinct !DILexicalBlock(scope: !196, file: !189, line: 80, column: 14)
!202 = !DILocalVariable(name: "tmp", scope: !188, file: !189, line: 79, type: !25)
!203 = !DILocalVariable(name: "tmp___0", scope: !188, file: !189, line: 80, type: !13)
!204 = !DILocation(line: 83, column: 10, scope: !200)
!205 = !DILocation(line: 83, column: 14, scope: !200)
!206 = !DILocation(line: 83, column: 15, scope: !200)
!207 = !DILocalVariable(name: "tmp___1", scope: !188, file: !189, line: 81, type: !25)
!208 = !DILocation(line: 85, column: 3, scope: !201)
!209 = !DILocalVariable(name: "tmp___2", scope: !188, file: !189, line: 82, type: !13)
!210 = !DILocation(line: 86, column: 10, scope: !211)
!211 = distinct !DILexicalBlock(scope: !212, file: !189, line: 86, column: 5)
!212 = distinct !DILexicalBlock(scope: !196, file: !189, line: 85, column: 10)
!213 = !DILocation(line: 86, column: 14, scope: !211)
!214 = !DILocation(line: 86, column: 37, scope: !211)
!215 = !DILocation(line: 86, column: 15, scope: !211)
!216 = !DILocalVariable(name: "tmp___3", scope: !188, file: !189, line: 83, type: !25)
!217 = !DILocation(line: 87, column: 8, scope: !197)
!218 = !DILocation(line: 87, column: 12, scope: !197)
!219 = !DILocation(line: 89, column: 3, scope: !197)
!220 = distinct !DISubprogram(name: "xmalloc", scope: !189, file: !189, line: 310, type: !221, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !192)
!221 = !DISubroutineType(types: !222)
!222 = !{!25, !13}
!223 = !DILocalVariable(name: "size", arg: 1, scope: !220, file: !189, line: 310, type: !13)
!224 = !DILocation(line: 0, scope: !220)
!225 = !DILocation(line: 313, column: 9, scope: !226)
!226 = distinct !DILexicalBlock(scope: !227, file: !189, line: 316, column: 3)
!227 = distinct !DILexicalBlock(scope: !220, file: !189, line: 315, column: 3)
!228 = !DILocalVariable(name: "tmp", scope: !220, file: !189, line: 313, type: !25)
!229 = !DILocalVariable(name: "ptr", scope: !220, file: !189, line: 312, type: !25)
!230 = !DILocation(line: 315, column: 9, scope: !231)
!231 = distinct !DILexicalBlock(scope: !227, file: !189, line: 315, column: 7)
!232 = !DILocation(line: 315, column: 7, scope: !227)
!233 = !DILocation(line: 316, column: 5, scope: !234)
!234 = distinct !DILexicalBlock(scope: !235, file: !189, line: 316, column: 5)
!235 = distinct !DILexicalBlock(scope: !231, file: !189, line: 315, column: 14)
!236 = !DILocation(line: 318, column: 3, scope: !235)
!237 = !DILocation(line: 317, column: 3, scope: !227)
!238 = distinct !DISubprogram(name: "xrealloc", scope: !189, file: !189, line: 324, type: !239, scopeLine: 325, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !192)
!239 = !DISubroutineType(types: !240)
!240 = !{!25, !25, !13}
!241 = !DILocalVariable(name: "ptr", arg: 1, scope: !238, file: !189, line: 324, type: !25)
!242 = !DILocation(line: 0, scope: !238)
!243 = !DILocalVariable(name: "size", arg: 2, scope: !238, file: !189, line: 324, type: !13)
!244 = !DILocation(line: 327, column: 9, scope: !245)
!245 = distinct !DILexicalBlock(scope: !246, file: !189, line: 327, column: 7)
!246 = distinct !DILexicalBlock(scope: !238, file: !189, line: 327, column: 3)
!247 = !DILocation(line: 327, column: 7, scope: !246)
!248 = !DILocation(line: 328, column: 11, scope: !249)
!249 = distinct !DILexicalBlock(scope: !250, file: !189, line: 328, column: 5)
!250 = distinct !DILexicalBlock(scope: !245, file: !189, line: 327, column: 14)
!251 = !DILocalVariable(name: "tmp", scope: !238, file: !189, line: 326, type: !25)
!252 = !DILocation(line: 328, column: 5, scope: !250)
!253 = !DILocation(line: 329, column: 9, scope: !254)
!254 = distinct !DILexicalBlock(scope: !246, file: !189, line: 330, column: 3)
!255 = !DILocation(line: 330, column: 9, scope: !256)
!256 = distinct !DILexicalBlock(scope: !246, file: !189, line: 330, column: 7)
!257 = !DILocation(line: 330, column: 7, scope: !246)
!258 = !DILocation(line: 331, column: 5, scope: !259)
!259 = distinct !DILexicalBlock(scope: !260, file: !189, line: 331, column: 5)
!260 = distinct !DILexicalBlock(scope: !256, file: !189, line: 330, column: 14)
!261 = !DILocation(line: 333, column: 3, scope: !260)
!262 = !DILocation(line: 332, column: 3, scope: !246)
!263 = !DILocation(line: 0, scope: !246)
!264 = !DILocation(line: 334, column: 1, scope: !238)
!265 = distinct !DISubprogram(name: "str_add_char", scope: !189, file: !189, line: 95, type: !266, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !192)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !15, !21}
!268 = !DILocalVariable(name: "str", arg: 1, scope: !265, file: !189, line: 95, type: !15)
!269 = !DILocation(line: 0, scope: !265)
!270 = !DILocalVariable(name: "c", arg: 2, scope: !265, file: !189, line: 95, type: !21)
!271 = !DILocation(line: 98, column: 9, scope: !272)
!272 = distinct !DILexicalBlock(scope: !273, file: !189, line: 98, column: 7)
!273 = distinct !DILexicalBlock(scope: !265, file: !189, line: 100, column: 3)
!274 = !DILocation(line: 98, column: 7, scope: !273)
!275 = !DILocation(line: 99, column: 11, scope: !276)
!276 = distinct !DILexicalBlock(scope: !277, file: !189, line: 99, column: 5)
!277 = distinct !DILexicalBlock(scope: !272, file: !189, line: 98, column: 14)
!278 = !DILocation(line: 101, column: 3, scope: !277)
!279 = !DILocation(line: 98, column: 14, scope: !280)
!280 = distinct !DILexicalBlock(scope: !272, file: !189, line: 98, column: 7)
!281 = !DILocation(line: 98, column: 9, scope: !280)
!282 = !DILocation(line: 98, column: 7, scope: !272)
!283 = !DILocation(line: 99, column: 11, scope: !284)
!284 = distinct !DILexicalBlock(scope: !285, file: !189, line: 99, column: 5)
!285 = distinct !DILexicalBlock(scope: !280, file: !189, line: 98, column: 19)
!286 = !DILocation(line: 101, column: 3, scope: !285)
!287 = !DILocation(line: 101, column: 9, scope: !273)
!288 = !DILocation(line: 101, column: 14, scope: !273)
!289 = !DILocation(line: 101, column: 21, scope: !290)
!290 = distinct !DILexicalBlock(scope: !273, file: !189, line: 101, column: 7)
!291 = !DILocation(line: 101, column: 32, scope: !290)
!292 = !DILocation(line: 101, column: 25, scope: !290)
!293 = !DILocation(line: 101, column: 7, scope: !273)
!294 = !DILocation(line: 102, column: 16, scope: !295)
!295 = distinct !DILexicalBlock(scope: !296, file: !189, line: 102, column: 5)
!296 = distinct !DILexicalBlock(scope: !290, file: !189, line: 101, column: 37)
!297 = !DILocation(line: 102, column: 20, scope: !295)
!298 = !DILocalVariable(name: "tmp", scope: !265, file: !189, line: 97, type: !13)
!299 = !DILocation(line: 102, column: 10, scope: !295)
!300 = !DILocation(line: 102, column: 14, scope: !295)
!301 = !DILocation(line: 102, column: 37, scope: !295)
!302 = !DILocation(line: 102, column: 15, scope: !295)
!303 = !DILocalVariable(name: "tmp___0", scope: !265, file: !189, line: 98, type: !25)
!304 = !DILocation(line: 104, column: 3, scope: !296)
!305 = !DILocation(line: 104, column: 10, scope: !273)
!306 = !DILocation(line: 104, column: 22, scope: !273)
!307 = !DILocation(line: 104, column: 26, scope: !273)
!308 = !DILocation(line: 104, column: 14, scope: !273)
!309 = !DILocation(line: 104, column: 32, scope: !273)
!310 = !DILocation(line: 105, column: 3, scope: !273)
!311 = distinct !DISubprogram(name: "str_add_str", scope: !189, file: !189, line: 110, type: !312, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !192)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !15, !15}
!314 = !DILocalVariable(name: "str1", arg: 1, scope: !311, file: !189, line: 110, type: !15)
!315 = !DILocation(line: 0, scope: !311)
!316 = !DILocalVariable(name: "str2", arg: 2, scope: !311, file: !189, line: 110, type: !15)
!317 = !DILocalVariable(name: "pos", scope: !311, file: !189, line: 112, type: !23)
!318 = !DILocation(line: 115, column: 9, scope: !319)
!319 = distinct !DILexicalBlock(scope: !320, file: !189, line: 115, column: 7)
!320 = distinct !DILexicalBlock(scope: !311, file: !189, line: 114, column: 3)
!321 = !DILocation(line: 115, column: 7, scope: !320)
!322 = !DILocation(line: 116, column: 5, scope: !323)
!323 = distinct !DILexicalBlock(scope: !319, file: !189, line: 115, column: 15)
!324 = !DILocation(line: 115, column: 15, scope: !325)
!325 = distinct !DILexicalBlock(scope: !319, file: !189, line: 115, column: 7)
!326 = !DILocation(line: 115, column: 9, scope: !325)
!327 = !DILocation(line: 115, column: 7, scope: !319)
!328 = !DILocation(line: 116, column: 5, scope: !329)
!329 = distinct !DILexicalBlock(scope: !325, file: !189, line: 115, column: 20)
!330 = !DILocation(line: 117, column: 9, scope: !331)
!331 = distinct !DILexicalBlock(scope: !320, file: !189, line: 117, column: 7)
!332 = !DILocation(line: 117, column: 7, scope: !320)
!333 = !DILocation(line: 118, column: 12, scope: !334)
!334 = distinct !DILexicalBlock(scope: !335, file: !189, line: 118, column: 5)
!335 = distinct !DILexicalBlock(scope: !331, file: !189, line: 117, column: 15)
!336 = !DILocation(line: 120, column: 3, scope: !335)
!337 = !DILocation(line: 117, column: 15, scope: !338)
!338 = distinct !DILexicalBlock(scope: !331, file: !189, line: 117, column: 7)
!339 = !DILocation(line: 117, column: 9, scope: !338)
!340 = !DILocation(line: 117, column: 7, scope: !331)
!341 = !DILocation(line: 118, column: 12, scope: !342)
!342 = distinct !DILexicalBlock(scope: !343, file: !189, line: 118, column: 5)
!343 = distinct !DILexicalBlock(scope: !338, file: !189, line: 117, column: 20)
!344 = !DILocation(line: 120, column: 3, scope: !343)
!345 = !DILocation(line: 120, column: 3, scope: !346)
!346 = distinct !DILexicalBlock(scope: !320, file: !189, line: 121, column: 3)
!347 = !DILocation(line: 0, scope: !320)
!348 = !DILocation(line: 120, column: 13, scope: !346)
!349 = !DILocation(line: 120, column: 24, scope: !350)
!350 = distinct !DILexicalBlock(scope: !351, file: !189, line: 120, column: 9)
!351 = distinct !DILexicalBlock(scope: !346, file: !189, line: 120, column: 13)
!352 = !DILocation(line: 120, column: 16, scope: !350)
!353 = !DILocation(line: 120, column: 9, scope: !351)
!354 = !DILocation(line: 120, column: 7, scope: !355)
!355 = distinct !DILexicalBlock(scope: !350, file: !189, line: 120, column: 30)
!356 = !DILocation(line: 121, column: 32, scope: !357)
!357 = distinct !DILexicalBlock(scope: !351, file: !189, line: 122, column: 5)
!358 = !DILocation(line: 121, column: 36, scope: !357)
!359 = !DILocation(line: 121, column: 24, scope: !357)
!360 = !DILocation(line: 121, column: 5, scope: !357)
!361 = !DILocation(line: 120, column: 9, scope: !357)
!362 = distinct !{!362, !345, !363}
!363 = !DILocation(line: 122, column: 3, scope: !346)
!364 = !DILocation(line: 122, column: 3, scope: !320)
!365 = !DILocation(line: 124, column: 1, scope: !311)
!366 = distinct !DISubprogram(name: "str_add_line", scope: !189, file: !189, line: 129, type: !367, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !192)
!367 = !DISubroutineType(types: !368)
!368 = !{!23, !15, !72}
!369 = !DILocalVariable(name: "str", arg: 1, scope: !366, file: !189, line: 129, type: !15)
!370 = !DILocation(line: 0, scope: !366)
!371 = !DILocalVariable(name: "stream", arg: 2, scope: !366, file: !189, line: 129, type: !72)
!372 = !DILocation(line: 132, column: 9, scope: !373)
!373 = distinct !DILexicalBlock(scope: !374, file: !189, line: 132, column: 7)
!374 = distinct !DILexicalBlock(scope: !366, file: !189, line: 135, column: 3)
!375 = !DILocation(line: 132, column: 7, scope: !374)
!376 = !DILocation(line: 133, column: 11, scope: !377)
!377 = distinct !DILexicalBlock(scope: !378, file: !189, line: 133, column: 5)
!378 = distinct !DILexicalBlock(scope: !373, file: !189, line: 132, column: 14)
!379 = !DILocation(line: 135, column: 3, scope: !378)
!380 = !DILocation(line: 132, column: 14, scope: !381)
!381 = distinct !DILexicalBlock(scope: !373, file: !189, line: 132, column: 7)
!382 = !DILocation(line: 132, column: 9, scope: !381)
!383 = !DILocation(line: 132, column: 7, scope: !373)
!384 = !DILocation(line: 133, column: 11, scope: !385)
!385 = distinct !DILexicalBlock(scope: !386, file: !189, line: 133, column: 5)
!386 = distinct !DILexicalBlock(scope: !381, file: !189, line: 132, column: 19)
!387 = !DILocation(line: 135, column: 3, scope: !386)
!388 = !DILocation(line: 134, column: 9, scope: !389)
!389 = distinct !DILexicalBlock(scope: !374, file: !189, line: 134, column: 7)
!390 = !DILocation(line: 134, column: 7, scope: !374)
!391 = !DILocation(line: 135, column: 5, scope: !392)
!392 = distinct !DILexicalBlock(scope: !389, file: !189, line: 134, column: 17)
!393 = !DILocation(line: 137, column: 3, scope: !394)
!394 = distinct !DILexicalBlock(scope: !374, file: !189, line: 137, column: 3)
!395 = !DILocation(line: 137, column: 13, scope: !394)
!396 = !DILocation(line: 139, column: 11, scope: !397)
!397 = distinct !DILexicalBlock(scope: !398, file: !189, line: 139, column: 5)
!398 = distinct !DILexicalBlock(scope: !394, file: !189, line: 137, column: 13)
!399 = !DILocalVariable(name: "tmp", scope: !366, file: !189, line: 132, type: !23)
!400 = !DILocation(line: 139, column: 9, scope: !397)
!401 = !DILocalVariable(name: "c", scope: !366, file: !189, line: 131, type: !21)
!402 = !DILocation(line: 141, column: 9, scope: !403)
!403 = distinct !DILexicalBlock(scope: !398, file: !189, line: 141, column: 9)
!404 = !DILocation(line: 141, column: 17, scope: !403)
!405 = !DILocation(line: 141, column: 9, scope: !398)
!406 = !DILocation(line: 142, column: 7, scope: !407)
!407 = distinct !DILexicalBlock(scope: !403, file: !189, line: 141, column: 24)
!408 = !DILocation(line: 141, column: 17, scope: !409)
!409 = distinct !DILexicalBlock(scope: !410, file: !189, line: 144, column: 7)
!410 = distinct !DILexicalBlock(scope: !403, file: !189, line: 143, column: 12)
!411 = !DILocalVariable(name: "tmp___0", scope: !366, file: !189, line: 133, type: !23)
!412 = !DILocation(line: 141, column: 11, scope: !413)
!413 = distinct !DILexicalBlock(scope: !410, file: !189, line: 141, column: 11)
!414 = !DILocation(line: 141, column: 11, scope: !410)
!415 = !DILocation(line: 142, column: 9, scope: !416)
!416 = distinct !DILexicalBlock(scope: !413, file: !189, line: 141, column: 20)
!417 = !DILocation(line: 143, column: 5, scope: !418)
!418 = distinct !DILexicalBlock(scope: !398, file: !189, line: 145, column: 5)
!419 = !DILocation(line: 144, column: 9, scope: !420)
!420 = distinct !DILexicalBlock(scope: !398, file: !189, line: 144, column: 9)
!421 = !DILocation(line: 144, column: 17, scope: !420)
!422 = !DILocation(line: 144, column: 9, scope: !398)
!423 = !DILocation(line: 145, column: 7, scope: !424)
!424 = distinct !DILexicalBlock(scope: !420, file: !189, line: 144, column: 24)
!425 = distinct !{!425, !393, !426}
!426 = !DILocation(line: 147, column: 3, scope: !394)
!427 = !DILocation(line: 148, column: 3, scope: !374)
!428 = !DILocation(line: 0, scope: !374)
!429 = !DILocation(line: 150, column: 1, scope: !366)
!430 = distinct !DISubprogram(name: "str_add_line_from_desc", scope: !189, file: !189, line: 157, type: !431, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !192)
!431 = !DISubroutineType(types: !432)
!432 = !{!23, !15, !23}
!433 = !DILocalVariable(name: "str", arg: 1, scope: !430, file: !189, line: 157, type: !15)
!434 = !DILocation(line: 0, scope: !430)
!435 = !DILocalVariable(name: "file_desc", arg: 2, scope: !430, file: !189, line: 157, type: !23)
!436 = !DILocalVariable(name: "c", scope: !430, file: !189, line: 160, type: !21)
!437 = !DILocation(line: 160, column: 8, scope: !430)
!438 = !DILocalVariable(name: "nchars", scope: !430, file: !189, line: 159, type: !23)
!439 = !DILocation(line: 161, column: 5, scope: !440)
!440 = distinct !DILexicalBlock(scope: !430, file: !189, line: 162, column: 3)
!441 = !DILocation(line: 163, column: 9, scope: !442)
!442 = distinct !DILexicalBlock(scope: !440, file: !189, line: 163, column: 7)
!443 = !DILocation(line: 163, column: 7, scope: !440)
!444 = !DILocation(line: 164, column: 11, scope: !445)
!445 = distinct !DILexicalBlock(scope: !446, file: !189, line: 164, column: 5)
!446 = distinct !DILexicalBlock(scope: !442, file: !189, line: 163, column: 14)
!447 = !DILocation(line: 166, column: 3, scope: !446)
!448 = !DILocation(line: 163, column: 14, scope: !449)
!449 = distinct !DILexicalBlock(scope: !442, file: !189, line: 163, column: 7)
!450 = !DILocation(line: 163, column: 9, scope: !449)
!451 = !DILocation(line: 163, column: 7, scope: !442)
!452 = !DILocation(line: 164, column: 11, scope: !453)
!453 = distinct !DILexicalBlock(scope: !454, file: !189, line: 164, column: 5)
!454 = distinct !DILexicalBlock(scope: !449, file: !189, line: 163, column: 19)
!455 = !DILocation(line: 166, column: 3, scope: !454)
!456 = !DILocation(line: 166, column: 3, scope: !457)
!457 = distinct !DILexicalBlock(scope: !440, file: !189, line: 167, column: 3)
!458 = !DILocation(line: 166, column: 13, scope: !457)
!459 = !DILocation(line: 168, column: 14, scope: !460)
!460 = distinct !DILexicalBlock(scope: !461, file: !189, line: 168, column: 5)
!461 = distinct !DILexicalBlock(scope: !457, file: !189, line: 166, column: 13)
!462 = !DILocation(line: 170, column: 11, scope: !463)
!463 = distinct !DILexicalBlock(scope: !461, file: !189, line: 170, column: 9)
!464 = !DILocation(line: 170, column: 9, scope: !461)
!465 = !DILocation(line: 171, column: 7, scope: !466)
!466 = distinct !DILexicalBlock(scope: !463, file: !189, line: 170, column: 19)
!467 = !DILocation(line: 172, column: 16, scope: !468)
!468 = distinct !DILexicalBlock(scope: !461, file: !189, line: 172, column: 9)
!469 = !DILocation(line: 172, column: 9, scope: !461)
!470 = !DILocation(line: 173, column: 7, scope: !471)
!471 = distinct !DILexicalBlock(scope: !468, file: !189, line: 172, column: 21)
!472 = !DILocation(line: 175, column: 23, scope: !473)
!473 = distinct !DILexicalBlock(scope: !461, file: !189, line: 175, column: 5)
!474 = !DILocation(line: 175, column: 5, scope: !473)
!475 = !DILocation(line: 176, column: 15, scope: !476)
!476 = distinct !DILexicalBlock(scope: !461, file: !189, line: 176, column: 9)
!477 = !DILocation(line: 176, column: 9, scope: !476)
!478 = !DILocation(line: 176, column: 17, scope: !476)
!479 = !DILocation(line: 176, column: 9, scope: !461)
!480 = !DILocation(line: 177, column: 7, scope: !481)
!481 = distinct !DILexicalBlock(scope: !476, file: !189, line: 176, column: 24)
!482 = distinct !{!482, !456, !483}
!483 = !DILocation(line: 179, column: 3, scope: !457)
!484 = !DILocation(line: 180, column: 3, scope: !440)
!485 = !DILocation(line: 0, scope: !440)
!486 = !DILocation(line: 182, column: 1, scope: !430)
!487 = distinct !DISubprogram(name: "safe_read", scope: !189, file: !189, line: 339, type: !488, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !192)
!488 = !DISubroutineType(types: !489)
!489 = !{!23, !23, !20, !23}
!490 = !DILocalVariable(name: "desc", arg: 1, scope: !487, file: !189, line: 339, type: !23)
!491 = !DILocation(line: 0, scope: !487)
!492 = !DILocalVariable(name: "ptr", arg: 2, scope: !487, file: !189, line: 339, type: !20)
!493 = !DILocalVariable(name: "len", arg: 3, scope: !487, file: !189, line: 339, type: !23)
!494 = !DILocation(line: 344, column: 11, scope: !495)
!495 = distinct !DILexicalBlock(scope: !496, file: !189, line: 344, column: 7)
!496 = distinct !DILexicalBlock(scope: !487, file: !189, line: 344, column: 3)
!497 = !DILocation(line: 344, column: 7, scope: !496)
!498 = !DILocation(line: 345, column: 5, scope: !499)
!499 = distinct !DILexicalBlock(scope: !495, file: !189, line: 344, column: 17)
!500 = !DILocation(line: 348, column: 3, scope: !501)
!501 = distinct !DILexicalBlock(scope: !496, file: !189, line: 347, column: 3)
!502 = !DILocation(line: 348, column: 13, scope: !501)
!503 = !DILocation(line: 350, column: 15, scope: !504)
!504 = distinct !DILexicalBlock(scope: !505, file: !189, line: 350, column: 5)
!505 = distinct !DILexicalBlock(scope: !501, file: !189, line: 348, column: 13)
!506 = !DILocalVariable(name: "n_chars", scope: !487, file: !189, line: 341, type: !23)
!507 = !DILocation(line: 348, column: 17, scope: !508)
!508 = distinct !DILexicalBlock(scope: !505, file: !189, line: 348, column: 9)
!509 = !DILocation(line: 348, column: 9, scope: !505)
!510 = !DILocation(line: 348, column: 13, scope: !511)
!511 = distinct !DILexicalBlock(scope: !512, file: !189, line: 349, column: 7)
!512 = distinct !DILexicalBlock(scope: !508, file: !189, line: 348, column: 22)
!513 = !DILocalVariable(name: "tmp", scope: !487, file: !189, line: 342, type: !71)
!514 = !DILocation(line: 348, column: 14, scope: !515)
!515 = distinct !DILexicalBlock(scope: !512, file: !189, line: 348, column: 11)
!516 = !DILocation(line: 348, column: 19, scope: !515)
!517 = !DILocation(line: 348, column: 11, scope: !512)
!518 = !DILocation(line: 348, column: 9, scope: !519)
!519 = distinct !DILexicalBlock(scope: !515, file: !189, line: 348, column: 26)
!520 = !DILocation(line: 350, column: 5, scope: !512)
!521 = !DILocation(line: 348, column: 7, scope: !522)
!522 = distinct !DILexicalBlock(scope: !508, file: !189, line: 350, column: 12)
!523 = distinct !{!523, !500, !524}
!524 = !DILocation(line: 350, column: 3, scope: !501)
!525 = !DILocation(line: 357, column: 3, scope: !496)
!526 = !DILocation(line: 0, scope: !496)
!527 = !DILocation(line: 359, column: 1, scope: !487)
!528 = distinct !DISubprogram(name: "nstr_to_str", scope: !189, file: !189, line: 186, type: !529, scopeLine: 187, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !192)
!529 = !DISubroutineType(types: !530)
!530 = !{!15, !20}
!531 = !DILocalVariable(name: "nstr", arg: 1, scope: !528, file: !189, line: 186, type: !20)
!532 = !DILocation(line: 0, scope: !528)
!533 = !DILocalVariable(name: "str", scope: !528, file: !189, line: 188, type: !15)
!534 = !DILocalVariable(name: "pos", scope: !528, file: !189, line: 189, type: !23)
!535 = !DILocation(line: 192, column: 9, scope: !536)
!536 = distinct !DILexicalBlock(scope: !537, file: !189, line: 192, column: 3)
!537 = distinct !DILexicalBlock(scope: !528, file: !189, line: 191, column: 3)
!538 = !DILocation(line: 194, column: 9, scope: !539)
!539 = distinct !DILexicalBlock(scope: !537, file: !189, line: 194, column: 7)
!540 = !DILocation(line: 194, column: 7, scope: !537)
!541 = !DILocation(line: 195, column: 5, scope: !542)
!542 = distinct !DILexicalBlock(scope: !539, file: !189, line: 194, column: 15)
!543 = !DILocation(line: 196, column: 3, scope: !544)
!544 = distinct !DILexicalBlock(scope: !537, file: !189, line: 197, column: 3)
!545 = !DILocation(line: 0, scope: !537)
!546 = !DILocation(line: 196, column: 13, scope: !544)
!547 = !DILocation(line: 196, column: 18, scope: !548)
!548 = distinct !DILexicalBlock(scope: !549, file: !189, line: 196, column: 9)
!549 = distinct !DILexicalBlock(scope: !544, file: !189, line: 196, column: 13)
!550 = !DILocation(line: 196, column: 11, scope: !548)
!551 = !DILocation(line: 196, column: 9, scope: !549)
!552 = !DILocation(line: 196, column: 7, scope: !553)
!553 = distinct !DILexicalBlock(scope: !548, file: !189, line: 196, column: 26)
!554 = !DILocation(line: 197, column: 30, scope: !555)
!555 = distinct !DILexicalBlock(scope: !549, file: !189, line: 198, column: 5)
!556 = !DILocation(line: 197, column: 23, scope: !555)
!557 = !DILocation(line: 197, column: 5, scope: !555)
!558 = !DILocation(line: 196, column: 9, scope: !555)
!559 = distinct !{!559, !543, !560}
!560 = !DILocation(line: 198, column: 3, scope: !544)
!561 = !DILocation(line: 199, column: 3, scope: !537)
!562 = !DILocation(line: 201, column: 1, scope: !528)
!563 = distinct !DISubprogram(name: "str_to_nstr", scope: !189, file: !189, line: 205, type: !564, scopeLine: 206, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !192)
!564 = !DISubroutineType(types: !565)
!565 = !{!20, !15}
!566 = !DILocalVariable(name: "str", arg: 1, scope: !563, file: !189, line: 205, type: !15)
!567 = !DILocation(line: 0, scope: !563)
!568 = !DILocation(line: 208, column: 32, scope: !569)
!569 = distinct !DILexicalBlock(scope: !570, file: !189, line: 212, column: 3)
!570 = distinct !DILexicalBlock(scope: !563, file: !189, line: 211, column: 3)
!571 = !DILocation(line: 208, column: 36, scope: !569)
!572 = !DILocation(line: 208, column: 9, scope: !569)
!573 = !DILocalVariable(name: "tmp", scope: !563, file: !189, line: 208, type: !25)
!574 = !DILocalVariable(name: "nstr", scope: !563, file: !189, line: 207, type: !20)
!575 = !DILocalVariable(name: "pos", scope: !563, file: !189, line: 209, type: !23)
!576 = !DILocation(line: 211, column: 9, scope: !577)
!577 = distinct !DILexicalBlock(scope: !570, file: !189, line: 211, column: 7)
!578 = !DILocation(line: 211, column: 7, scope: !570)
!579 = !DILocation(line: 212, column: 5, scope: !580)
!580 = distinct !DILexicalBlock(scope: !577, file: !189, line: 211, column: 14)
!581 = !DILocation(line: 211, column: 14, scope: !582)
!582 = distinct !DILexicalBlock(scope: !577, file: !189, line: 211, column: 7)
!583 = !DILocation(line: 211, column: 9, scope: !582)
!584 = !DILocation(line: 211, column: 7, scope: !577)
!585 = !DILocation(line: 212, column: 5, scope: !586)
!586 = distinct !DILexicalBlock(scope: !582, file: !189, line: 211, column: 19)
!587 = !DILocation(line: 214, column: 3, scope: !588)
!588 = distinct !DILexicalBlock(scope: !570, file: !189, line: 214, column: 3)
!589 = !DILocation(line: 0, scope: !570)
!590 = !DILocation(line: 214, column: 13, scope: !588)
!591 = !DILocation(line: 214, column: 23, scope: !592)
!592 = distinct !DILexicalBlock(scope: !593, file: !189, line: 214, column: 9)
!593 = distinct !DILexicalBlock(scope: !588, file: !189, line: 214, column: 13)
!594 = !DILocation(line: 214, column: 16, scope: !592)
!595 = !DILocation(line: 214, column: 9, scope: !593)
!596 = !DILocation(line: 214, column: 7, scope: !597)
!597 = distinct !DILexicalBlock(scope: !592, file: !189, line: 214, column: 29)
!598 = !DILocation(line: 216, column: 18, scope: !599)
!599 = distinct !DILexicalBlock(scope: !593, file: !189, line: 216, column: 9)
!600 = !DILocation(line: 216, column: 22, scope: !599)
!601 = !DILocation(line: 216, column: 11, scope: !599)
!602 = !DILocation(line: 216, column: 9, scope: !593)
!603 = !DILocation(line: 220, column: 14, scope: !604)
!604 = distinct !DILexicalBlock(scope: !599, file: !189, line: 216, column: 30)
!605 = !DILocation(line: 220, column: 18, scope: !604)
!606 = !DILocation(line: 220, column: 25, scope: !604)
!607 = !DILocation(line: 221, column: 5, scope: !604)
!608 = !DILocation(line: 222, column: 28, scope: !593)
!609 = !DILocation(line: 222, column: 32, scope: !593)
!610 = !DILocation(line: 222, column: 21, scope: !593)
!611 = !DILocation(line: 222, column: 12, scope: !593)
!612 = !DILocation(line: 222, column: 19, scope: !593)
!613 = distinct !{!613, !587, !614}
!614 = !DILocation(line: 215, column: 3, scope: !588)
!615 = !DILocation(line: 225, column: 17, scope: !570)
!616 = !DILocation(line: 225, column: 10, scope: !570)
!617 = !DILocation(line: 225, column: 23, scope: !570)
!618 = !DILocation(line: 226, column: 3, scope: !570)
!619 = !DILocation(line: 228, column: 1, scope: !563)
!620 = distinct !DISubprogram(name: "int_to_str", scope: !189, file: !189, line: 236, type: !621, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !192)
!621 = !DISubroutineType(types: !622)
!622 = !{!15, !23}
!623 = !DILocalVariable(name: "num", arg: 1, scope: !620, file: !189, line: 236, type: !23)
!624 = !DILocation(line: 0, scope: !620)
!625 = !DILocalVariable(name: "c", scope: !620, file: !189, line: 238, type: !626)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 16, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 2)
!629 = !DILocation(line: 238, column: 8, scope: !620)
!630 = !DILocalVariable(name: "pos", scope: !620, file: !189, line: 239, type: !23)
!631 = !DILocalVariable(name: "rem", scope: !620, file: !189, line: 240, type: !23)
!632 = !DILocation(line: 242, column: 9, scope: !633)
!633 = distinct !DILexicalBlock(scope: !634, file: !189, line: 247, column: 3)
!634 = distinct !DILexicalBlock(scope: !620, file: !189, line: 246, column: 3)
!635 = !DILocalVariable(name: "tmp", scope: !620, file: !189, line: 242, type: !15)
!636 = !DILocalVariable(name: "rstr", scope: !620, file: !189, line: 241, type: !15)
!637 = !DILocation(line: 243, column: 13, scope: !633)
!638 = !DILocalVariable(name: "tmp___0", scope: !620, file: !189, line: 244, type: !15)
!639 = !DILocalVariable(name: "str", scope: !620, file: !189, line: 243, type: !15)
!640 = !DILocation(line: 247, column: 3, scope: !641)
!641 = distinct !DILexicalBlock(scope: !634, file: !189, line: 245, column: 3)
!642 = !DILocation(line: 247, column: 13, scope: !641)
!643 = !DILocation(line: 247, column: 16, scope: !644)
!644 = distinct !DILexicalBlock(scope: !645, file: !189, line: 247, column: 9)
!645 = distinct !DILexicalBlock(scope: !641, file: !189, line: 247, column: 13)
!646 = !DILocation(line: 247, column: 9, scope: !645)
!647 = !DILocation(line: 247, column: 7, scope: !648)
!648 = distinct !DILexicalBlock(scope: !644, file: !189, line: 247, column: 22)
!649 = !DILocation(line: 249, column: 15, scope: !650)
!650 = distinct !DILexicalBlock(scope: !645, file: !189, line: 249, column: 5)
!651 = !DILocation(line: 250, column: 9, scope: !650)
!652 = !DILocation(line: 251, column: 38, scope: !650)
!653 = !DILocation(line: 251, column: 5, scope: !650)
!654 = !DILocation(line: 252, column: 24, scope: !650)
!655 = !DILocation(line: 252, column: 5, scope: !650)
!656 = distinct !{!656, !640, !657}
!657 = !DILocation(line: 254, column: 3, scope: !641)
!658 = !DILocation(line: 256, column: 15, scope: !634)
!659 = !DILocation(line: 256, column: 19, scope: !634)
!660 = !DILocation(line: 256, column: 3, scope: !661)
!661 = distinct !DILexicalBlock(scope: !634, file: !189, line: 257, column: 3)
!662 = !DILocation(line: 0, scope: !634)
!663 = !DILocation(line: 256, column: 13, scope: !661)
!664 = !DILocation(line: 256, column: 16, scope: !665)
!665 = distinct !DILexicalBlock(scope: !666, file: !189, line: 256, column: 9)
!666 = distinct !DILexicalBlock(scope: !661, file: !189, line: 256, column: 13)
!667 = !DILocation(line: 256, column: 9, scope: !666)
!668 = !DILocation(line: 256, column: 7, scope: !669)
!669 = distinct !DILexicalBlock(scope: !665, file: !189, line: 256, column: 23)
!670 = !DILocation(line: 257, column: 31, scope: !671)
!671 = distinct !DILexicalBlock(scope: !666, file: !189, line: 258, column: 5)
!672 = !DILocation(line: 257, column: 35, scope: !671)
!673 = !DILocation(line: 257, column: 23, scope: !671)
!674 = !DILocation(line: 257, column: 5, scope: !671)
!675 = !DILocation(line: 256, column: 9, scope: !671)
!676 = distinct !{!676, !660, !677}
!677 = !DILocation(line: 258, column: 3, scope: !661)
!678 = !DILocation(line: 259, column: 3, scope: !634)
!679 = distinct !DISubprogram(name: "stat", scope: !680, file: !680, line: 356, type: !681, scopeLine: 357, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !192)
!680 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "")
!681 = !DISubroutineType(types: !682)
!682 = !{!23, !683, !684}
!683 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !26)
!684 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !28)
!685 = !DILocalVariable(name: "__path", arg: 1, scope: !679, file: !680, line: 356, type: !683)
!686 = !DILocation(line: 0, scope: !679)
!687 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !679, file: !680, line: 356, type: !684)
!688 = !DILocation(line: 359, column: 9, scope: !689)
!689 = distinct !DILexicalBlock(scope: !690, file: !680, line: 361, column: 3)
!690 = distinct !DILexicalBlock(scope: !679, file: !680, line: 360, column: 3)
!691 = !DILocalVariable(name: "tmp", scope: !679, file: !680, line: 358, type: !23)
!692 = !DILocation(line: 359, column: 3, scope: !690)
!693 = distinct !DISubprogram(name: "lstat", scope: !680, file: !680, line: 363, type: !681, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !192)
!694 = !DILocalVariable(name: "__path", arg: 1, scope: !693, file: !680, line: 363, type: !683)
!695 = !DILocation(line: 0, scope: !693)
!696 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !693, file: !680, line: 363, type: !684)
!697 = !DILocation(line: 366, column: 9, scope: !698)
!698 = distinct !DILexicalBlock(scope: !699, file: !680, line: 368, column: 3)
!699 = distinct !DILexicalBlock(scope: !693, file: !680, line: 367, column: 3)
!700 = !DILocalVariable(name: "tmp", scope: !693, file: !680, line: 365, type: !23)
!701 = !DILocation(line: 366, column: 3, scope: !699)
!702 = distinct !DISubprogram(name: "fstat", scope: !680, file: !680, line: 370, type: !703, scopeLine: 371, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !192)
!703 = !DISubroutineType(types: !704)
!704 = !{!23, !23, !28}
!705 = !DILocalVariable(name: "__fd", arg: 1, scope: !702, file: !680, line: 370, type: !23)
!706 = !DILocation(line: 0, scope: !702)
!707 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !702, file: !680, line: 370, type: !28)
!708 = !DILocation(line: 372, column: 9, scope: !709)
!709 = distinct !DILexicalBlock(scope: !710, file: !680, line: 375, column: 3)
!710 = distinct !DILexicalBlock(scope: !702, file: !680, line: 374, column: 3)
!711 = !DILocalVariable(name: "tmp", scope: !702, file: !680, line: 372, type: !23)
!712 = !DILocation(line: 372, column: 3, scope: !710)
!713 = distinct !DISubprogram(name: "mknod", scope: !680, file: !680, line: 376, type: !714, scopeLine: 377, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !192)
!714 = !DISubroutineType(types: !715)
!715 = !{!23, !26, !42, !33}
!716 = !DILocalVariable(name: "__path", arg: 1, scope: !713, file: !680, line: 376, type: !26)
!717 = !DILocation(line: 0, scope: !713)
!718 = !DILocalVariable(name: "__mode", arg: 2, scope: !713, file: !680, line: 376, type: !42)
!719 = !DILocalVariable(name: "__dev", arg: 3, scope: !713, file: !680, line: 376, type: !33)
!720 = !DILocation(line: 376, column: 76, scope: !713)
!721 = !DILocation(line: 379, column: 9, scope: !722)
!722 = distinct !DILexicalBlock(scope: !723, file: !680, line: 381, column: 3)
!723 = distinct !DILexicalBlock(scope: !713, file: !680, line: 380, column: 3)
!724 = !DILocalVariable(name: "tmp", scope: !713, file: !680, line: 378, type: !23)
!725 = !DILocation(line: 379, column: 3, scope: !723)
!726 = distinct !DISubprogram(name: "main", scope: !147, file: !147, line: 159, type: !727, scopeLine: 160, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !192)
!727 = !DISubroutineType(types: !728)
!728 = !{!23, !23, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!730 = !DILocalVariable(name: "argc", arg: 1, scope: !726, file: !147, line: 159, type: !23)
!731 = !DILocation(line: 0, scope: !726)
!732 = !DILocalVariable(name: "argv", arg: 2, scope: !726, file: !147, line: 159, type: !729)
!733 = !DILocalVariable(name: "ispell_pipe", scope: !726, file: !147, line: 166, type: !734)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "pipe_t", file: !147, line: 86, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pipe", file: !147, line: 71, size: 1216, elements: !736)
!736 = !{!737, !738, !739, !740, !741, !742, !743}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "pin", scope: !735, file: !147, line: 72, baseType: !23, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pout", scope: !735, file: !147, line: 73, baseType: !23, size: 32, offset: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "perr", scope: !735, file: !147, line: 74, baseType: !23, size: 32, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "cin", scope: !735, file: !147, line: 75, baseType: !23, size: 32, offset: 96)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "cout", scope: !735, file: !147, line: 76, baseType: !23, size: 32, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "cerr", scope: !735, file: !147, line: 77, baseType: !23, size: 32, offset: 160)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "error_set", scope: !735, file: !147, line: 78, baseType: !126, size: 1024, offset: 192)
!744 = !DILocation(line: 166, column: 10, scope: !726)
!745 = !DILocalVariable(name: "opt", scope: !726, file: !147, line: 161, type: !21)
!746 = !DILocalVariable(name: "opt_error", scope: !726, file: !147, line: 162, type: !23)
!747 = !DILocalVariable(name: "show_help", scope: !726, file: !147, line: 163, type: !23)
!748 = !DILocalVariable(name: "show_version", scope: !726, file: !147, line: 164, type: !23)
!749 = !DILocalVariable(name: "pid", scope: !726, file: !147, line: 165, type: !750)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !751, line: 100, baseType: !752)
!751 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !34, line: 145, baseType: !23)
!753 = !DILocation(line: 169, column: 25, scope: !754)
!754 = distinct !DILexicalBlock(scope: !726, file: !147, line: 170, column: 3)
!755 = !DILocation(line: 169, column: 18, scope: !754)
!756 = !DILocation(line: 169, column: 16, scope: !754)
!757 = !DILocation(line: 172, column: 3, scope: !758)
!758 = distinct !DILexicalBlock(scope: !754, file: !147, line: 170, column: 3)
!759 = !DILocation(line: 163, column: 13, scope: !754)
!760 = !DILocation(line: 164, column: 13, scope: !754)
!761 = !DILocation(line: 165, column: 16, scope: !754)
!762 = !DILocation(line: 172, column: 13, scope: !758)
!763 = !DILocation(line: 174, column: 11, scope: !764)
!764 = distinct !DILexicalBlock(scope: !765, file: !147, line: 174, column: 5)
!765 = distinct !DILexicalBlock(scope: !758, file: !147, line: 172, column: 13)
!766 = !DILocalVariable(name: "tmp", scope: !726, file: !147, line: 167, type: !23)
!767 = !DILocation(line: 177, column: 9, scope: !768)
!768 = distinct !DILexicalBlock(scope: !765, file: !147, line: 177, column: 9)
!769 = !DILocation(line: 177, column: 19, scope: !768)
!770 = !DILocation(line: 177, column: 9, scope: !765)
!771 = !DILocation(line: 178, column: 7, scope: !772)
!772 = distinct !DILexicalBlock(scope: !768, file: !147, line: 177, column: 26)
!773 = !DILocation(line: 182, column: 9, scope: !774)
!774 = distinct !DILexicalBlock(scope: !775, file: !147, line: 182, column: 9)
!775 = distinct !DILexicalBlock(scope: !765, file: !147, line: 180, column: 5)
!776 = !DILocation(line: 182, column: 19, scope: !774)
!777 = !DILocation(line: 182, column: 9, scope: !775)
!778 = !DILocation(line: 182, column: 7, scope: !779)
!779 = distinct !DILexicalBlock(scope: !774, file: !147, line: 182, column: 26)
!780 = !DILocation(line: 185, column: 9, scope: !781)
!781 = distinct !DILexicalBlock(scope: !775, file: !147, line: 185, column: 9)
!782 = !DILocation(line: 185, column: 19, scope: !781)
!783 = !DILocation(line: 185, column: 9, scope: !775)
!784 = !DILocation(line: 185, column: 7, scope: !785)
!785 = distinct !DILexicalBlock(scope: !781, file: !147, line: 185, column: 26)
!786 = !DILocation(line: 188, column: 9, scope: !787)
!787 = distinct !DILexicalBlock(scope: !775, file: !147, line: 188, column: 9)
!788 = !DILocation(line: 188, column: 19, scope: !787)
!789 = !DILocation(line: 188, column: 9, scope: !775)
!790 = !DILocation(line: 188, column: 7, scope: !791)
!791 = distinct !DILexicalBlock(scope: !787, file: !147, line: 188, column: 26)
!792 = !DILocation(line: 191, column: 9, scope: !793)
!793 = distinct !DILexicalBlock(scope: !775, file: !147, line: 191, column: 9)
!794 = !DILocation(line: 191, column: 19, scope: !793)
!795 = !DILocation(line: 191, column: 9, scope: !775)
!796 = !DILocation(line: 191, column: 7, scope: !797)
!797 = distinct !DILexicalBlock(scope: !793, file: !147, line: 191, column: 27)
!798 = !DILocation(line: 197, column: 9, scope: !799)
!799 = distinct !DILexicalBlock(scope: !775, file: !147, line: 197, column: 9)
!800 = !DILocation(line: 197, column: 19, scope: !799)
!801 = !DILocation(line: 197, column: 9, scope: !775)
!802 = !DILocation(line: 197, column: 7, scope: !803)
!803 = distinct !DILexicalBlock(scope: !799, file: !147, line: 197, column: 27)
!804 = !DILocation(line: 200, column: 9, scope: !805)
!805 = distinct !DILexicalBlock(scope: !775, file: !147, line: 200, column: 9)
!806 = !DILocation(line: 200, column: 19, scope: !805)
!807 = !DILocation(line: 200, column: 9, scope: !775)
!808 = !DILocation(line: 200, column: 7, scope: !809)
!809 = distinct !DILexicalBlock(scope: !805, file: !147, line: 200, column: 27)
!810 = !DILocation(line: 206, column: 9, scope: !811)
!811 = distinct !DILexicalBlock(scope: !775, file: !147, line: 206, column: 9)
!812 = !DILocation(line: 206, column: 19, scope: !811)
!813 = !DILocation(line: 206, column: 9, scope: !775)
!814 = !DILocation(line: 206, column: 7, scope: !815)
!815 = distinct !DILexicalBlock(scope: !811, file: !147, line: 206, column: 27)
!816 = !DILocation(line: 208, column: 9, scope: !817)
!817 = distinct !DILexicalBlock(scope: !775, file: !147, line: 208, column: 9)
!818 = !DILocation(line: 208, column: 19, scope: !817)
!819 = !DILocation(line: 208, column: 9, scope: !775)
!820 = !DILocation(line: 208, column: 7, scope: !821)
!821 = distinct !DILexicalBlock(scope: !817, file: !147, line: 208, column: 27)
!822 = !DILocation(line: 211, column: 9, scope: !823)
!823 = distinct !DILexicalBlock(scope: !775, file: !147, line: 211, column: 9)
!824 = !DILocation(line: 211, column: 19, scope: !823)
!825 = !DILocation(line: 211, column: 9, scope: !775)
!826 = !DILocation(line: 211, column: 7, scope: !827)
!827 = distinct !DILexicalBlock(scope: !823, file: !147, line: 211, column: 27)
!828 = !DILocation(line: 214, column: 9, scope: !829)
!829 = distinct !DILexicalBlock(scope: !775, file: !147, line: 214, column: 9)
!830 = !DILocation(line: 214, column: 19, scope: !829)
!831 = !DILocation(line: 214, column: 9, scope: !775)
!832 = !DILocation(line: 214, column: 7, scope: !833)
!833 = distinct !DILexicalBlock(scope: !829, file: !147, line: 214, column: 27)
!834 = !DILocation(line: 216, column: 9, scope: !835)
!835 = distinct !DILexicalBlock(scope: !775, file: !147, line: 216, column: 9)
!836 = !DILocation(line: 216, column: 19, scope: !835)
!837 = !DILocation(line: 216, column: 9, scope: !775)
!838 = !DILocation(line: 216, column: 7, scope: !839)
!839 = distinct !DILexicalBlock(scope: !835, file: !147, line: 216, column: 27)
!840 = !DILocation(line: 219, column: 9, scope: !841)
!841 = distinct !DILexicalBlock(scope: !775, file: !147, line: 219, column: 9)
!842 = !DILocation(line: 219, column: 19, scope: !841)
!843 = !DILocation(line: 219, column: 9, scope: !775)
!844 = !DILocation(line: 219, column: 7, scope: !845)
!845 = distinct !DILexicalBlock(scope: !841, file: !147, line: 219, column: 27)
!846 = !DILocation(line: 221, column: 5, scope: !775)
!847 = !DILocation(line: 183, column: 25, scope: !775)
!848 = !DILocation(line: 184, column: 5, scope: !775)
!849 = !DILocation(line: 187, column: 5, scope: !775)
!850 = !DILocation(line: 189, column: 13, scope: !775)
!851 = !DILocation(line: 190, column: 5, scope: !775)
!852 = !DILocation(line: 192, column: 25, scope: !853)
!853 = distinct !DILexicalBlock(scope: !775, file: !147, line: 192, column: 9)
!854 = !DILocation(line: 192, column: 9, scope: !853)
!855 = !DILocation(line: 192, column: 32, scope: !853)
!856 = !DILocation(line: 192, column: 9, scope: !775)
!857 = !DILocation(line: 193, column: 44, scope: !858)
!858 = distinct !DILexicalBlock(scope: !859, file: !147, line: 193, column: 7)
!859 = distinct !DILexicalBlock(scope: !853, file: !147, line: 192, column: 64)
!860 = !DILocation(line: 193, column: 20, scope: !858)
!861 = !DILocation(line: 193, column: 18, scope: !858)
!862 = !DILocation(line: 195, column: 5, scope: !859)
!863 = !DILocation(line: 195, column: 7, scope: !864)
!864 = distinct !DILexicalBlock(scope: !865, file: !147, line: 196, column: 7)
!865 = distinct !DILexicalBlock(scope: !853, file: !147, line: 195, column: 12)
!866 = !DILocation(line: 196, column: 5, scope: !775)
!867 = !DILocation(line: 199, column: 5, scope: !775)
!868 = !DILocation(line: 201, column: 25, scope: !869)
!869 = distinct !DILexicalBlock(scope: !775, file: !147, line: 201, column: 9)
!870 = !DILocation(line: 201, column: 9, scope: !869)
!871 = !DILocation(line: 201, column: 32, scope: !869)
!872 = !DILocation(line: 201, column: 9, scope: !775)
!873 = !DILocation(line: 202, column: 45, scope: !874)
!874 = distinct !DILexicalBlock(scope: !875, file: !147, line: 202, column: 7)
!875 = distinct !DILexicalBlock(scope: !869, file: !147, line: 201, column: 64)
!876 = !DILocation(line: 202, column: 21, scope: !874)
!877 = !DILocation(line: 202, column: 19, scope: !874)
!878 = !DILocation(line: 204, column: 5, scope: !875)
!879 = !DILocation(line: 204, column: 7, scope: !880)
!880 = distinct !DILexicalBlock(scope: !881, file: !147, line: 205, column: 7)
!881 = distinct !DILexicalBlock(scope: !869, file: !147, line: 204, column: 12)
!882 = !DILocation(line: 205, column: 5, scope: !775)
!883 = !DILocation(line: 207, column: 5, scope: !775)
!884 = !DILocation(line: 209, column: 18, scope: !775)
!885 = !DILocation(line: 210, column: 5, scope: !775)
!886 = !DILocation(line: 212, column: 22, scope: !775)
!887 = !DILocation(line: 213, column: 5, scope: !775)
!888 = !DILocation(line: 215, column: 5, scope: !775)
!889 = !DILocation(line: 217, column: 13, scope: !775)
!890 = !DILocation(line: 218, column: 5, scope: !775)
!891 = !DILocation(line: 220, column: 5, scope: !775)
!892 = !DILocation(line: 223, column: 5, scope: !775)
!893 = !DILocation(line: 0, scope: !754)
!894 = distinct !{!894, !757, !895}
!895 = !DILocation(line: 226, column: 3, scope: !758)
!896 = !DILocation(line: 227, column: 7, scope: !897)
!897 = distinct !DILexicalBlock(scope: !754, file: !147, line: 227, column: 7)
!898 = !DILocation(line: 227, column: 7, scope: !754)
!899 = !DILocation(line: 230, column: 12, scope: !900)
!900 = distinct !DILexicalBlock(scope: !901, file: !147, line: 228, column: 5)
!901 = distinct !DILexicalBlock(scope: !897, file: !147, line: 227, column: 18)
!902 = !DILocation(line: 229, column: 5, scope: !900)
!903 = !DILocation(line: 230, column: 5, scope: !900)
!904 = !DILocation(line: 233, column: 7, scope: !905)
!905 = distinct !DILexicalBlock(scope: !754, file: !147, line: 233, column: 7)
!906 = !DILocation(line: 233, column: 7, scope: !754)
!907 = !DILocation(line: 235, column: 5, scope: !908)
!908 = distinct !DILexicalBlock(scope: !909, file: !147, line: 234, column: 5)
!909 = distinct !DILexicalBlock(scope: !905, file: !147, line: 233, column: 21)
!910 = !DILocation(line: 237, column: 11, scope: !911)
!911 = distinct !DILexicalBlock(scope: !909, file: !147, line: 237, column: 9)
!912 = !DILocation(line: 237, column: 9, scope: !909)
!913 = !DILocation(line: 238, column: 7, scope: !914)
!914 = distinct !DILexicalBlock(scope: !915, file: !147, line: 238, column: 7)
!915 = distinct !DILexicalBlock(scope: !911, file: !147, line: 237, column: 22)
!916 = !DILocation(line: 241, column: 3, scope: !909)
!917 = !DILocation(line: 241, column: 7, scope: !918)
!918 = distinct !DILexicalBlock(scope: !754, file: !147, line: 241, column: 7)
!919 = !DILocation(line: 241, column: 7, scope: !754)
!920 = !DILocation(line: 243, column: 82, scope: !921)
!921 = distinct !DILexicalBlock(scope: !922, file: !147, line: 242, column: 5)
!922 = distinct !DILexicalBlock(scope: !918, file: !147, line: 241, column: 18)
!923 = !DILocation(line: 243, column: 5, scope: !921)
!924 = !DILocation(line: 245, column: 36, scope: !921)
!925 = !DILocation(line: 244, column: 5, scope: !921)
!926 = !DILocation(line: 258, column: 5, scope: !921)
!927 = !DILocation(line: 261, column: 9, scope: !928)
!928 = distinct !DILexicalBlock(scope: !754, file: !147, line: 261, column: 7)
!929 = !DILocation(line: 261, column: 7, scope: !754)
!930 = !DILocation(line: 262, column: 19, scope: !931)
!931 = distinct !DILexicalBlock(scope: !932, file: !147, line: 262, column: 5)
!932 = distinct !DILexicalBlock(scope: !928, file: !147, line: 261, column: 22)
!933 = !DILocation(line: 262, column: 17, scope: !931)
!934 = !DILocation(line: 264, column: 3, scope: !932)
!935 = !DILocation(line: 264, column: 3, scope: !936)
!936 = distinct !DILexicalBlock(scope: !754, file: !147, line: 265, column: 3)
!937 = !DILocation(line: 266, column: 9, scope: !936)
!938 = !DILocation(line: 270, column: 11, scope: !939)
!939 = distinct !DILexicalBlock(scope: !754, file: !147, line: 270, column: 7)
!940 = !DILocation(line: 270, column: 7, scope: !754)
!941 = !DILocation(line: 271, column: 15, scope: !942)
!942 = distinct !DILexicalBlock(scope: !943, file: !147, line: 271, column: 5)
!943 = distinct !DILexicalBlock(scope: !939, file: !147, line: 270, column: 16)
!944 = !DILocalVariable(name: "tmp___0", scope: !726, file: !147, line: 168, type: !71)
!945 = !DILocation(line: 271, column: 18, scope: !942)
!946 = !DILocation(line: 271, column: 5, scope: !942)
!947 = !DILocation(line: 273, column: 3, scope: !943)
!948 = !DILocation(line: 272, column: 11, scope: !949)
!949 = distinct !DILexicalBlock(scope: !939, file: !147, line: 272, column: 7)
!950 = !DILocation(line: 272, column: 7, scope: !939)
!951 = !DILocation(line: 273, column: 5, scope: !952)
!952 = distinct !DILexicalBlock(scope: !953, file: !147, line: 273, column: 5)
!953 = distinct !DILexicalBlock(scope: !949, file: !147, line: 272, column: 16)
!954 = !DILocation(line: 275, column: 3, scope: !953)
!955 = !DILocation(line: 275, column: 5, scope: !956)
!956 = distinct !DILexicalBlock(scope: !957, file: !147, line: 276, column: 5)
!957 = distinct !DILexicalBlock(scope: !949, file: !147, line: 275, column: 10)
!958 = !DILocation(line: 277, column: 3, scope: !959)
!959 = distinct !DILexicalBlock(scope: !754, file: !147, line: 278, column: 3)
!960 = !DILocation(line: 280, column: 1, scope: !726)
!961 = distinct !DISubprogram(name: "xstrdup", scope: !147, file: !147, line: 716, type: !962, scopeLine: 717, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !192)
!962 = !DISubroutineType(types: !963)
!963 = !{!20, !26}
!964 = !DILocalVariable(name: "str", arg: 1, scope: !961, file: !147, line: 716, type: !26)
!965 = !DILocation(line: 0, scope: !961)
!966 = !DILocation(line: 719, column: 9, scope: !967)
!967 = distinct !DILexicalBlock(scope: !968, file: !147, line: 724, column: 3)
!968 = distinct !DILexicalBlock(scope: !961, file: !147, line: 723, column: 3)
!969 = !DILocalVariable(name: "tmp", scope: !961, file: !147, line: 719, type: !13)
!970 = !DILocation(line: 719, column: 13, scope: !967)
!971 = !DILocalVariable(name: "len", scope: !961, file: !147, line: 718, type: !13)
!972 = !DILocation(line: 720, column: 13, scope: !967)
!973 = !DILocalVariable(name: "tmp___0", scope: !961, file: !147, line: 721, type: !25)
!974 = !DILocalVariable(name: "new", scope: !961, file: !147, line: 720, type: !25)
!975 = !DILocation(line: 722, column: 3, scope: !967)
!976 = !DILocation(line: 724, column: 3, scope: !968)
!977 = distinct !DISubprogram(name: "error___0", scope: !147, file: !147, line: 664, type: !978, scopeLine: 665, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !192)
!978 = !DISubroutineType(types: !979)
!979 = !{null, !23, !23, !26, null}
!980 = !DILocalVariable(name: "status", arg: 1, scope: !977, file: !147, line: 664, type: !23)
!981 = !DILocation(line: 0, scope: !977)
!982 = !DILocalVariable(name: "errnum", arg: 2, scope: !977, file: !147, line: 664, type: !23)
!983 = !DILocalVariable(name: "message", arg: 3, scope: !977, file: !147, line: 664, type: !26)
!984 = !DILocalVariable(name: "args", scope: !977, file: !147, line: 666, type: !985)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !986, line: 105, baseType: !987)
!986 = !DIFile(filename: "/usr/lib/gcc-lib/i486-linux/3.3.5/include/stdarg.h", directory: "")
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !986, line: 43, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 286, baseType: !989)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 192, elements: !107)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 286, size: 192, elements: !991)
!991 = !{!992, !993, !994, !995}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !990, file: !3, line: 286, baseType: !7, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !990, file: !3, line: 286, baseType: !7, size: 32, offset: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !990, file: !3, line: 286, baseType: !25, size: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !990, file: !3, line: 286, baseType: !25, size: 64, offset: 128)
!996 = !DILocation(line: 666, column: 11, scope: !977)
!997 = !DILocation(line: 669, column: 10, scope: !998)
!998 = distinct !DILexicalBlock(scope: !999, file: !147, line: 670, column: 3)
!999 = distinct !DILexicalBlock(scope: !977, file: !147, line: 669, column: 3)
!1000 = !DILocation(line: 669, column: 3, scope: !998)
!1001 = !DILocation(line: 670, column: 36, scope: !998)
!1002 = !DILocation(line: 671, column: 11, scope: !998)
!1003 = !DILocation(line: 670, column: 3, scope: !998)
!1004 = !DILocation(line: 672, column: 3, scope: !998)
!1005 = !DILocation(line: 673, column: 37, scope: !998)
!1006 = !DILocation(line: 674, column: 12, scope: !998)
!1007 = !DILocation(line: 673, column: 3, scope: !998)
!1008 = !DILocation(line: 674, column: 3, scope: !998)
!1009 = !DILocation(line: 676, column: 7, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !999, file: !147, line: 676, column: 7)
!1011 = !DILocation(line: 676, column: 7, scope: !999)
!1012 = !DILocation(line: 677, column: 11, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !147, line: 677, column: 5)
!1014 = distinct !DILexicalBlock(scope: !1010, file: !147, line: 676, column: 15)
!1015 = !DILocalVariable(name: "tmp", scope: !977, file: !147, line: 667, type: !20)
!1016 = !DILocation(line: 677, column: 38, scope: !1013)
!1017 = !DILocation(line: 677, column: 5, scope: !1013)
!1018 = !DILocation(line: 680, column: 3, scope: !1014)
!1019 = !DILocation(line: 678, column: 18, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !999, file: !147, line: 681, column: 3)
!1021 = !DILocation(line: 678, column: 3, scope: !1020)
!1022 = !DILocation(line: 679, column: 10, scope: !1020)
!1023 = !DILocation(line: 679, column: 3, scope: !1020)
!1024 = !DILocation(line: 680, column: 7, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !999, file: !147, line: 680, column: 7)
!1026 = !DILocation(line: 680, column: 7, scope: !999)
!1027 = !DILocation(line: 681, column: 5, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !147, line: 681, column: 5)
!1029 = distinct !DILexicalBlock(scope: !1025, file: !147, line: 680, column: 15)
!1030 = !DILocation(line: 682, column: 3, scope: !999)
!1031 = distinct !DISubprogram(name: "find_ispell", scope: !147, file: !147, line: 284, type: !1032, scopeLine: 285, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !192)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!20}
!1034 = !DILocalVariable(name: "stat_buf", scope: !1031, file: !147, line: 292, type: !29)
!1035 = !DILocation(line: 292, column: 15, scope: !1031)
!1036 = !DILocalVariable(name: "ispell", scope: !1031, file: !147, line: 286, type: !20)
!1037 = !DILocation(line: 0, scope: !1031)
!1038 = !DILocalVariable(name: "path", scope: !1031, file: !147, line: 287, type: !20)
!1039 = !DILocalVariable(name: "path_len", scope: !1031, file: !147, line: 288, type: !23)
!1040 = !DILocalVariable(name: "pos", scope: !1031, file: !147, line: 289, type: !23)
!1041 = !DILocation(line: 291, column: 9, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !147, line: 302, column: 3)
!1043 = distinct !DILexicalBlock(scope: !1031, file: !147, line: 301, column: 3)
!1044 = !DILocalVariable(name: "tmp", scope: !1031, file: !147, line: 291, type: !15)
!1045 = !DILocalVariable(name: "file", scope: !1031, file: !147, line: 290, type: !15)
!1046 = !DILocation(line: 294, column: 13, scope: !1042)
!1047 = !DILocalVariable(name: "tmp___0", scope: !1031, file: !147, line: 293, type: !20)
!1048 = !DILocation(line: 294, column: 10, scope: !1042)
!1049 = !DILocation(line: 295, column: 13, scope: !1042)
!1050 = !DILocalVariable(name: "tmp___1", scope: !1031, file: !147, line: 294, type: !13)
!1051 = !DILocation(line: 296, column: 3, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1043, file: !147, line: 297, column: 3)
