; ModuleID = '/tmp/tmp.ll'
source_filename = "c/stripcc-0.2.0.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.ringbuf_t = type { i8*, i32, i32, i32 }
%struct.list_t = type { %struct.list_t*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.cc_used_t = type { i32, %struct.list_t* }
%struct.logiline_t = type { i8*, i64, i64, i64, [1024 x i64] }
%union.__anonunion_52 = type { i32 }
%union.__anonunion_53 = type { i32 }
%union.wait = type { i32 }
%union.__anonunion_54 = type { i32 }
%union.__anonunion_55 = type { i32 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }

@.str = private unnamed_addr constant [5 x i8] c"make\00", align 1
@.str.1 = private unnamed_addr constant [9 x i8] c"c:m:fnvh\00", align 1
@optind = external global i32, align 4
@optarg = external global i8*, align 8
@.str.2 = private unnamed_addr constant [62 x i8] c"\1B[32mo \1B[0mGetting a list of files which will be stripped...\0A\00", align 1

!0 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"PIC Level", i32 2}
!5 = distinct !DICompileUnit(language: DW_LANG_C99, file: !6, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !18, nameTableKind: GNU)
!6 = !DIFile(filename: "c/stripcc-0.2.0.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!7 = !{!8}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__anonenum_cur_section_51", file: !9, line: 285, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "/home/wslee/tests/SOURCES/stripcc-0.2.0/stripcc.c", directory: "")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17}
!12 = !DIEnumerator(name: "none", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "strip_exts", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "strip_dirs", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "strip_files", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "dont_strip_dirs", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "dont_strip_files", value: 5, isUnsigned: true)
!18 = !{!19, !30, !31, !32, !24, !34, !27, !36, !38, !44, !46, !52, !8, !87, !25, !10, !140, !143, !154, !159, !51, !160}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ringbuf_t", file: !21, line: 25, size: 192, elements: !22)
!21 = !DIFile(filename: "/home/wslee/tests/SOURCES/stripcc-0.2.0/ringbuf.h", directory: "")
!22 = !{!23, !26, !28, !29}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !20, file: !21, line: 26, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !20, file: !21, line: 27, baseType: !27, size: 32, offset: 64)
!27 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !20, file: !21, line: 28, baseType: !27, size: 32, offset: 96)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "writed", scope: !20, file: !21, line: 29, baseType: !27, size: 32, offset: 128)
!30 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !33, line: 211, baseType: !30)
!33 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/4.4.3/include/stddef.h", directory: "")
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_t", file: !40, line: 25, size: 128, elements: !41)
!40 = !DIFile(filename: "/home/wslee/tests/SOURCES/stripcc-0.2.0/list.h", directory: "")
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !39, file: !40, line: 26, baseType: !38, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !39, file: !40, line: 27, baseType: !31, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !48, line: 76, baseType: !49)
!48 = !DIFile(filename: "/usr/include/time.h", directory: "")
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !50, line: 149, baseType: !51)
!50 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!51 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !54, line: 43, size: 1152, elements: !55)
!54 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!55 = !{!56, !58, !60, !62, !64, !66, !68, !69, !70, !72, !74, !76, !81, !82, !83}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !53, file: !54, line: 44, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !50, line: 134, baseType: !30)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !53, file: !54, line: 45, baseType: !59, size: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !50, line: 137, baseType: !30)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !53, file: !54, line: 46, baseType: !61, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !50, line: 140, baseType: !30)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !53, file: !54, line: 47, baseType: !63, size: 32, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !50, line: 139, baseType: !10)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !53, file: !54, line: 48, baseType: !65, size: 32, offset: 224)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !50, line: 135, baseType: !10)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !53, file: !54, line: 49, baseType: !67, size: 32, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !50, line: 136, baseType: !10)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !53, file: !54, line: 50, baseType: !27, size: 32, offset: 288)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !53, file: !54, line: 51, baseType: !57, size: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !53, file: !54, line: 52, baseType: !71, size: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !50, line: 141, baseType: !51)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !53, file: !54, line: 53, baseType: !73, size: 64, offset: 448)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !50, line: 164, baseType: !51)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !53, file: !54, line: 54, baseType: !75, size: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !50, line: 169, baseType: !51)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !53, file: !54, line: 55, baseType: !77, size: 128, offset: 576)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !48, line: 120, size: 128, elements: !78)
!78 = !{!79, !80}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !77, file: !48, line: 121, baseType: !49, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !77, file: !48, line: 122, baseType: !51, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !53, file: !54, line: 56, baseType: !77, size: 128, offset: 704)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !53, file: !54, line: 57, baseType: !77, size: 128, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !53, file: !54, line: 58, baseType: !84, size: 192, offset: 960)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 192, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 3)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !89, line: 49, baseType: !90)
!89 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !91, line: 271, size: 1728, elements: !92)
!91 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!92 = !{!93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !113, !114, !115, !116, !117, !119, !121, !125, !128, !130, !131, !132, !133, !134, !135, !136}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !90, file: !91, line: 272, baseType: !27, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !90, file: !91, line: 273, baseType: !24, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !90, file: !91, line: 274, baseType: !24, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !90, file: !91, line: 275, baseType: !24, size: 64, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !90, file: !91, line: 276, baseType: !24, size: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !90, file: !91, line: 277, baseType: !24, size: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !90, file: !91, line: 278, baseType: !24, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !90, file: !91, line: 279, baseType: !24, size: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !90, file: !91, line: 280, baseType: !24, size: 64, offset: 512)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !90, file: !91, line: 281, baseType: !24, size: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !90, file: !91, line: 282, baseType: !24, size: 64, offset: 640)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !90, file: !91, line: 283, baseType: !24, size: 64, offset: 704)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !90, file: !91, line: 284, baseType: !106, size: 64, offset: 768)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !91, line: 186, size: 192, elements: !108)
!108 = !{!109, !110, !112}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !107, file: !91, line: 187, baseType: !106, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !107, file: !91, line: 188, baseType: !111, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !107, file: !91, line: 189, baseType: !27, size: 32, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !90, file: !91, line: 285, baseType: !111, size: 64, offset: 832)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !90, file: !91, line: 286, baseType: !27, size: 32, offset: 896)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !90, file: !91, line: 287, baseType: !27, size: 32, offset: 928)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !90, file: !91, line: 288, baseType: !71, size: 64, offset: 960)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !90, file: !91, line: 289, baseType: !118, size: 16, offset: 1024)
!118 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !90, file: !91, line: 290, baseType: !120, size: 8, offset: 1040)
!120 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !90, file: !91, line: 291, baseType: !122, size: 8, offset: 1048)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 1)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !90, file: !91, line: 292, baseType: !126, size: 64, offset: 1088)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !91, line: 180, baseType: null)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !90, file: !91, line: 293, baseType: !129, size: 64, offset: 1152)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !50, line: 142, baseType: !51)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !90, file: !91, line: 294, baseType: !31, size: 64, offset: 1216)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !90, file: !91, line: 295, baseType: !31, size: 64, offset: 1280)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !90, file: !91, line: 296, baseType: !31, size: 64, offset: 1344)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !90, file: !91, line: 297, baseType: !31, size: 64, offset: 1408)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !90, file: !91, line: 298, baseType: !32, size: 64, offset: 1472)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !90, file: !91, line: 299, baseType: !27, size: 32, offset: 1536)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !90, file: !91, line: 300, baseType: !137, size: 160, offset: 1568)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 160, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 20)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!27, !36, !36}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "logiline_t", file: !9, line: 407, size: 65792, elements: !145)
!145 = !{!146, !147, !148, !149, !150}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "linebuf", scope: !144, file: !9, line: 408, baseType: !24, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "linebuf_size", scope: !144, file: !9, line: 409, baseType: !32, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "linebuf_idx", scope: !144, file: !9, line: 410, baseType: !32, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "phyline_count", scope: !144, file: !9, line: 411, baseType: !32, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "phyline_idx", scope: !144, file: !9, line: 412, baseType: !151, size: 65536, offset: 256)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 65536, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 1024)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cc_used_t", file: !9, line: 1250, size: 128, elements: !156)
!156 = !{!157, !158}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !155, file: !9, line: 1251, baseType: !27, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "used_branch", scope: !155, file: !9, line: 1252, baseType: !38, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "wait", file: !162, line: 67, size: 32, elements: !163)
!162 = !DIFile(filename: "/usr/include/bits/waitstatus.h", directory: "")
!163 = !{!164, !165, !171}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "w_status", scope: !161, file: !162, line: 68, baseType: !27, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__wait_terminated", scope: !161, file: !162, line: 69, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct___wait_terminated_48", file: !162, line: 67, size: 32, elements: !167)
!167 = !{!168, !169, !170}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__w_termsig", scope: !166, file: !162, line: 68, baseType: !10, size: 7, flags: DIFlagBitField, extraData: i64 0)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__w_coredump", scope: !166, file: !162, line: 69, baseType: !10, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__w_retcode", scope: !166, file: !162, line: 70, baseType: !10, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__wait_stopped", scope: !161, file: !162, line: 70, baseType: !172, size: 32)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct___wait_stopped_49", file: !162, line: 67, size: 32, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__w_stopval", scope: !172, file: !162, line: 68, baseType: !10, size: 8, flags: DIFlagBitField, extraData: i64 0)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__w_stopsig", scope: !172, file: !162, line: 69, baseType: !10, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!176 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!177 = distinct !DISubprogram(name: "ringbuf_new", scope: !178, file: !178, line: 29, type: !179, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, retainedNodes: !181)
!178 = !DIFile(filename: "/home/wslee/tests/SOURCES/stripcc-0.2.0/ringbuf.c", directory: "")
!179 = !DISubroutineType(types: !180)
!180 = !{!19, !27}
!181 = !{}
!182 = !DILocalVariable(name: "capacity", arg: 1, scope: !177, file: !178, line: 29, type: !27)
!183 = !DILocation(line: 0, scope: !177)
!184 = !DILocation(line: 34, column: 9, scope: !185)
!185 = distinct !DILexicalBlock(scope: !186, file: !178, line: 37, column: 3)
!186 = distinct !DILexicalBlock(scope: !187, file: !178, line: 36, column: 3)
!187 = distinct !DILexicalBlock(scope: !177, file: !178, line: 35, column: 3)
!188 = !DILocalVariable(name: "tmp", scope: !177, file: !178, line: 32, type: !31)
!189 = !DILocation(line: 34, column: 9, scope: !186)
!190 = !DILocalVariable(name: "ret", scope: !177, file: !178, line: 31, type: !19)
!191 = !DILocation(line: 35, column: 7, scope: !192)
!192 = distinct !DILexicalBlock(scope: !187, file: !178, line: 35, column: 7)
!193 = !DILocation(line: 35, column: 27, scope: !192)
!194 = !DILocation(line: 35, column: 7, scope: !187)
!195 = !DILocation(line: 36, column: 5, scope: !196)
!196 = distinct !DILexicalBlock(scope: !192, file: !178, line: 35, column: 59)
!197 = !DILocation(line: 37, column: 20, scope: !198)
!198 = distinct !DILexicalBlock(scope: !199, file: !178, line: 39, column: 3)
!199 = distinct !DILexicalBlock(scope: !187, file: !178, line: 38, column: 3)
!200 = !DILocation(line: 37, column: 13, scope: !198)
!201 = !DILocalVariable(name: "tmp___0", scope: !177, file: !178, line: 33, type: !31)
!202 = !DILocation(line: 37, column: 8, scope: !199)
!203 = !DILocation(line: 37, column: 12, scope: !199)
!204 = !DILocation(line: 38, column: 28, scope: !205)
!205 = distinct !DILexicalBlock(scope: !187, file: !178, line: 38, column: 7)
!206 = !DILocation(line: 38, column: 7, scope: !205)
!207 = !DILocation(line: 38, column: 32, scope: !205)
!208 = !DILocation(line: 38, column: 7, scope: !187)
!209 = !DILocation(line: 39, column: 10, scope: !210)
!210 = distinct !DILexicalBlock(scope: !211, file: !178, line: 40, column: 5)
!211 = distinct !DILexicalBlock(scope: !212, file: !178, line: 39, column: 5)
!212 = distinct !DILexicalBlock(scope: !205, file: !178, line: 38, column: 64)
!213 = !DILocation(line: 39, column: 5, scope: !210)
!214 = !DILocation(line: 40, column: 5, scope: !212)
!215 = !DILocation(line: 42, column: 8, scope: !187)
!216 = !DILocation(line: 42, column: 12, scope: !187)
!217 = !DILocation(line: 43, column: 8, scope: !187)
!218 = !DILocation(line: 43, column: 12, scope: !187)
!219 = !DILocation(line: 44, column: 8, scope: !187)
!220 = !DILocation(line: 44, column: 15, scope: !187)
!221 = !DILocation(line: 46, column: 3, scope: !187)
!222 = !DILocation(line: 0, scope: !187)
!223 = !DILocation(line: 48, column: 1, scope: !177)
!224 = distinct !DISubprogram(name: "ringbuf_clear", scope: !178, file: !178, line: 49, type: !225, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, retainedNodes: !181)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !19}
!227 = !DILocalVariable(name: "rbuf", arg: 1, scope: !224, file: !178, line: 49, type: !19)
!228 = !DILocation(line: 0, scope: !224)
!229 = !DILocation(line: 52, column: 9, scope: !230)
!230 = distinct !DILexicalBlock(scope: !224, file: !178, line: 53, column: 3)
!231 = !DILocation(line: 52, column: 13, scope: !230)
!232 = !DILocation(line: 53, column: 9, scope: !230)
!233 = !DILocation(line: 53, column: 16, scope: !230)
!234 = !DILocation(line: 54, column: 3, scope: !230)
!235 = distinct !DISubprogram(name: "ringbuf_write", scope: !178, file: !178, line: 56, type: !236, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, retainedNodes: !181)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !19, !36, !27}
!238 = !DILocalVariable(name: "rbuf", arg: 1, scope: !235, file: !178, line: 56, type: !19)
!239 = !DILocation(line: 0, scope: !235)
!240 = !DILocalVariable(name: "data", arg: 2, scope: !235, file: !178, line: 56, type: !36)
!241 = !DILocalVariable(name: "len", arg: 3, scope: !235, file: !178, line: 56, type: !27)
!242 = !DILocation(line: 61, column: 11, scope: !243)
!243 = distinct !DILexicalBlock(scope: !244, file: !178, line: 61, column: 7)
!244 = distinct !DILexicalBlock(scope: !235, file: !178, line: 61, column: 3)
!245 = !DILocation(line: 61, column: 7, scope: !244)
!246 = !DILocation(line: 63, column: 11, scope: !247)
!247 = distinct !DILexicalBlock(scope: !248, file: !178, line: 63, column: 5)
!248 = distinct !DILexicalBlock(scope: !249, file: !178, line: 62, column: 5)
!249 = distinct !DILexicalBlock(scope: !243, file: !178, line: 61, column: 18)
!250 = !DILocalVariable(name: "tmp", scope: !235, file: !178, line: 59, type: !32)
!251 = !DILocation(line: 63, column: 11, scope: !248)
!252 = !DILocation(line: 65, column: 3, scope: !249)
!253 = !DILocation(line: 65, column: 19, scope: !254)
!254 = distinct !DILexicalBlock(scope: !244, file: !178, line: 65, column: 7)
!255 = !DILocation(line: 65, column: 11, scope: !254)
!256 = !DILocation(line: 65, column: 7, scope: !244)
!257 = !DILocation(line: 67, column: 18, scope: !258)
!258 = distinct !DILexicalBlock(scope: !254, file: !178, line: 65, column: 24)
!259 = !DILocation(line: 67, column: 33, scope: !258)
!260 = !DILocation(line: 67, column: 25, scope: !258)
!261 = !DILocation(line: 68, column: 17, scope: !258)
!262 = !DILocation(line: 69, column: 3, scope: !258)
!263 = !DILocation(line: 0, scope: !244)
!264 = !DILocation(line: 70, column: 16, scope: !244)
!265 = !DILocation(line: 70, column: 28, scope: !244)
!266 = !DILocation(line: 70, column: 20, scope: !244)
!267 = !DILocalVariable(name: "rest", scope: !235, file: !178, line: 58, type: !27)
!268 = !DILocation(line: 71, column: 11, scope: !269)
!269 = distinct !DILexicalBlock(scope: !244, file: !178, line: 71, column: 7)
!270 = !DILocation(line: 71, column: 7, scope: !244)
!271 = !DILocation(line: 73, column: 44, scope: !272)
!272 = distinct !DILexicalBlock(scope: !273, file: !178, line: 73, column: 5)
!273 = distinct !DILexicalBlock(scope: !274, file: !178, line: 72, column: 5)
!274 = distinct !DILexicalBlock(scope: !269, file: !178, line: 71, column: 20)
!275 = !DILocation(line: 73, column: 56, scope: !272)
!276 = !DILocation(line: 73, column: 48, scope: !272)
!277 = !DILocation(line: 74, column: 12, scope: !272)
!278 = !DILocation(line: 73, column: 5, scope: !272)
!279 = !DILocation(line: 74, column: 11, scope: !273)
!280 = !DILocation(line: 74, column: 15, scope: !273)
!281 = !DILocation(line: 75, column: 11, scope: !273)
!282 = !DILocation(line: 75, column: 18, scope: !273)
!283 = !DILocation(line: 77, column: 10, scope: !273)
!284 = !DILocation(line: 78, column: 9, scope: !273)
!285 = !DILocation(line: 80, column: 3, scope: !274)
!286 = !DILocation(line: 80, column: 11, scope: !287)
!287 = distinct !DILexicalBlock(scope: !244, file: !178, line: 80, column: 7)
!288 = !DILocation(line: 80, column: 7, scope: !244)
!289 = !DILocation(line: 81, column: 44, scope: !290)
!290 = distinct !DILexicalBlock(scope: !291, file: !178, line: 82, column: 5)
!291 = distinct !DILexicalBlock(scope: !292, file: !178, line: 81, column: 5)
!292 = distinct !DILexicalBlock(scope: !287, file: !178, line: 80, column: 16)
!293 = !DILocation(line: 81, column: 56, scope: !290)
!294 = !DILocation(line: 81, column: 48, scope: !290)
!295 = !DILocation(line: 82, column: 12, scope: !290)
!296 = !DILocation(line: 81, column: 5, scope: !290)
!297 = !DILocation(line: 82, column: 11, scope: !291)
!298 = !DILocation(line: 82, column: 15, scope: !291)
!299 = !DILocation(line: 83, column: 11, scope: !291)
!300 = !DILocation(line: 83, column: 18, scope: !291)
!301 = !DILocation(line: 85, column: 3, scope: !292)
!302 = !DILocation(line: 85, column: 3, scope: !244)
!303 = distinct !DISubprogram(name: "ringbuf_read_last", scope: !178, file: !178, line: 87, type: !304, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, retainedNodes: !181)
!304 = !DISubroutineType(types: !305)
!305 = !{!27, !19, !31, !27}
!306 = !DILocalVariable(name: "rbuf", arg: 1, scope: !303, file: !178, line: 87, type: !19)
!307 = !DILocation(line: 0, scope: !303)
!308 = !DILocalVariable(name: "buf", arg: 2, scope: !303, file: !178, line: 87, type: !31)
!309 = !DILocalVariable(name: "len", arg: 3, scope: !303, file: !178, line: 87, type: !27)
!310 = !DILocation(line: 92, column: 13, scope: !311)
!311 = distinct !DILexicalBlock(scope: !312, file: !178, line: 92, column: 7)
!312 = distinct !DILexicalBlock(scope: !303, file: !178, line: 92, column: 3)
!313 = !DILocation(line: 92, column: 28, scope: !311)
!314 = !DILocation(line: 92, column: 20, scope: !311)
!315 = !DILocation(line: 92, column: 7, scope: !312)
!316 = !DILocation(line: 93, column: 21, scope: !317)
!317 = distinct !DILexicalBlock(scope: !311, file: !178, line: 92, column: 33)
!318 = !DILocalVariable(name: "ret_len", scope: !303, file: !178, line: 89, type: !27)
!319 = !DILocation(line: 94, column: 3, scope: !317)
!320 = !DILocation(line: 95, column: 21, scope: !321)
!321 = distinct !DILexicalBlock(scope: !311, file: !178, line: 94, column: 10)
!322 = !DILocation(line: 0, scope: !311)
!323 = !DILocation(line: 96, column: 15, scope: !324)
!324 = distinct !DILexicalBlock(scope: !312, file: !178, line: 96, column: 7)
!325 = !DILocation(line: 96, column: 7, scope: !312)
!326 = !DILocation(line: 98, column: 3, scope: !327)
!327 = distinct !DILexicalBlock(scope: !324, file: !178, line: 96, column: 22)
!328 = !DILocation(line: 0, scope: !312)
!329 = !DILocation(line: 99, column: 31, scope: !312)
!330 = !DILocation(line: 99, column: 23, scope: !312)
!331 = !DILocalVariable(name: "part1_len", scope: !303, file: !178, line: 90, type: !27)
!332 = !DILocation(line: 100, column: 17, scope: !333)
!333 = distinct !DILexicalBlock(scope: !312, file: !178, line: 100, column: 7)
!334 = !DILocation(line: 100, column: 7, scope: !312)
!335 = !DILocation(line: 101, column: 83, scope: !336)
!336 = distinct !DILexicalBlock(scope: !337, file: !178, line: 102, column: 5)
!337 = distinct !DILexicalBlock(scope: !338, file: !178, line: 101, column: 5)
!338 = distinct !DILexicalBlock(scope: !333, file: !178, line: 100, column: 22)
!339 = !DILocation(line: 101, column: 95, scope: !336)
!340 = !DILocation(line: 101, column: 87, scope: !336)
!341 = !DILocation(line: 101, column: 100, scope: !336)
!342 = !DILocation(line: 102, column: 12, scope: !336)
!343 = !DILocation(line: 101, column: 5, scope: !336)
!344 = !DILocation(line: 102, column: 9, scope: !337)
!345 = !DILocation(line: 103, column: 81, scope: !346)
!346 = distinct !DILexicalBlock(scope: !337, file: !178, line: 103, column: 5)
!347 = !DILocation(line: 104, column: 27, scope: !346)
!348 = !DILocation(line: 104, column: 12, scope: !346)
!349 = !DILocation(line: 103, column: 5, scope: !346)
!350 = !DILocation(line: 107, column: 3, scope: !338)
!351 = !DILocation(line: 105, column: 83, scope: !352)
!352 = distinct !DILexicalBlock(scope: !353, file: !178, line: 109, column: 5)
!353 = distinct !DILexicalBlock(scope: !354, file: !178, line: 108, column: 5)
!354 = distinct !DILexicalBlock(scope: !333, file: !178, line: 107, column: 10)
!355 = !DILocation(line: 105, column: 95, scope: !352)
!356 = !DILocation(line: 105, column: 87, scope: !352)
!357 = !DILocation(line: 105, column: 100, scope: !352)
!358 = !DILocation(line: 106, column: 12, scope: !352)
!359 = !DILocation(line: 105, column: 5, scope: !352)
!360 = !DILocation(line: 107, column: 3, scope: !312)
!361 = distinct !DISubprogram(name: "ringbuf_free", scope: !178, file: !178, line: 110, type: !225, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, retainedNodes: !181)
!362 = !DILocalVariable(name: "rbuf", arg: 1, scope: !361, file: !178, line: 110, type: !19)
!363 = !DILocation(line: 0, scope: !361)
!364 = !DILocation(line: 113, column: 22, scope: !365)
!365 = distinct !DILexicalBlock(scope: !366, file: !178, line: 116, column: 3)
!366 = distinct !DILexicalBlock(scope: !367, file: !178, line: 115, column: 3)
!367 = distinct !DILexicalBlock(scope: !361, file: !178, line: 114, column: 3)
!368 = !DILocation(line: 113, column: 3, scope: !365)
!369 = !DILocation(line: 114, column: 8, scope: !370)
!370 = distinct !DILexicalBlock(scope: !366, file: !178, line: 115, column: 3)
!371 = !DILocation(line: 114, column: 3, scope: !370)
!372 = !DILocation(line: 115, column: 3, scope: !367)
!373 = distinct !DISubprogram(name: "list_free", scope: !374, file: !374, line: 29, type: !375, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, retainedNodes: !181)
!374 = !DIFile(filename: "/home/wslee/tests/SOURCES/stripcc-0.2.0/list.c", directory: "")
!375 = !DISubroutineType(types: !376)
!376 = !{null, !38, !377}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !38}
!380 = !DILocalVariable(name: "list", arg: 1, scope: !373, file: !374, line: 29, type: !38)
!381 = !DILocation(line: 0, scope: !373)
!382 = !DILocalVariable(name: "nfree", arg: 2, scope: !373, file: !374, line: 29, type: !377)
!383 = !DILocalVariable(name: "tmp", scope: !373, file: !374, line: 31, type: !38)
!384 = !DILocation(line: 35, column: 3, scope: !385)
!385 = distinct !DILexicalBlock(scope: !386, file: !374, line: 36, column: 3)
!386 = distinct !DILexicalBlock(scope: !387, file: !374, line: 35, column: 3)
!387 = distinct !DILexicalBlock(scope: !373, file: !374, line: 33, column: 3)
!388 = !DILocation(line: 0, scope: !387)
!389 = !DILocation(line: 35, column: 13, scope: !385)
!390 = !DILocation(line: 35, column: 12, scope: !391)
!391 = distinct !DILexicalBlock(scope: !392, file: !374, line: 35, column: 9)
!392 = distinct !DILexicalBlock(scope: !385, file: !374, line: 35, column: 13)
!393 = !DILocation(line: 35, column: 32, scope: !391)
!394 = !DILocation(line: 35, column: 9, scope: !392)
!395 = !DILocation(line: 35, column: 7, scope: !396)
!396 = distinct !DILexicalBlock(scope: !391, file: !374, line: 35, column: 65)
!397 = !DILocation(line: 36, column: 18, scope: !398)
!398 = distinct !DILexicalBlock(scope: !392, file: !374, line: 37, column: 5)
!399 = !DILocation(line: 38, column: 5, scope: !400)
!400 = distinct !DILexicalBlock(scope: !398, file: !374, line: 37, column: 5)
!401 = distinct !{!401, !384, !402}
!402 = !DILocation(line: 42, column: 3, scope: !385)
!403 = !DILocation(line: 44, column: 3, scope: !385)
!404 = !DILocation(line: 42, column: 3, scope: !387)
!405 = distinct !DISubprogram(name: "sorted_list_insert_item", scope: !374, file: !374, line: 44, type: !406, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, retainedNodes: !181)
!406 = !DISubroutineType(types: !407)
!407 = !{!38, !38, !38, !140}
!408 = !DILocalVariable(name: "list", arg: 1, scope: !405, file: !374, line: 44, type: !38)
!409 = !DILocation(line: 0, scope: !405)
!410 = !DILocalVariable(name: "item", arg: 2, scope: !405, file: !374, line: 44, type: !38)
!411 = !DILocalVariable(name: "dcmp", arg: 3, scope: !405, file: !374, line: 45, type: !140)
!412 = !DILocation(line: 50, column: 7, scope: !413)
!413 = distinct !DILexicalBlock(scope: !414, file: !374, line: 50, column: 7)
!414 = distinct !DILexicalBlock(scope: !405, file: !374, line: 51, column: 3)
!415 = !DILocation(line: 50, column: 28, scope: !413)
!416 = !DILocation(line: 50, column: 7, scope: !414)
!417 = !DILocation(line: 51, column: 11, scope: !418)
!418 = distinct !DILexicalBlock(scope: !413, file: !374, line: 50, column: 60)
!419 = !DILocation(line: 51, column: 16, scope: !418)
!420 = !DILocation(line: 52, column: 5, scope: !418)
!421 = !DILocalVariable(name: "tmp", scope: !405, file: !374, line: 47, type: !38)
!422 = !DILocalVariable(name: "prev", scope: !405, file: !374, line: 48, type: !38)
!423 = !DILocation(line: 57, column: 3, scope: !424)
!424 = distinct !DILexicalBlock(scope: !425, file: !374, line: 58, column: 3)
!425 = distinct !DILexicalBlock(scope: !414, file: !374, line: 57, column: 3)
!426 = !DILocation(line: 0, scope: !414)
!427 = !DILocation(line: 57, column: 13, scope: !424)
!428 = !DILocation(line: 57, column: 12, scope: !429)
!429 = distinct !DILexicalBlock(scope: !430, file: !374, line: 57, column: 9)
!430 = distinct !DILexicalBlock(scope: !424, file: !374, line: 57, column: 13)
!431 = !DILocation(line: 57, column: 32, scope: !429)
!432 = !DILocation(line: 57, column: 9, scope: !430)
!433 = !DILocation(line: 57, column: 7, scope: !434)
!434 = distinct !DILexicalBlock(scope: !429, file: !374, line: 57, column: 65)
!435 = !DILocation(line: 58, column: 40, scope: !436)
!436 = distinct !DILexicalBlock(scope: !437, file: !374, line: 60, column: 5)
!437 = distinct !DILexicalBlock(scope: !430, file: !374, line: 59, column: 5)
!438 = !DILocation(line: 58, column: 68, scope: !436)
!439 = !DILocation(line: 58, column: 11, scope: !436)
!440 = !DILocalVariable(name: "ret", scope: !405, file: !374, line: 49, type: !27)
!441 = !DILocation(line: 59, column: 13, scope: !442)
!442 = distinct !DILexicalBlock(scope: !430, file: !374, line: 59, column: 9)
!443 = !DILocation(line: 59, column: 9, scope: !430)
!444 = !DILocation(line: 61, column: 11, scope: !445)
!445 = distinct !DILexicalBlock(scope: !446, file: !374, line: 61, column: 11)
!446 = distinct !DILexicalBlock(scope: !442, file: !374, line: 59, column: 18)
!447 = !DILocation(line: 61, column: 32, scope: !445)
!448 = !DILocation(line: 61, column: 11, scope: !446)
!449 = !DILocation(line: 63, column: 15, scope: !450)
!450 = distinct !DILexicalBlock(scope: !445, file: !374, line: 61, column: 64)
!451 = !DILocation(line: 63, column: 20, scope: !450)
!452 = !DILocation(line: 64, column: 9, scope: !450)
!453 = !DILocation(line: 66, column: 15, scope: !454)
!454 = distinct !DILexicalBlock(scope: !445, file: !374, line: 65, column: 14)
!455 = !DILocation(line: 66, column: 20, scope: !454)
!456 = !DILocation(line: 67, column: 15, scope: !454)
!457 = !DILocation(line: 67, column: 20, scope: !454)
!458 = !DILocation(line: 68, column: 9, scope: !454)
!459 = !DILocation(line: 70, column: 13, scope: !460)
!460 = distinct !DILexicalBlock(scope: !442, file: !374, line: 70, column: 9)
!461 = !DILocation(line: 70, column: 9, scope: !442)
!462 = !DILocation(line: 72, column: 7, scope: !463)
!463 = distinct !DILexicalBlock(scope: !460, file: !374, line: 70, column: 19)
!464 = !DILocation(line: 76, column: 16, scope: !430)
!465 = distinct !{!465, !423, !466}
!466 = !DILocation(line: 77, column: 3, scope: !424)
!467 = !DILocation(line: 79, column: 3, scope: !424)
!468 = !DILocation(line: 79, column: 9, scope: !414)
!469 = !DILocation(line: 79, column: 14, scope: !414)
!470 = !DILocation(line: 80, column: 9, scope: !414)
!471 = !DILocation(line: 80, column: 14, scope: !414)
!472 = !DILocation(line: 81, column: 3, scope: !414)
!473 = !DILocation(line: 83, column: 1, scope: !405)
!474 = distinct !DISubprogram(name: "sorted_list_remove_and_free_item_by_data", scope: !374, file: !374, line: 84, type: !475, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, retainedNodes: !181)
!475 = !DISubroutineType(types: !476)
!476 = !{!38, !38, !36, !140, !377}
!477 = !DILocalVariable(name: "list", arg: 1, scope: !474, file: !374, line: 84, type: !38)
!478 = !DILocation(line: 0, scope: !474)
!479 = !DILocalVariable(name: "data", arg: 2, scope: !474, file: !374, line: 84, type: !36)
!480 = !DILocalVariable(name: "dcmp", arg: 3, scope: !474, file: !374, line: 85, type: !140)
!481 = !DILocalVariable(name: "nfree", arg: 4, scope: !474, file: !374, line: 87, type: !377)
!482 = !DILocalVariable(name: "tmp", scope: !474, file: !374, line: 89, type: !38)
!483 = !DILocalVariable(name: "prev", scope: !474, file: !374, line: 90, type: !38)
!484 = !DILocation(line: 94, column: 3, scope: !485)
!485 = distinct !DILexicalBlock(scope: !486, file: !374, line: 95, column: 3)
!486 = distinct !DILexicalBlock(scope: !487, file: !374, line: 94, column: 3)
!487 = distinct !DILexicalBlock(scope: !474, file: !374, line: 93, column: 3)
!488 = !DILocation(line: 0, scope: !487)
!489 = !DILocation(line: 94, column: 13, scope: !485)
!490 = !DILocation(line: 94, column: 12, scope: !491)
!491 = distinct !DILexicalBlock(scope: !492, file: !374, line: 94, column: 9)
!492 = distinct !DILexicalBlock(scope: !485, file: !374, line: 94, column: 13)
!493 = !DILocation(line: 94, column: 32, scope: !491)
!494 = !DILocation(line: 94, column: 9, scope: !492)
!495 = !DILocation(line: 94, column: 7, scope: !496)
!496 = distinct !DILexicalBlock(scope: !491, file: !374, line: 94, column: 65)
!497 = !DILocation(line: 95, column: 40, scope: !498)
!498 = distinct !DILexicalBlock(scope: !499, file: !374, line: 97, column: 5)
!499 = distinct !DILexicalBlock(scope: !492, file: !374, line: 96, column: 5)
!500 = !DILocation(line: 95, column: 11, scope: !498)
!501 = !DILocalVariable(name: "ret", scope: !474, file: !374, line: 91, type: !27)
!502 = !DILocation(line: 96, column: 13, scope: !503)
!503 = distinct !DILexicalBlock(scope: !492, file: !374, line: 96, column: 9)
!504 = !DILocation(line: 96, column: 9, scope: !492)
!505 = !DILocation(line: 98, column: 11, scope: !506)
!506 = distinct !DILexicalBlock(scope: !507, file: !374, line: 98, column: 11)
!507 = distinct !DILexicalBlock(scope: !503, file: !374, line: 96, column: 19)
!508 = !DILocation(line: 98, column: 32, scope: !506)
!509 = !DILocation(line: 98, column: 11, scope: !507)
!510 = !DILocation(line: 99, column: 21, scope: !511)
!511 = distinct !DILexicalBlock(scope: !512, file: !374, line: 99, column: 9)
!512 = distinct !DILexicalBlock(scope: !506, file: !374, line: 98, column: 64)
!513 = !DILocation(line: 100, column: 9, scope: !514)
!514 = distinct !DILexicalBlock(scope: !511, file: !374, line: 100, column: 9)
!515 = !DILocation(line: 101, column: 9, scope: !512)
!516 = !DILocation(line: 103, column: 27, scope: !517)
!517 = distinct !DILexicalBlock(scope: !518, file: !374, line: 103, column: 9)
!518 = distinct !DILexicalBlock(scope: !506, file: !374, line: 102, column: 14)
!519 = !DILocation(line: 103, column: 15, scope: !517)
!520 = !DILocation(line: 103, column: 20, scope: !517)
!521 = !DILocation(line: 104, column: 9, scope: !522)
!522 = distinct !DILexicalBlock(scope: !517, file: !374, line: 104, column: 9)
!523 = !DILocation(line: 105, column: 9, scope: !518)
!524 = !DILocation(line: 110, column: 16, scope: !492)
!525 = distinct !{!525, !484, !526}
!526 = !DILocation(line: 111, column: 3, scope: !485)
!527 = !DILocation(line: 113, column: 3, scope: !485)
!528 = !DILocation(line: 113, column: 3, scope: !487)
!529 = !DILocation(line: 115, column: 1, scope: !474)
!530 = distinct !DISubprogram(name: "list_prepend_item_by_data", scope: !374, file: !374, line: 116, type: !531, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, retainedNodes: !181)
!531 = !DISubroutineType(types: !532)
!532 = !{!38, !38, !36}
!533 = !DILocalVariable(name: "list", arg: 1, scope: !530, file: !374, line: 116, type: !38)
!534 = !DILocation(line: 0, scope: !530)
!535 = !DILocalVariable(name: "data", arg: 2, scope: !530, file: !374, line: 116, type: !36)
!536 = !DILocation(line: 121, column: 9, scope: !537)
!537 = distinct !DILexicalBlock(scope: !538, file: !374, line: 123, column: 3)
!538 = distinct !DILexicalBlock(scope: !539, file: !374, line: 122, column: 3)
!539 = distinct !DILexicalBlock(scope: !530, file: !374, line: 121, column: 3)
!540 = !DILocalVariable(name: "tmp", scope: !530, file: !374, line: 119, type: !31)
!541 = !DILocation(line: 121, column: 10, scope: !538)
!542 = !DILocalVariable(name: "rets", scope: !530, file: !374, line: 118, type: !38)
!543 = !DILocation(line: 122, column: 7, scope: !544)
!544 = distinct !DILexicalBlock(scope: !539, file: !374, line: 122, column: 7)
!545 = !DILocation(line: 122, column: 28, scope: !544)
!546 = !DILocation(line: 122, column: 7, scope: !539)
!547 = !DILocation(line: 123, column: 5, scope: !548)
!548 = distinct !DILexicalBlock(scope: !544, file: !374, line: 122, column: 60)
!549 = !DILocation(line: 124, column: 9, scope: !539)
!550 = !DILocation(line: 124, column: 14, scope: !539)
!551 = !DILocation(line: 125, column: 9, scope: !539)
!552 = !DILocation(line: 125, column: 14, scope: !539)
!553 = !DILocation(line: 126, column: 3, scope: !539)
!554 = !DILocation(line: 0, scope: !539)
!555 = !DILocation(line: 128, column: 1, scope: !530)
!556 = distinct !DISubprogram(name: "list_search_item_by_data", scope: !374, file: !374, line: 129, type: !531, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, retainedNodes: !181)
!557 = !DILocalVariable(name: "list", arg: 1, scope: !556, file: !374, line: 129, type: !38)
!558 = !DILocation(line: 0, scope: !556)
!559 = !DILocalVariable(name: "data", arg: 2, scope: !556, file: !374, line: 129, type: !36)
!560 = !DILocation(line: 132, column: 3, scope: !561)
!561 = distinct !DILexicalBlock(scope: !562, file: !374, line: 135, column: 3)
!562 = distinct !DILexicalBlock(scope: !563, file: !374, line: 134, column: 3)
!563 = distinct !DILexicalBlock(scope: !556, file: !374, line: 133, column: 3)
!564 = !DILocation(line: 132, column: 13, scope: !561)
!565 = !DILocation(line: 132, column: 12, scope: !566)
!566 = distinct !DILexicalBlock(scope: !567, file: !374, line: 132, column: 9)
!567 = distinct !DILexicalBlock(scope: !561, file: !374, line: 132, column: 13)
!568 = !DILocation(line: 132, column: 33, scope: !566)
!569 = !DILocation(line: 132, column: 9, scope: !567)
!570 = !DILocation(line: 132, column: 7, scope: !571)
!571 = distinct !DILexicalBlock(scope: !566, file: !374, line: 132, column: 66)
!572 = !DILocation(line: 133, column: 31, scope: !573)
!573 = distinct !DILexicalBlock(scope: !567, file: !374, line: 133, column: 9)
!574 = !DILocation(line: 133, column: 9, scope: !573)
!575 = !DILocation(line: 133, column: 39, scope: !573)
!576 = !DILocation(line: 133, column: 36, scope: !573)
!577 = !DILocation(line: 133, column: 9, scope: !567)
!578 = !DILocation(line: 134, column: 7, scope: !579)
!579 = distinct !DILexicalBlock(scope: !573, file: !374, line: 133, column: 61)
!580 = !DILocation(line: 136, column: 18, scope: !567)
!581 = distinct !{!581, !560, !582}
!582 = !DILocation(line: 137, column: 3, scope: !561)
!583 = !DILocation(line: 139, column: 3, scope: !561)
!584 = !DILocation(line: 138, column: 3, scope: !563)
!585 = !DILocation(line: 0, scope: !563)
!586 = !DILocation(line: 140, column: 1, scope: !556)
!587 = distinct !DISubprogram(name: "main", scope: !9, file: !9, line: 2071, type: !588, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, retainedNodes: !181)
!588 = !DISubroutineType(types: !589)
!589 = !{!27, !27, !590}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!591 = !DILocalVariable(name: "argc", arg: 1, scope: !587, file: !9, line: 2071, type: !27)
!592 = !DILocation(line: 0, scope: !587)
!593 = !DILocalVariable(name: "argv", arg: 2, scope: !587, file: !9, line: 2071, type: !590)
!594 = !DILocalVariable(name: "invalid_file_list", scope: !587, file: !9, line: 2081, type: !38)
!595 = !DILocation(line: 2081, column: 18, scope: !587)
!596 = !DILocalVariable(name: "main_list", scope: !587, file: !9, line: 2082, type: !38)
!597 = !DILocation(line: 2082, column: 18, scope: !587)
!598 = !DILocalVariable(name: "st", scope: !587, file: !9, line: 2085, type: !53)
!599 = !DILocation(line: 2085, column: 15, scope: !587)
!600 = !DILocalVariable(name: "__cil_tmp18", scope: !587, file: !9, line: 2088, type: !24)
!601 = !DILocation(line: 2088, column: 9, scope: !587)
!602 = !DILocalVariable(name: "__cil_tmp19", scope: !587, file: !9, line: 2089, type: !24)
!603 = !DILocation(line: 2089, column: 9, scope: !587)
!604 = !DILocalVariable(name: "__cil_tmp20", scope: !587, file: !9, line: 2090, type: !24)
!605 = !DILocation(line: 2090, column: 9, scope: !587)
!606 = !DILocalVariable(name: "__cil_tmp21", scope: !587, file: !9, line: 2091, type: !24)
!607 = !DILocation(line: 2091, column: 9, scope: !587)
!608 = !DILocalVariable(name: "__cil_tmp22", scope: !587, file: !9, line: 2092, type: !24)
!609 = !DILocation(line: 2092, column: 9, scope: !587)
!610 = !DILocalVariable(name: "__cil_tmp23", scope: !587, file: !9, line: 2093, type: !24)
!611 = !DILocation(line: 2093, column: 9, scope: !587)
!612 = !DILocalVariable(name: "__cil_tmp24", scope: !587, file: !9, line: 2094, type: !24)
!613 = !DILocation(line: 2094, column: 9, scope: !587)
!614 = !DILocalVariable(name: "__cil_tmp25", scope: !587, file: !9, line: 2095, type: !24)
!615 = !DILocation(line: 2095, column: 9, scope: !587)
!616 = !DILocalVariable(name: "__cil_tmp26", scope: !587, file: !9, line: 2096, type: !24)
!617 = !DILocation(line: 2096, column: 9, scope: !587)
!618 = !DILocalVariable(name: "__cil_tmp27", scope: !587, file: !9, line: 2097, type: !24)
!619 = !DILocation(line: 2097, column: 9, scope: !587)
!620 = !DILocalVariable(name: "__cil_tmp28", scope: !587, file: !9, line: 2098, type: !24)
!621 = !DILocation(line: 2098, column: 9, scope: !587)
!622 = !DILocalVariable(name: "__cil_tmp29", scope: !587, file: !9, line: 2099, type: !24)
!623 = !DILocation(line: 2099, column: 9, scope: !587)
!624 = !DILocalVariable(name: "__cil_tmp30", scope: !587, file: !9, line: 2100, type: !24)
!625 = !DILocation(line: 2100, column: 9, scope: !587)
!626 = !DILocalVariable(name: "__cil_tmp31", scope: !587, file: !9, line: 2101, type: !24)
!627 = !DILocation(line: 2101, column: 9, scope: !587)
!628 = !DILocalVariable(name: "__cil_tmp32", scope: !587, file: !9, line: 2102, type: !24)
!629 = !DILocation(line: 2102, column: 9, scope: !587)
!630 = !DILocalVariable(name: "__cil_tmp33", scope: !587, file: !9, line: 2103, type: !24)
!631 = !DILocation(line: 2103, column: 9, scope: !587)
!632 = !DILocalVariable(name: "__cil_tmp34", scope: !587, file: !9, line: 2104, type: !24)
!633 = !DILocation(line: 2104, column: 9, scope: !587)
!634 = !DILocalVariable(name: "__cil_tmp35", scope: !587, file: !9, line: 2105, type: !24)
!635 = !DILocation(line: 2105, column: 9, scope: !587)
!636 = !DILocalVariable(name: "__cil_tmp36", scope: !587, file: !9, line: 2106, type: !24)
!637 = !DILocation(line: 2106, column: 9, scope: !587)
!638 = !DILocalVariable(name: "fast_mode", scope: !587, file: !9, line: 2075, type: !27)
!639 = !DILocalVariable(name: "do_verify", scope: !587, file: !9, line: 2076, type: !27)
!640 = !DILocalVariable(name: "comp_cmd", scope: !587, file: !9, line: 2077, type: !24)
!641 = !DILocalVariable(name: "comp_dir", scope: !587, file: !9, line: 2078, type: !24)
!642 = !DILocation(line: 2076, column: 21, scope: !643)
!643 = distinct !DILexicalBlock(scope: !587, file: !9, line: 2108, column: 3)
!644 = !DILocation(line: 2076, column: 13, scope: !643)
!645 = !DILocation(line: 2082, column: 3, scope: !646)
!646 = distinct !DILexicalBlock(scope: !647, file: !9, line: 2078, column: 3)
!647 = distinct !DILexicalBlock(scope: !643, file: !9, line: 2077, column: 3)
!648 = !DILocation(line: 2074, column: 13, scope: !643)
!649 = !DILocation(line: 0, scope: !643)
!650 = !DILocation(line: 2075, column: 12, scope: !643)
!651 = !DILocation(line: 2082, column: 13, scope: !646)
!652 = !DILocation(line: 2083, column: 11, scope: !653)
!653 = distinct !DILexicalBlock(scope: !654, file: !9, line: 2086, column: 5)
!654 = distinct !DILexicalBlock(scope: !655, file: !9, line: 2085, column: 5)
!655 = distinct !DILexicalBlock(scope: !646, file: !9, line: 2082, column: 13)
!656 = !DILocalVariable(name: "ret", scope: !587, file: !9, line: 2073, type: !27)
!657 = !DILocation(line: 2084, column: 13, scope: !658)
!658 = distinct !DILexicalBlock(scope: !655, file: !9, line: 2084, column: 9)
!659 = !DILocation(line: 2084, column: 9, scope: !655)
!660 = !DILocation(line: 2085, column: 36, scope: !661)
!661 = distinct !DILexicalBlock(scope: !662, file: !9, line: 2085, column: 11)
!662 = distinct !DILexicalBlock(scope: !658, file: !9, line: 2084, column: 20)
!663 = !DILocation(line: 2085, column: 34, scope: !661)
!664 = !DILocation(line: 2085, column: 27, scope: !661)
!665 = !DILocation(line: 2085, column: 11, scope: !661)
!666 = !DILocation(line: 2085, column: 44, scope: !661)
!667 = !DILocation(line: 2085, column: 11, scope: !662)
!668 = !DILocation(line: 2086, column: 9, scope: !669)
!669 = distinct !DILexicalBlock(scope: !670, file: !9, line: 2087, column: 9)
!670 = distinct !DILexicalBlock(scope: !671, file: !9, line: 2086, column: 9)
!671 = distinct !DILexicalBlock(scope: !661, file: !9, line: 2085, column: 76)
!672 = !DILocation(line: 2087, column: 9, scope: !673)
!673 = distinct !DILexicalBlock(scope: !670, file: !9, line: 2088, column: 9)
!674 = !DILocation(line: 2089, column: 7, scope: !662)
!675 = !DILocation(line: 2092, column: 13, scope: !676)
!676 = distinct !DILexicalBlock(scope: !677, file: !9, line: 2092, column: 9)
!677 = distinct !DILexicalBlock(scope: !655, file: !9, line: 2091, column: 5)
!678 = !DILocation(line: 2092, column: 9, scope: !677)
!679 = !DILocation(line: 2092, column: 7, scope: !680)
!680 = distinct !DILexicalBlock(scope: !676, file: !9, line: 2092, column: 20)
!681 = !DILocation(line: 2095, column: 13, scope: !682)
!682 = distinct !DILexicalBlock(scope: !677, file: !9, line: 2095, column: 9)
!683 = !DILocation(line: 2095, column: 9, scope: !677)
!684 = !DILocation(line: 2095, column: 7, scope: !685)
!685 = distinct !DILexicalBlock(scope: !682, file: !9, line: 2095, column: 21)
!686 = !DILocation(line: 2098, column: 13, scope: !687)
!687 = distinct !DILexicalBlock(scope: !677, file: !9, line: 2098, column: 9)
!688 = !DILocation(line: 2098, column: 9, scope: !677)
!689 = !DILocation(line: 2098, column: 7, scope: !690)
!690 = distinct !DILexicalBlock(scope: !687, file: !9, line: 2098, column: 21)
!691 = !DILocation(line: 2101, column: 13, scope: !692)
!692 = distinct !DILexicalBlock(scope: !677, file: !9, line: 2101, column: 9)
!693 = !DILocation(line: 2101, column: 9, scope: !677)
!694 = !DILocation(line: 2101, column: 7, scope: !695)
!695 = distinct !DILexicalBlock(scope: !692, file: !9, line: 2101, column: 21)
!696 = !DILocation(line: 2104, column: 13, scope: !697)
!697 = distinct !DILexicalBlock(scope: !677, file: !9, line: 2104, column: 9)
!698 = !DILocation(line: 2104, column: 9, scope: !677)
!699 = !DILocation(line: 2104, column: 7, scope: !700)
!700 = distinct !DILexicalBlock(scope: !697, file: !9, line: 2104, column: 21)
!701 = !DILocation(line: 2107, column: 13, scope: !702)
!702 = distinct !DILexicalBlock(scope: !677, file: !9, line: 2107, column: 9)
!703 = !DILocation(line: 2107, column: 9, scope: !677)
!704 = !DILocation(line: 2107, column: 7, scope: !705)
!705 = distinct !DILexicalBlock(scope: !702, file: !9, line: 2107, column: 21)
!706 = !DILocation(line: 2110, column: 5, scope: !677)
!707 = !DILocation(line: 2093, column: 16, scope: !677)
!708 = !DILocation(line: 2094, column: 5, scope: !677)
!709 = !DILocation(line: 2096, column: 16, scope: !677)
!710 = !DILocation(line: 2097, column: 5, scope: !677)
!711 = !DILocation(line: 2100, column: 5, scope: !677)
!712 = !DILocation(line: 2103, column: 5, scope: !677)
!713 = !DILocation(line: 2105, column: 5, scope: !714)
!714 = distinct !DILexicalBlock(scope: !715, file: !9, line: 2106, column: 5)
!715 = distinct !DILexicalBlock(scope: !677, file: !9, line: 2105, column: 5)
!716 = !DILocation(line: 2106, column: 5, scope: !677)
!717 = !DILocation(line: 2108, column: 5, scope: !718)
!718 = distinct !DILexicalBlock(scope: !719, file: !9, line: 2109, column: 5)
!719 = distinct !DILexicalBlock(scope: !677, file: !9, line: 2108, column: 5)
!720 = !DILocation(line: 2109, column: 5, scope: !677)
!721 = !DILocation(line: 2111, column: 5, scope: !722)
!722 = distinct !DILexicalBlock(scope: !723, file: !9, line: 2112, column: 5)
!723 = distinct !DILexicalBlock(scope: !677, file: !9, line: 2111, column: 5)
!724 = !DILocation(line: 2112, column: 5, scope: !725)
!725 = distinct !DILexicalBlock(scope: !723, file: !9, line: 2113, column: 5)
!726 = distinct !{!726, !645, !727}
!727 = !DILocation(line: 2117, column: 3, scope: !646)
!728 = !DILocation(line: 2119, column: 3, scope: !646)
!729 = !DILocation(line: 2116, column: 3, scope: !730)
!730 = distinct !DILexicalBlock(scope: !731, file: !9, line: 2123, column: 3)
!731 = distinct !DILexicalBlock(scope: !643, file: !9, line: 2122, column: 3)
!732 = !DILocation(line: 2117, column: 15, scope: !733)
!733 = distinct !DILexicalBlock(scope: !731, file: !9, line: 2118, column: 3)
!734 = !DILocalVariable(name: "file_list", scope: !587, file: !9, line: 2079, type: !38)
!735 = !DILocation(line: 2118, column: 7, scope: !736)
!736 = distinct !DILexicalBlock(scope: !643, file: !9, line: 2118, column: 7)
!737 = !DILocation(line: 2118, column: 33, scope: !736)
!738 = !DILocation(line: 2118, column: 7, scope: !643)
!739 = !DILocation(line: 2119, column: 5, scope: !740)
!740 = distinct !DILexicalBlock(scope: !741, file: !9, line: 2120, column: 5)
!741 = distinct !DILexicalBlock(scope: !742, file: !9, line: 2119, column: 5)
!742 = distinct !DILexicalBlock(scope: !736, file: !9, line: 2118, column: 65)
!743 = !DILocation(line: 2120, column: 5, scope: !742)
!744 = !DILocation(line: 2133, column: 3, scope: !745)
!745 = distinct !DILexicalBlock(scope: !746, file: !9, line: 2123, column: 3)
!746 = distinct !DILexicalBlock(scope: !643, file: !9, line: 2122, column: 3)
!747 = !DILocation(line: 2134, column: 3, scope: !748)
!748 = distinct !DILexicalBlock(scope: !746, file: !9, line: 2135, column: 3)
!749 = !DILocation(line: 2136, column: 3, scope: !746)
!750 = !DILocation(line: 2137, column: 3, scope: !751)
!751 = distinct !DILexicalBlock(scope: !752, file: !9, line: 2139, column: 3)
!752 = distinct !DILexicalBlock(scope: !643, file: !9, line: 2138, column: 3)
!753 = !DILocation(line: 2138, column: 9, scope: !754)
!754 = distinct !DILexicalBlock(scope: !752, file: !9, line: 2139, column: 3)
!755 = !DILocalVariable(name: "ncc", scope: !587, file: !9, line: 2074, type: !27)
!756 = !DILocation(line: 2161, column: 3, scope: !757)
!757 = distinct !DILexicalBlock(scope: !752, file: !9, line: 2140, column: 3)
!758 = !DILocation(line: 2162, column: 10, scope: !759)
!759 = distinct !DILexicalBlock(scope: !752, file: !9, line: 2163, column: 3)
!760 = !DILocation(line: 2162, column: 3, scope: !759)
!761 = !DILocation(line: 2163, column: 18, scope: !762)
!762 = distinct !DILexicalBlock(scope: !752, file: !9, line: 2164, column: 3)
!763 = !DILocalVariable(name: "comp_results", scope: !587, file: !9, line: 2083, type: !154)
!764 = !DILocation(line: 2164, column: 7, scope: !765)
!765 = distinct !DILexicalBlock(scope: !643, file: !9, line: 2164, column: 7)
!766 = !DILocation(line: 2164, column: 36, scope: !765)
!767 = !DILocation(line: 2164, column: 7, scope: !643)
!768 = !DILocation(line: 2165, column: 9, scope: !769)
!769 = distinct !DILexicalBlock(scope: !770, file: !9, line: 2165, column: 9)
!770 = distinct !DILexicalBlock(scope: !765, file: !9, line: 2164, column: 68)
!771 = !DILocation(line: 2165, column: 9, scope: !770)
!772 = !DILocation(line: 2166, column: 7, scope: !773)
!773 = distinct !DILexicalBlock(scope: !774, file: !9, line: 2167, column: 7)
!774 = distinct !DILexicalBlock(scope: !775, file: !9, line: 2166, column: 7)
!775 = distinct !DILexicalBlock(scope: !769, file: !9, line: 2165, column: 20)
!776 = !DILocation(line: 2168, column: 7, scope: !777)
!777 = distinct !DILexicalBlock(scope: !774, file: !9, line: 2168, column: 7)
!778 = !DILocation(line: 2169, column: 11, scope: !779)
!779 = distinct !DILexicalBlock(scope: !775, file: !9, line: 2169, column: 11)
!780 = !DILocation(line: 2169, column: 11, scope: !775)
!781 = !DILocation(line: 2170, column: 19, scope: !782)
!782 = distinct !DILexicalBlock(scope: !783, file: !9, line: 2171, column: 9)
!783 = distinct !DILexicalBlock(scope: !784, file: !9, line: 2170, column: 9)
!784 = distinct !DILexicalBlock(scope: !779, file: !9, line: 2169, column: 30)
!785 = !DILocation(line: 2170, column: 9, scope: !782)
!786 = !DILocation(line: 2171, column: 27, scope: !783)
!787 = !DILocation(line: 2173, column: 7, scope: !784)
!788 = !DILocation(line: 2173, column: 11, scope: !789)
!789 = distinct !DILexicalBlock(scope: !775, file: !9, line: 2173, column: 11)
!790 = !DILocation(line: 2173, column: 11, scope: !775)
!791 = !DILocation(line: 2174, column: 19, scope: !792)
!792 = distinct !DILexicalBlock(scope: !793, file: !9, line: 2175, column: 9)
!793 = distinct !DILexicalBlock(scope: !794, file: !9, line: 2174, column: 9)
!794 = distinct !DILexicalBlock(scope: !789, file: !9, line: 2173, column: 22)
!795 = !DILocation(line: 2174, column: 9, scope: !792)
!796 = !DILocation(line: 2175, column: 19, scope: !793)
!797 = !DILocation(line: 2177, column: 7, scope: !794)
!798 = !DILocation(line: 2177, column: 7, scope: !799)
!799 = distinct !DILexicalBlock(scope: !800, file: !9, line: 2179, column: 7)
!800 = distinct !DILexicalBlock(scope: !775, file: !9, line: 2178, column: 7)
!801 = !DILocation(line: 2178, column: 7, scope: !775)
!802 = !DILocation(line: 2180, column: 7, scope: !803)
!803 = distinct !DILexicalBlock(scope: !804, file: !9, line: 2181, column: 7)
!804 = distinct !DILexicalBlock(scope: !805, file: !9, line: 2180, column: 7)
!805 = distinct !DILexicalBlock(scope: !769, file: !9, line: 2179, column: 12)
!806 = !DILocation(line: 2181, column: 7, scope: !807)
!807 = distinct !DILexicalBlock(scope: !804, file: !9, line: 2182, column: 7)
!808 = !DILocation(line: 2185, column: 3, scope: !809)
!809 = distinct !DILexicalBlock(scope: !810, file: !9, line: 2187, column: 3)
!810 = distinct !DILexicalBlock(scope: !643, file: !9, line: 2186, column: 3)
!811 = !DILocation(line: 2186, column: 3, scope: !812)
!812 = distinct !DILexicalBlock(scope: !810, file: !9, line: 2187, column: 3)
!813 = !DILocation(line: 2188, column: 3, scope: !814)
!814 = distinct !DILexicalBlock(scope: !810, file: !9, line: 2188, column: 3)
!815 = !DILocation(line: 2189, column: 22, scope: !816)
!816 = distinct !DILexicalBlock(scope: !810, file: !9, line: 2190, column: 3)
!817 = !DILocation(line: 2189, column: 3, scope: !816)
!818 = !DILocation(line: 2191, column: 7, scope: !819)
!819 = distinct !DILexicalBlock(scope: !643, file: !9, line: 2191, column: 7)
!820 = !DILocation(line: 2191, column: 7, scope: !643)
!821 = !DILocation(line: 2192, column: 5, scope: !822)
!822 = distinct !DILexicalBlock(scope: !823, file: !9, line: 2193, column: 5)
!823 = distinct !DILexicalBlock(scope: !824, file: !9, line: 2192, column: 5)
!824 = distinct !DILexicalBlock(scope: !819, file: !9, line: 2191, column: 18)
!825 = !DILocation(line: 2193, column: 12, scope: !826)
!826 = distinct !DILexicalBlock(scope: !823, file: !9, line: 2194, column: 5)
!827 = !DILocation(line: 2193, column: 5, scope: !826)
!828 = !DILocation(line: 2194, column: 9, scope: !829)
!829 = distinct !DILexicalBlock(scope: !823, file: !9, line: 2195, column: 5)
!830 = !DILocalVariable(name: "t", scope: !587, file: !9, line: 2084, type: !47)
!831 = !DILocation(line: 2195, column: 5, scope: !832)
!832 = distinct !DILexicalBlock(scope: !823, file: !9, line: 2196, column: 5)
!833 = !DILocation(line: 2196, column: 15, scope: !834)
!834 = distinct !DILexicalBlock(scope: !823, file: !9, line: 2197, column: 5)
!835 = !DILocalVariable(name: "tmp___0", scope: !587, file: !9, line: 2087, type: !27)
!836 = !DILocation(line: 2196, column: 17, scope: !837)
!837 = distinct !DILexicalBlock(scope: !824, file: !9, line: 2196, column: 9)
!838 = !DILocation(line: 2196, column: 9, scope: !824)
!839 = !DILocation(line: 2197, column: 7, scope: !840)
!840 = distinct !DILexicalBlock(scope: !841, file: !9, line: 2198, column: 7)
!841 = distinct !DILexicalBlock(scope: !842, file: !9, line: 2197, column: 7)
!842 = distinct !DILexicalBlock(scope: !837, file: !9, line: 2196, column: 24)
!843 = !DILocation(line: 2198, column: 7, scope: !844)
!844 = distinct !DILexicalBlock(scope: !841, file: !9, line: 2199, column: 7)
!845 = !DILocation(line: 2200, column: 7, scope: !846)
!846 = distinct !DILexicalBlock(scope: !841, file: !9, line: 2200, column: 7)
!847 = !DILocalVariable(name: "tmp_list", scope: !587, file: !9, line: 2080, type: !38)
!848 = !DILocation(line: 2203, column: 7, scope: !849)
!849 = distinct !DILexicalBlock(scope: !850, file: !9, line: 2205, column: 7)
!850 = distinct !DILexicalBlock(scope: !842, file: !9, line: 2204, column: 7)
!851 = !DILocation(line: 0, scope: !842)
!852 = !DILocation(line: 2203, column: 17, scope: !849)
!853 = !DILocation(line: 2203, column: 16, scope: !854)
!854 = distinct !DILexicalBlock(scope: !855, file: !9, line: 2203, column: 13)
!855 = distinct !DILexicalBlock(scope: !849, file: !9, line: 2203, column: 17)
!856 = !DILocation(line: 2203, column: 41, scope: !854)
!857 = !DILocation(line: 2203, column: 13, scope: !855)
!858 = !DILocation(line: 2203, column: 11, scope: !859)
!859 = distinct !DILexicalBlock(scope: !854, file: !9, line: 2203, column: 74)
!860 = !DILocation(line: 2205, column: 73, scope: !861)
!861 = distinct !DILexicalBlock(scope: !862, file: !9, line: 2206, column: 9)
!862 = distinct !DILexicalBlock(scope: !855, file: !9, line: 2205, column: 9)
!863 = !DILocation(line: 2205, column: 15, scope: !861)
!864 = !DILocalVariable(name: "tmp", scope: !587, file: !9, line: 2086, type: !27)
!865 = !DILocation(line: 2205, column: 17, scope: !866)
!866 = distinct !DILexicalBlock(scope: !855, file: !9, line: 2205, column: 13)
!867 = !DILocation(line: 2205, column: 13, scope: !855)
!868 = !DILocation(line: 2206, column: 96, scope: !869)
!869 = distinct !DILexicalBlock(scope: !870, file: !9, line: 2207, column: 11)
!870 = distinct !DILexicalBlock(scope: !871, file: !9, line: 2206, column: 11)
!871 = distinct !DILexicalBlock(scope: !866, file: !9, line: 2205, column: 24)
!872 = !DILocation(line: 2206, column: 11, scope: !869)
!873 = !DILocation(line: 2209, column: 9, scope: !871)
!874 = !DILocation(line: 2208, column: 16, scope: !875)
!875 = distinct !DILexicalBlock(scope: !866, file: !9, line: 2208, column: 13)
!876 = !DILocation(line: 2208, column: 24, scope: !875)
!877 = !DILocation(line: 2208, column: 31, scope: !875)
!878 = !DILocation(line: 2208, column: 13, scope: !866)
!879 = !DILocation(line: 2209, column: 96, scope: !880)
!880 = distinct !DILexicalBlock(scope: !881, file: !9, line: 2210, column: 11)
!881 = distinct !DILexicalBlock(scope: !882, file: !9, line: 2209, column: 11)
!882 = distinct !DILexicalBlock(scope: !875, file: !9, line: 2208, column: 36)
!883 = !DILocation(line: 2209, column: 11, scope: !880)
!884 = !DILocation(line: 2212, column: 9, scope: !882)
!885 = !DILocation(line: 2211, column: 30, scope: !855)
!886 = distinct !{!886, !848, !887}
!887 = !DILocation(line: 2212, column: 7, scope: !849)
!888 = !DILocation(line: 2214, column: 7, scope: !849)
!889 = !DILocation(line: 2213, column: 7, scope: !890)
!890 = distinct !DILexicalBlock(scope: !891, file: !9, line: 2218, column: 7)
!891 = distinct !DILexicalBlock(scope: !842, file: !9, line: 2217, column: 7)
!892 = !DILocation(line: 2215, column: 5, scope: !893)
!893 = distinct !DILexicalBlock(scope: !894, file: !9, line: 2218, column: 5)
!894 = distinct !DILexicalBlock(scope: !824, file: !9, line: 2217, column: 5)
!895 = !DILocation(line: 2218, column: 3, scope: !824)
!896 = !DILocation(line: 2218, column: 3, scope: !897)
!897 = distinct !DILexicalBlock(scope: !898, file: !9, line: 2220, column: 3)
!898 = distinct !DILexicalBlock(scope: !643, file: !9, line: 2219, column: 3)
!899 = !DILocation(line: 2219, column: 3, scope: !643)
!900 = !DILocation(line: 2221, column: 1, scope: !587)
!901 = distinct !DISubprogram(name: "show_help", scope: !9, file: !9, line: 78, type: !902, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !5, retainedNodes: !181)
!902 = !DISubroutineType(types: !903)
!903 = !{null}
!904 = !DILocalVariable(name: "__cil_tmp1", scope: !901, file: !9, line: 80, type: !24)
!905 = !DILocation(line: 80, column: 9, scope: !901)
!906 = !DILocation(line: 81, column: 3, scope: !907)
!907 = distinct !DILexicalBlock(scope: !908, file: !9, line: 84, column: 3)
!908 = distinct !DILexicalBlock(scope: !909, file: !9, line: 83, column: 3)
!909 = distinct !DILexicalBlock(scope: !901, file: !9, line: 82, column: 3)
!910 = !DILocation(line: 90, column: 3, scope: !909)
!911 = distinct !DISubprogram(name: "show_ver", scope: !9, file: !9, line: 92, type: !902, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !5, retainedNodes: !181)
!912 = !DILocalVariable(name: "__cil_tmp1", scope: !911, file: !9, line: 94, type: !24)
!913 = !DILocation(line: 94, column: 9, scope: !911)
!914 = !DILocation(line: 95, column: 3, scope: !915)
!915 = distinct !DILexicalBlock(scope: !916, file: !9, line: 98, column: 3)
!916 = distinct !DILexicalBlock(scope: !917, file: !9, line: 97, column: 3)
!917 = distinct !DILexicalBlock(scope: !911, file: !9, line: 96, column: 3)
!918 = !DILocation(line: 100, column: 3, scope: !917)
!919 = distinct !DISubprogram(name: "list_need_strip_files", scope: !9, file: !9, line: 276, type: !920, scopeLine: 277, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !5, retainedNodes: !181)
!920 = !DISubroutineType(types: !921)
!921 = !{!38}
!922 = !DILocalVariable(name: "linebuf", scope: !919, file: !9, line: 280, type: !923)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 32768, elements: !924)
!924 = !{!925}
!925 = !DISubrange(count: 4096)
!926 = !DILocation(line: 280, column: 8, scope: !919)
!927 = !DILocalVariable(name: "exts_c", scope: !919, file: !9, line: 285, type: !39)
!928 = !DILocation(line: 285, column: 17, scope: !919)
!929 = !DILocalVariable(name: "exts_h", scope: !919, file: !9, line: 286, type: !39)
!930 = !DILocation(line: 286, column: 17, scope: !919)
!931 = !DILocalVariable(name: "dir_cwd", scope: !919, file: !9, line: 287, type: !39)
!932 = !DILocation(line: 287, column: 17, scope: !919)
!933 = !DILocalVariable(name: "__cil_tmp29", scope: !919, file: !9, line: 306, type: !31)
!934 = !DILocation(line: 306, column: 9, scope: !919)
!935 = !DILocalVariable(name: "__cil_tmp30", scope: !919, file: !9, line: 307, type: !24)
!936 = !DILocation(line: 307, column: 9, scope: !919)
!937 = !DILocalVariable(name: "__cil_tmp31", scope: !919, file: !9, line: 308, type: !24)
!938 = !DILocation(line: 308, column: 9, scope: !919)
!939 = !DILocalVariable(name: "__cil_tmp32", scope: !919, file: !9, line: 309, type: !24)
!940 = !DILocation(line: 309, column: 9, scope: !919)
!941 = !DILocalVariable(name: "__cil_tmp33", scope: !919, file: !9, line: 310, type: !24)
!942 = !DILocation(line: 310, column: 9, scope: !919)
!943 = !DILocalVariable(name: "__cil_tmp34", scope: !919, file: !9, line: 311, type: !24)
!944 = !DILocation(line: 311, column: 9, scope: !919)
!945 = !DILocalVariable(name: "__cil_tmp35", scope: !919, file: !9, line: 312, type: !24)
!946 = !DILocation(line: 312, column: 9, scope: !919)
!947 = !DILocalVariable(name: "__cil_tmp36", scope: !919, file: !9, line: 313, type: !24)
!948 = !DILocation(line: 313, column: 9, scope: !919)
!949 = !DILocalVariable(name: "__cil_tmp37", scope: !919, file: !9, line: 314, type: !24)
!950 = !DILocation(line: 314, column: 9, scope: !919)
!951 = !DILocalVariable(name: "__cil_tmp38", scope: !919, file: !9, line: 315, type: !24)
!952 = !DILocation(line: 315, column: 9, scope: !919)
!953 = !DILocalVariable(name: "__cil_tmp39", scope: !919, file: !9, line: 316, type: !24)
!954 = !DILocation(line: 316, column: 9, scope: !919)
!955 = !DILocalVariable(name: "__cil_tmp40", scope: !919, file: !9, line: 317, type: !24)
!956 = !DILocation(line: 317, column: 9, scope: !919)
!957 = !DILocalVariable(name: "__cil_tmp41", scope: !919, file: !9, line: 318, type: !24)
!958 = !DILocation(line: 318, column: 9, scope: !919)
!959 = !DILocalVariable(name: "__cil_tmp42", scope: !919, file: !9, line: 319, type: !24)
!960 = !DILocation(line: 319, column: 9, scope: !919)
!961 = !DILocalVariable(name: "__cil_tmp43", scope: !919, file: !9, line: 320, type: !24)
!962 = !DILocation(line: 320, column: 9, scope: !919)
!963 = !DILocalVariable(name: "__cil_tmp44", scope: !919, file: !9, line: 321, type: !24)
!964 = !DILocation(line: 321, column: 9, scope: !919)
!965 = !DILocalVariable(name: "__cil_tmp45", scope: !919, file: !9, line: 322, type: !24)
!966 = !DILocation(line: 322, column: 9, scope: !919)
!967 = !DILocalVariable(name: "__cil_tmp46", scope: !919, file: !9, line: 323, type: !24)
!968 = !DILocation(line: 323, column: 9, scope: !919)
!969 = !DILocalVariable(name: "__cil_tmp47", scope: !919, file: !9, line: 324, type: !24)
!970 = !DILocation(line: 324, column: 9, scope: !919)
!971 = !DILocation(line: 284, column: 10, scope: !972)
!972 = distinct !DILexicalBlock(scope: !973, file: !9, line: 327, column: 3)
!973 = distinct !DILexicalBlock(scope: !919, file: !9, line: 326, column: 3)
!974 = !DILocation(line: 284, column: 15, scope: !972)
!975 = !DILocation(line: 284, column: 11, scope: !972)
!976 = !DILocation(line: 284, column: 16, scope: !972)
!977 = !DILocalVariable(name: "cur_section", scope: !919, file: !9, line: 288, type: !8)
!978 = !DILocation(line: 0, scope: !919)
!979 = !DILocalVariable(name: "exts", scope: !919, file: !9, line: 289, type: !38)
!980 = !DILocalVariable(name: "dirs", scope: !919, file: !9, line: 290, type: !38)
!981 = !DILocalVariable(name: "files", scope: !919, file: !9, line: 291, type: !38)
!982 = !DILocalVariable(name: "exc_dirs", scope: !919, file: !9, line: 292, type: !38)
!983 = !DILocalVariable(name: "exc_files", scope: !919, file: !9, line: 293, type: !38)
!984 = !DILocation(line: 296, column: 8, scope: !985)
!985 = distinct !DILexicalBlock(scope: !972, file: !9, line: 294, column: 3)
!986 = !DILocalVariable(name: "fp", scope: !919, file: !9, line: 278, type: !87)
!987 = !DILocation(line: 297, column: 7, scope: !988)
!988 = distinct !DILexicalBlock(scope: !973, file: !9, line: 297, column: 7)
!989 = !DILocation(line: 297, column: 26, scope: !988)
!990 = !DILocation(line: 297, column: 7, scope: !973)
!991 = !DILocation(line: 298, column: 38, scope: !992)
!992 = distinct !DILexicalBlock(scope: !993, file: !9, line: 299, column: 5)
!993 = distinct !DILexicalBlock(scope: !994, file: !9, line: 298, column: 5)
!994 = distinct !DILexicalBlock(scope: !988, file: !9, line: 297, column: 58)
!995 = !DILocation(line: 298, column: 5, scope: !992)
!996 = !DILocation(line: 300, column: 11, scope: !997)
!997 = distinct !DILexicalBlock(scope: !993, file: !9, line: 301, column: 5)
!998 = !DILocalVariable(name: "tmp", scope: !919, file: !9, line: 294, type: !38)
!999 = !DILocation(line: 300, column: 5, scope: !994)
!1000 = !DILocalVariable(name: "lineno", scope: !919, file: !9, line: 279, type: !27)
!1001 = !DILocation(line: 305, column: 3, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !1003, file: !9, line: 306, column: 3)
!1003 = distinct !DILexicalBlock(scope: !973, file: !9, line: 305, column: 3)
!1004 = !DILocation(line: 293, column: 8, scope: !972)
!1005 = !DILocation(line: 0, scope: !973)
!1006 = !DILocation(line: 293, column: 9, scope: !972)
!1007 = !DILocation(line: 293, column: 12, scope: !972)
!1008 = !DILocation(line: 293, column: 13, scope: !972)
!1009 = !DILocation(line: 305, column: 13, scope: !1002)
!1010 = !DILocation(line: 305, column: 47, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1012, file: !9, line: 309, column: 5)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !9, line: 308, column: 5)
!1013 = distinct !DILexicalBlock(scope: !1002, file: !9, line: 305, column: 13)
!1014 = !DILocation(line: 305, column: 16, scope: !1011)
!1015 = !DILocalVariable(name: "tmp___10", scope: !919, file: !9, line: 305, type: !24)
!1016 = !DILocation(line: 305, column: 12, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1013, file: !9, line: 305, column: 9)
!1018 = !DILocation(line: 305, column: 37, scope: !1017)
!1019 = !DILocation(line: 305, column: 9, scope: !1013)
!1020 = !DILocation(line: 305, column: 7, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1017, file: !9, line: 305, column: 70)
!1022 = !DILocation(line: 306, column: 12, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1013, file: !9, line: 307, column: 5)
!1024 = !DILocation(line: 308, column: 38, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1023, file: !9, line: 307, column: 5)
!1026 = !DILocation(line: 308, column: 15, scope: !1025)
!1027 = !DILocalVariable(name: "tmp___0", scope: !919, file: !9, line: 295, type: !32)
!1028 = !DILocation(line: 308, column: 17, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1013, file: !9, line: 308, column: 9)
!1030 = !DILocation(line: 308, column: 9, scope: !1013)
!1031 = !DILocation(line: 308, column: 17, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !9, line: 308, column: 11)
!1033 = distinct !DILexicalBlock(scope: !1029, file: !9, line: 308, column: 43)
!1034 = !DILocation(line: 308, column: 11, scope: !1032)
!1035 = !DILocation(line: 308, column: 48, scope: !1032)
!1036 = !DILocation(line: 308, column: 11, scope: !1033)
!1037 = !DILocation(line: 311, column: 42, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !9, line: 310, column: 9)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !9, line: 309, column: 9)
!1040 = distinct !DILexicalBlock(scope: !1032, file: !9, line: 308, column: 55)
!1041 = !DILocation(line: 311, column: 9, scope: !1038)
!1042 = !DILocation(line: 313, column: 9, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1039, file: !9, line: 314, column: 9)
!1044 = !DILocation(line: 317, column: 5, scope: !1033)
!1045 = !DILocation(line: 316, column: 9, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1013, file: !9, line: 318, column: 5)
!1047 = !DILocalVariable(name: "p", scope: !919, file: !9, line: 281, type: !24)
!1048 = !DILocation(line: 317, column: 15, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !1046, file: !9, line: 317, column: 5)
!1050 = !DILocalVariable(name: "tmp___1", scope: !919, file: !9, line: 296, type: !32)
!1051 = !DILocation(line: 317, column: 7, scope: !1046)
!1052 = !DILocation(line: 318, column: 15, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1013, file: !9, line: 318, column: 9)
!1054 = !DILocation(line: 318, column: 9, scope: !1053)
!1055 = !DILocation(line: 318, column: 18, scope: !1053)
!1056 = !DILocation(line: 318, column: 9, scope: !1013)
!1057 = !DILocation(line: 319, column: 7, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1053, file: !9, line: 318, column: 25)
!1059 = !DILocation(line: 318, column: 15, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1053, file: !9, line: 318, column: 9)
!1061 = !DILocation(line: 318, column: 9, scope: !1060)
!1062 = !DILocation(line: 318, column: 18, scope: !1060)
!1063 = !DILocation(line: 319, column: 7, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1060, file: !9, line: 318, column: 25)
!1065 = !DILocation(line: 318, column: 15, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1060, file: !9, line: 318, column: 9)
!1067 = !DILocation(line: 318, column: 9, scope: !1066)
!1068 = !DILocation(line: 318, column: 18, scope: !1066)
!1069 = !DILocation(line: 319, column: 7, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1066, file: !9, line: 318, column: 24)
!1071 = !DILocation(line: 321, column: 15, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1013, file: !9, line: 321, column: 9)
!1073 = !DILocation(line: 321, column: 9, scope: !1072)
!1074 = !DILocation(line: 321, column: 18, scope: !1072)
!1075 = !DILocation(line: 321, column: 9, scope: !1013)
!1076 = !DILocation(line: 322, column: 7, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1072, file: !9, line: 321, column: 25)
!1078 = !DILocation(line: 324, column: 15, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1013, file: !9, line: 324, column: 9)
!1080 = !DILocation(line: 324, column: 9, scope: !1079)
!1081 = !DILocation(line: 324, column: 18, scope: !1079)
!1082 = !DILocation(line: 324, column: 9, scope: !1013)
!1083 = !DILocation(line: 326, column: 11, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1085, file: !9, line: 326, column: 7)
!1085 = distinct !DILexicalBlock(scope: !1086, file: !9, line: 325, column: 7)
!1086 = distinct !DILexicalBlock(scope: !1079, file: !9, line: 324, column: 25)
!1087 = !DILocalVariable(name: "q", scope: !919, file: !9, line: 282, type: !24)
!1088 = !DILocation(line: 327, column: 11, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1086, file: !9, line: 327, column: 11)
!1090 = !DILocation(line: 327, column: 29, scope: !1089)
!1091 = !DILocation(line: 327, column: 11, scope: !1086)
!1092 = !DILocation(line: 328, column: 12, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1089, file: !9, line: 327, column: 61)
!1094 = !DILocation(line: 329, column: 7, scope: !1093)
!1095 = !DILocation(line: 329, column: 17, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1097, file: !9, line: 331, column: 7)
!1097 = distinct !DILexicalBlock(scope: !1086, file: !9, line: 330, column: 7)
!1098 = !DILocalVariable(name: "tmp___6", scope: !919, file: !9, line: 301, type: !27)
!1099 = !DILocation(line: 329, column: 19, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1086, file: !9, line: 329, column: 11)
!1101 = !DILocation(line: 329, column: 11, scope: !1086)
!1102 = !DILocation(line: 331, column: 7, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1100, file: !9, line: 329, column: 25)
!1104 = !DILocation(line: 331, column: 19, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1106, file: !9, line: 333, column: 9)
!1106 = distinct !DILexicalBlock(scope: !1107, file: !9, line: 332, column: 9)
!1107 = distinct !DILexicalBlock(scope: !1100, file: !9, line: 331, column: 14)
!1108 = !DILocalVariable(name: "tmp___5", scope: !919, file: !9, line: 300, type: !27)
!1109 = !DILocation(line: 331, column: 21, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1107, file: !9, line: 331, column: 13)
!1111 = !DILocation(line: 331, column: 13, scope: !1107)
!1112 = !DILocation(line: 333, column: 9, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1110, file: !9, line: 331, column: 27)
!1114 = !DILocation(line: 333, column: 21, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1116, file: !9, line: 335, column: 11)
!1116 = distinct !DILexicalBlock(scope: !1117, file: !9, line: 334, column: 11)
!1117 = distinct !DILexicalBlock(scope: !1110, file: !9, line: 333, column: 16)
!1118 = !DILocalVariable(name: "tmp___4", scope: !919, file: !9, line: 299, type: !27)
!1119 = !DILocation(line: 333, column: 23, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1117, file: !9, line: 333, column: 15)
!1121 = !DILocation(line: 333, column: 15, scope: !1117)
!1122 = !DILocation(line: 335, column: 11, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1120, file: !9, line: 333, column: 29)
!1124 = !DILocation(line: 335, column: 23, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1126, file: !9, line: 337, column: 13)
!1126 = distinct !DILexicalBlock(scope: !1127, file: !9, line: 336, column: 13)
!1127 = distinct !DILexicalBlock(scope: !1120, file: !9, line: 335, column: 18)
!1128 = !DILocalVariable(name: "tmp___3", scope: !919, file: !9, line: 298, type: !27)
!1129 = !DILocation(line: 335, column: 25, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1127, file: !9, line: 335, column: 17)
!1131 = !DILocation(line: 335, column: 17, scope: !1127)
!1132 = !DILocation(line: 337, column: 13, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1130, file: !9, line: 335, column: 31)
!1134 = !DILocation(line: 337, column: 25, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1136, file: !9, line: 339, column: 15)
!1136 = distinct !DILexicalBlock(scope: !1137, file: !9, line: 338, column: 15)
!1137 = distinct !DILexicalBlock(scope: !1130, file: !9, line: 337, column: 20)
!1138 = !DILocalVariable(name: "tmp___2", scope: !919, file: !9, line: 297, type: !27)
!1139 = !DILocation(line: 337, column: 27, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1137, file: !9, line: 337, column: 19)
!1141 = !DILocation(line: 337, column: 19, scope: !1137)
!1142 = !DILocation(line: 339, column: 15, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1140, file: !9, line: 337, column: 33)
!1144 = !DILocation(line: 0, scope: !1130)
!1145 = !DILocation(line: 0, scope: !1120)
!1146 = !DILocation(line: 0, scope: !1110)
!1147 = !DILocation(line: 0, scope: !1100)
!1148 = !DILocation(line: 344, column: 5, scope: !1086)
!1149 = !DILocation(line: 343, column: 17, scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !1151, file: !9, line: 346, column: 7)
!1151 = distinct !DILexicalBlock(scope: !1152, file: !9, line: 345, column: 7)
!1152 = distinct !DILexicalBlock(scope: !1079, file: !9, line: 344, column: 12)
!1153 = !DILocalVariable(name: "tmp___7", scope: !919, file: !9, line: 302, type: !32)
!1154 = !DILocation(line: 343, column: 13, scope: !1151)
!1155 = !DILocation(line: 344, column: 7, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1157, file: !9, line: 346, column: 7)
!1157 = distinct !DILexicalBlock(scope: !1152, file: !9, line: 345, column: 7)
!1158 = !DILocation(line: 0, scope: !1152)
!1159 = !DILocation(line: 344, column: 17, scope: !1156)
!1160 = !DILocation(line: 345, column: 11, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1156, file: !9, line: 344, column: 17)
!1162 = !DILocation(line: 344, column: 22, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1161, file: !9, line: 344, column: 13)
!1164 = !DILocation(line: 344, column: 16, scope: !1163)
!1165 = !DILocation(line: 344, column: 25, scope: !1163)
!1166 = !DILocation(line: 344, column: 13, scope: !1161)
!1167 = !DILocation(line: 344, column: 24, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1169, file: !9, line: 344, column: 15)
!1169 = distinct !DILexicalBlock(scope: !1163, file: !9, line: 344, column: 33)
!1170 = !DILocation(line: 344, column: 18, scope: !1168)
!1171 = !DILocation(line: 344, column: 27, scope: !1168)
!1172 = !DILocation(line: 344, column: 15, scope: !1169)
!1173 = !DILocation(line: 344, column: 26, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1175, file: !9, line: 344, column: 17)
!1175 = distinct !DILexicalBlock(scope: !1168, file: !9, line: 344, column: 34)
!1176 = !DILocation(line: 344, column: 20, scope: !1174)
!1177 = !DILocation(line: 344, column: 29, scope: !1174)
!1178 = !DILocation(line: 344, column: 17, scope: !1175)
!1179 = !DILocation(line: 344, column: 28, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1181, file: !9, line: 344, column: 19)
!1181 = distinct !DILexicalBlock(scope: !1174, file: !9, line: 344, column: 37)
!1182 = !DILocation(line: 344, column: 22, scope: !1180)
!1183 = !DILocation(line: 344, column: 31, scope: !1180)
!1184 = !DILocation(line: 344, column: 19, scope: !1181)
!1185 = !DILocation(line: 344, column: 17, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1180, file: !9, line: 344, column: 39)
!1187 = !DILocation(line: 346, column: 13, scope: !1181)
!1188 = !DILocation(line: 347, column: 11, scope: !1175)
!1189 = !DILocation(line: 348, column: 9, scope: !1169)
!1190 = distinct !{!1190, !1155, !1191}
!1191 = !DILocation(line: 349, column: 7, scope: !1156)
!1192 = !DILocation(line: 351, column: 7, scope: !1156)
!1193 = !DILocation(line: 347, column: 9, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1152, file: !9, line: 354, column: 7)
!1195 = !DILocation(line: 347, column: 10, scope: !1194)
!1196 = !DILocation(line: 349, column: 17, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1194, file: !9, line: 348, column: 7)
!1198 = !DILocalVariable(name: "tmp___8", scope: !919, file: !9, line: 303, type: !31)
!1199 = !DILocation(line: 349, column: 14, scope: !1194)
!1200 = !DILocalVariable(name: "item", scope: !919, file: !9, line: 283, type: !38)
!1201 = !DILocation(line: 350, column: 11, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1152, file: !9, line: 350, column: 11)
!1203 = !DILocation(line: 350, column: 32, scope: !1202)
!1204 = !DILocation(line: 350, column: 11, scope: !1152)
!1205 = !DILocation(line: 351, column: 9, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1207, file: !9, line: 352, column: 9)
!1207 = distinct !DILexicalBlock(scope: !1208, file: !9, line: 351, column: 9)
!1208 = distinct !DILexicalBlock(scope: !1202, file: !9, line: 350, column: 64)
!1209 = !DILocation(line: 351, column: 19, scope: !1206)
!1210 = !DILocation(line: 351, column: 44, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1212, file: !9, line: 355, column: 11)
!1212 = distinct !DILexicalBlock(scope: !1213, file: !9, line: 354, column: 11)
!1213 = distinct !DILexicalBlock(scope: !1206, file: !9, line: 351, column: 19)
!1214 = !DILocation(line: 351, column: 11, scope: !1211)
!1215 = !DILocation(line: 351, column: 11, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !1212, file: !9, line: 353, column: 11)
!1217 = !DILocation(line: 354, column: 9, scope: !1206)
!1218 = !DILocation(line: 357, column: 7, scope: !1208)
!1219 = !DILocation(line: 352, column: 17, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1221, file: !9, line: 359, column: 7)
!1221 = distinct !DILexicalBlock(scope: !1152, file: !9, line: 358, column: 7)
!1222 = !DILocalVariable(name: "tmp___9", scope: !919, file: !9, line: 304, type: !24)
!1223 = !DILocation(line: 352, column: 13, scope: !1221)
!1224 = !DILocation(line: 352, column: 18, scope: !1221)
!1225 = !DILocation(line: 353, column: 33, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1152, file: !9, line: 353, column: 11)
!1227 = !DILocation(line: 353, column: 11, scope: !1226)
!1228 = !DILocation(line: 353, column: 38, scope: !1226)
!1229 = !DILocation(line: 353, column: 11, scope: !1152)
!1230 = !DILocation(line: 354, column: 9, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1232, file: !9, line: 355, column: 9)
!1232 = distinct !DILexicalBlock(scope: !1233, file: !9, line: 354, column: 9)
!1233 = distinct !DILexicalBlock(scope: !1226, file: !9, line: 353, column: 70)
!1234 = !DILocation(line: 354, column: 19, scope: !1231)
!1235 = !DILocation(line: 354, column: 44, scope: !1236)
!1236 = distinct !DILexicalBlock(scope: !1237, file: !9, line: 358, column: 11)
!1237 = distinct !DILexicalBlock(scope: !1238, file: !9, line: 357, column: 11)
!1238 = distinct !DILexicalBlock(scope: !1231, file: !9, line: 354, column: 19)
!1239 = !DILocation(line: 354, column: 11, scope: !1236)
!1240 = !DILocation(line: 354, column: 11, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1237, file: !9, line: 356, column: 11)
!1242 = !DILocation(line: 357, column: 9, scope: !1231)
!1243 = !DILocation(line: 360, column: 7, scope: !1233)
!1244 = !DILocation(line: 356, column: 38, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1152, file: !9, line: 356, column: 11)
!1246 = !DILocation(line: 356, column: 11, scope: !1152)
!1247 = !DILocation(line: 357, column: 15, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1245, file: !9, line: 356, column: 45)
!1249 = !DILocation(line: 357, column: 20, scope: !1248)
!1250 = !DILocation(line: 359, column: 7, scope: !1248)
!1251 = !DILocation(line: 359, column: 38, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1245, file: !9, line: 359, column: 11)
!1253 = !DILocation(line: 359, column: 11, scope: !1245)
!1254 = !DILocation(line: 360, column: 15, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1252, file: !9, line: 359, column: 45)
!1256 = !DILocation(line: 360, column: 20, scope: !1255)
!1257 = !DILocation(line: 362, column: 7, scope: !1255)
!1258 = !DILocation(line: 362, column: 38, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1252, file: !9, line: 362, column: 11)
!1260 = !DILocation(line: 362, column: 11, scope: !1252)
!1261 = !DILocation(line: 363, column: 15, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1259, file: !9, line: 362, column: 45)
!1263 = !DILocation(line: 363, column: 20, scope: !1262)
!1264 = !DILocation(line: 365, column: 7, scope: !1262)
!1265 = !DILocation(line: 365, column: 38, scope: !1266)
!1266 = distinct !DILexicalBlock(scope: !1259, file: !9, line: 365, column: 11)
!1267 = !DILocation(line: 365, column: 11, scope: !1259)
!1268 = !DILocation(line: 366, column: 15, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1266, file: !9, line: 365, column: 45)
!1270 = !DILocation(line: 366, column: 20, scope: !1269)
!1271 = !DILocation(line: 368, column: 7, scope: !1269)
!1272 = !DILocation(line: 368, column: 38, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1266, file: !9, line: 368, column: 11)
!1274 = !DILocation(line: 368, column: 11, scope: !1266)
!1275 = !DILocation(line: 369, column: 15, scope: !1276)
!1276 = distinct !DILexicalBlock(scope: !1273, file: !9, line: 368, column: 45)
!1277 = !DILocation(line: 369, column: 20, scope: !1276)
!1278 = !DILocation(line: 371, column: 7, scope: !1276)
!1279 = distinct !{!1279, !1001, !1280}
!1280 = !DILocation(line: 373, column: 3, scope: !1002)
!1281 = !DILocation(line: 375, column: 3, scope: !1002)
!1282 = !DILocation(line: 374, column: 3, scope: !1283)
!1283 = distinct !DILexicalBlock(scope: !1284, file: !9, line: 379, column: 3)
!1284 = distinct !DILexicalBlock(scope: !973, file: !9, line: 378, column: 3)
!1285 = !DILocation(line: 376, column: 10, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1284, file: !9, line: 376, column: 3)
!1287 = !DILocalVariable(name: "rets", scope: !919, file: !9, line: 284, type: !38)
!1288 = !DILocation(line: 377, column: 3, scope: !1289)
!1289 = distinct !DILexicalBlock(scope: !1284, file: !9, line: 378, column: 3)
!1290 = !DILocation(line: 378, column: 3, scope: !1291)
!1291 = distinct !DILexicalBlock(scope: !1284, file: !9, line: 379, column: 3)
!1292 = !DILocation(line: 379, column: 3, scope: !1293)
!1293 = distinct !DILexicalBlock(scope: !1284, file: !9, line: 380, column: 3)
!1294 = !DILocation(line: 380, column: 3, scope: !1295)
!1295 = distinct !DILexicalBlock(scope: !1284, file: !9, line: 381, column: 3)
!1296 = !DILocation(line: 381, column: 3, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !1284, file: !9, line: 382, column: 3)
!1298 = !DILocation(line: 382, column: 3, scope: !973)
!1299 = !DILocation(line: 384, column: 1, scope: !919)
!1300 = distinct !DISubprogram(name: "backup_files", scope: !9, file: !9, line: 385, type: !378, scopeLine: 386, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !5, retainedNodes: !181)
!1301 = !DILocalVariable(name: "file_list", arg: 1, scope: !1300, file: !9, line: 385, type: !38)
!1302 = !DILocation(line: 0, scope: !1300)
!1303 = !DILocalVariable(name: "path", scope: !1300, file: !9, line: 388, type: !923)
!1304 = !DILocation(line: 388, column: 8, scope: !1300)
!1305 = !DILocalVariable(name: "__cil_tmp6", scope: !1300, file: !9, line: 391, type: !31)
!1306 = !DILocation(line: 391, column: 9, scope: !1300)
!1307 = !DILocalVariable(name: "__cil_tmp7", scope: !1300, file: !9, line: 392, type: !24)
!1308 = !DILocation(line: 392, column: 9, scope: !1300)
!1309 = !DILocalVariable(name: "__cil_tmp8", scope: !1300, file: !9, line: 393, type: !24)
!1310 = !DILocation(line: 393, column: 9, scope: !1300)
!1311 = !DILocalVariable(name: "__cil_tmp9", scope: !1300, file: !9, line: 394, type: !24)
!1312 = !DILocation(line: 394, column: 9, scope: !1300)
!1313 = !DILocalVariable(name: "__cil_tmp10", scope: !1300, file: !9, line: 395, type: !24)
!1314 = !DILocation(line: 395, column: 9, scope: !1300)
!1315 = !DILocalVariable(name: "__cil_tmp11", scope: !1300, file: !9, line: 396, type: !24)
!1316 = !DILocation(line: 396, column: 9, scope: !1300)
!1317 = !DILocation(line: 392, column: 3, scope: !1318)
!1318 = distinct !DILexicalBlock(scope: !1319, file: !9, line: 400, column: 3)
!1319 = distinct !DILexicalBlock(scope: !1320, file: !9, line: 399, column: 3)
!1320 = distinct !DILexicalBlock(scope: !1300, file: !9, line: 398, column: 3)
!1321 = !DILocation(line: 392, column: 13, scope: !1318)
!1322 = !DILocation(line: 392, column: 12, scope: !1323)
!1323 = distinct !DILexicalBlock(scope: !1324, file: !9, line: 392, column: 9)
!1324 = distinct !DILexicalBlock(scope: !1318, file: !9, line: 392, column: 13)
!1325 = !DILocation(line: 392, column: 38, scope: !1323)
!1326 = !DILocation(line: 392, column: 9, scope: !1324)
!1327 = !DILocation(line: 392, column: 7, scope: !1328)
!1328 = distinct !DILexicalBlock(scope: !1323, file: !9, line: 392, column: 71)
!1329 = !DILocation(line: 394, column: 45, scope: !1330)
!1330 = distinct !DILexicalBlock(scope: !1331, file: !9, line: 395, column: 5)
!1331 = distinct !DILexicalBlock(scope: !1324, file: !9, line: 394, column: 5)
!1332 = !DILocation(line: 395, column: 39, scope: !1330)
!1333 = !DILocation(line: 394, column: 11, scope: !1330)
!1334 = !DILocalVariable(name: "ret", scope: !1300, file: !9, line: 387, type: !27)
!1335 = !DILocation(line: 395, column: 9, scope: !1336)
!1336 = distinct !DILexicalBlock(scope: !1324, file: !9, line: 395, column: 9)
!1337 = !DILocation(line: 395, column: 29, scope: !1336)
!1338 = !DILocation(line: 395, column: 9, scope: !1324)
!1339 = !DILocation(line: 396, column: 40, scope: !1340)
!1340 = distinct !DILexicalBlock(scope: !1341, file: !9, line: 397, column: 7)
!1341 = distinct !DILexicalBlock(scope: !1342, file: !9, line: 396, column: 7)
!1342 = distinct !DILexicalBlock(scope: !1336, file: !9, line: 395, column: 46)
!1343 = !DILocation(line: 396, column: 7, scope: !1340)
!1344 = !DILocation(line: 397, column: 7, scope: !1345)
!1345 = distinct !DILexicalBlock(scope: !1341, file: !9, line: 398, column: 7)
!1346 = !DILocation(line: 399, column: 28, scope: !1347)
!1347 = distinct !DILexicalBlock(scope: !1348, file: !9, line: 402, column: 5)
!1348 = distinct !DILexicalBlock(scope: !1324, file: !9, line: 401, column: 5)
!1349 = !DILocation(line: 399, column: 5, scope: !1347)
!1350 = !DILocation(line: 400, column: 56, scope: !1351)
!1351 = distinct !DILexicalBlock(scope: !1348, file: !9, line: 401, column: 5)
!1352 = !DILocation(line: 400, column: 79, scope: !1351)
!1353 = !DILocation(line: 400, column: 15, scope: !1351)
!1354 = !DILocalVariable(name: "tmp___0", scope: !1300, file: !9, line: 390, type: !27)
!1355 = !DILocation(line: 400, column: 17, scope: !1356)
!1356 = distinct !DILexicalBlock(scope: !1324, file: !9, line: 400, column: 9)
!1357 = !DILocation(line: 400, column: 9, scope: !1324)
!1358 = !DILocation(line: 401, column: 7, scope: !1359)
!1359 = distinct !DILexicalBlock(scope: !1360, file: !9, line: 402, column: 7)
!1360 = distinct !DILexicalBlock(scope: !1361, file: !9, line: 401, column: 7)
!1361 = distinct !DILexicalBlock(scope: !1356, file: !9, line: 400, column: 24)
!1362 = !DILocation(line: 401, column: 17, scope: !1359)
!1363 = !DILocation(line: 401, column: 15, scope: !1364)
!1364 = distinct !DILexicalBlock(scope: !1365, file: !9, line: 405, column: 9)
!1365 = distinct !DILexicalBlock(scope: !1366, file: !9, line: 404, column: 9)
!1366 = distinct !DILexicalBlock(scope: !1359, file: !9, line: 401, column: 17)
!1367 = !DILocalVariable(name: "tmp", scope: !1300, file: !9, line: 389, type: !159)
!1368 = !DILocation(line: 401, column: 42, scope: !1369)
!1369 = distinct !DILexicalBlock(scope: !1365, file: !9, line: 403, column: 9)
!1370 = !DILocation(line: 402, column: 75, scope: !1369)
!1371 = !DILocation(line: 401, column: 9, scope: !1369)
!1372 = !DILocation(line: 401, column: 9, scope: !1373)
!1373 = distinct !DILexicalBlock(scope: !1365, file: !9, line: 404, column: 9)
!1374 = !DILocation(line: 404, column: 7, scope: !1359)
!1375 = !DILocation(line: 407, column: 5, scope: !1361)
!1376 = !DILocation(line: 403, column: 28, scope: !1324)
!1377 = distinct !{!1377, !1317, !1378}
!1378 = !DILocation(line: 404, column: 3, scope: !1318)
!1379 = !DILocation(line: 406, column: 3, scope: !1318)
!1380 = !DILocation(line: 405, column: 3, scope: !1320)
!1381 = distinct !DISubprogram(name: "add_warning_cc_to_files", scope: !9, file: !9, line: 652, type: !1382, scopeLine: 654, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !5, retainedNodes: !181)
!1382 = !DISubroutineType(types: !1383)
!1383 = !{!27, !38, !27, !1384, !1384}
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!1385 = !DILocalVariable(name: "file_list", arg: 1, scope: !1381, file: !9, line: 652, type: !38)
!1386 = !DILocation(line: 0, scope: !1381)
!1387 = !DILocalVariable(name: "fast_mode", arg: 2, scope: !1381, file: !9, line: 652, type: !27)
