; ModuleID = '/tmp/tmp.ll'
source_filename = "c/time-1.7.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i32, [44 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.__anonstruct_RESUSE_37 = type { i32, %struct.rusage, %struct.timeval, %struct.timeval }
%struct.rusage = type { %struct.timeval, %struct.timeval, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.timeval = type { i64, i64 }
%struct.timezone = type { i32, i32 }
%union.wait = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%union.__anonunion___u_55 = type { i32 }
%union.__anonunion___u_56 = type { i32 }
%union.__anonunion___u_57 = type { i32 }
%union.__anonunion___u_58 = type { i32 }
%union.__anonunion___u_59 = type { i32 }
%union.__anonunion___u_60 = type { i32 }
%union.__anonunion___u_47 = type { i32 }
%union.__anonunion___u_48 = type { i32 }
%union.__anonunion___u_49 = type { i32 }
%union.__anonunion___u_50 = type { i32 }
%union.__anonunion___u_51 = type { i32 }
%union.__anonunion___u_52 = type { i32 }
%union.__anonunion___u_53 = type { i32 }
%union.__anonunion___u_54 = type { i32 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "version_string", scope: !2, file: !172, line: 1, type: !100, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !127, nameTableKind: GNU)
!3 = !DIFile(filename: "c/time-1.7.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__anonenum_boolean_46", file: !6, line: 100, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/abs/pronto/test-suite/time-1.7/time.c", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!11 = !{!12, !22, !29, !45, !100, !102, !93, !103, !105, !106, !114, !53, !116, !27, !117, !54, !119, !122, !125, !19}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !14, line: 69, size: 128, elements: !15)
!14 = !DIFile(filename: "/usr/include/bits/time.h", directory: "")
!15 = !{!16, !20}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !13, file: !14, line: 70, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !18, line: 151, baseType: !19)
!18 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!19 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !13, file: !14, line: 71, baseType: !21, size: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !18, line: 153, baseType: !19)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timezone", file: !24, line: 56, size: 64, elements: !25)
!24 = !DIFile(filename: "/usr/include/sys/time.h", directory: "")
!25 = !{!26, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "tz_minuteswest", scope: !23, file: !24, line: 57, baseType: !27, size: 32)
!27 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tz_dsttime", scope: !23, file: !24, line: 58, baseType: !27, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "wait", file: !31, line: 65, size: 32, elements: !32)
!31 = !DIFile(filename: "/usr/include/bits/waitstatus.h", directory: "")
!32 = !{!33, !34, !40}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "w_status", scope: !30, file: !31, line: 66, baseType: !27, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__wait_terminated", scope: !30, file: !31, line: 67, baseType: !35, size: 32)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct___wait_terminated_29", file: !31, line: 65, size: 32, elements: !36)
!36 = !{!37, !38, !39}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__w_termsig", scope: !35, file: !31, line: 66, baseType: !7, size: 7, flags: DIFlagBitField, extraData: i64 0)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__w_coredump", scope: !35, file: !31, line: 67, baseType: !7, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__w_retcode", scope: !35, file: !31, line: 68, baseType: !7, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__wait_stopped", scope: !30, file: !31, line: 68, baseType: !41, size: 32)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct___wait_stopped_30", file: !31, line: 65, size: 32, elements: !42)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__w_stopval", scope: !41, file: !31, line: 66, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "__w_stopsig", scope: !41, file: !31, line: 67, baseType: !7, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !47, line: 46, baseType: !48)
!47 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !49, line: 264, size: 1728, elements: !50)
!49 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!50 = !{!51, !52, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !73, !74, !75, !76, !78, !80, !82, !86, !89, !92, !94, !95, !96}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !48, file: !49, line: 265, baseType: !27, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !48, file: !49, line: 266, baseType: !53, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !48, file: !49, line: 267, baseType: !53, size: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !48, file: !49, line: 268, baseType: !53, size: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !48, file: !49, line: 269, baseType: !53, size: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !48, file: !49, line: 270, baseType: !53, size: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !48, file: !49, line: 271, baseType: !53, size: 64, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !48, file: !49, line: 272, baseType: !53, size: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !48, file: !49, line: 273, baseType: !53, size: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !48, file: !49, line: 274, baseType: !53, size: 64, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !48, file: !49, line: 275, baseType: !53, size: 64, offset: 640)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !48, file: !49, line: 276, baseType: !53, size: 64, offset: 704)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !48, file: !49, line: 277, baseType: !66, size: 64, offset: 768)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !49, line: 179, size: 192, elements: !68)
!68 = !{!69, !70, !72}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !67, file: !49, line: 180, baseType: !66, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !67, file: !49, line: 181, baseType: !71, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !67, file: !49, line: 182, baseType: !27, size: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !48, file: !49, line: 278, baseType: !71, size: 64, offset: 832)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !48, file: !49, line: 279, baseType: !27, size: 32, offset: 896)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !48, file: !49, line: 280, baseType: !27, size: 32, offset: 928)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !48, file: !49, line: 281, baseType: !77, size: 64, offset: 960)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !18, line: 143, baseType: !19)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !48, file: !49, line: 282, baseType: !79, size: 16, offset: 1024)
!79 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !48, file: !49, line: 283, baseType: !81, size: 8, offset: 1040)
!81 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !48, file: !49, line: 284, baseType: !83, size: 8, offset: 1048)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 8, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 1)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !48, file: !49, line: 285, baseType: !87, size: 64, offset: 1088)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !49, line: 173, baseType: null)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !48, file: !49, line: 286, baseType: !90, size: 64, offset: 1152)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !18, line: 144, baseType: !91)
!91 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !48, file: !49, line: 287, baseType: !93, size: 64, offset: 1216)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !48, file: !49, line: 288, baseType: !93, size: 64, offset: 1280)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !48, file: !49, line: 289, baseType: !27, size: 32, offset: 1344)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !48, file: !49, line: 290, baseType: !97, size: 352, offset: 1376)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 352, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 44)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!102 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !6, line: 100, baseType: !5)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !109, line: 78, size: 256, elements: !110)
!109 = !DIFile(filename: "getopt.h", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!110 = !{!111, !112, !113, !115}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !108, file: !109, line: 79, baseType: !100, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !108, file: !109, line: 80, baseType: !27, size: 32, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !108, file: !109, line: 81, baseType: !114, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !108, file: !109, line: 82, baseType: !27, size: 32, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !118, line: 213, baseType: !7)
!118 = !DIFile(filename: "/usr/lib/gcc-lib/i486-linux/3.3.5/include/stddef.h", directory: "")
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !27}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{null, null}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!127 = !{!0, !128, !134, !136, !138, !140, !142, !144, !146, !148, !150, !152, !154, !156, !158, !163, !168, !170}
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !2, file: !130, line: 54, type: !131, isLocal: false, isDefinition: true)
!130 = !DIFile(filename: "/abs/pronto/test-suite/time-1.7/error.c", directory: "")
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null}
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "error_message_count", scope: !2, file: !130, line: 61, type: !7, isLocal: false, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "program_name", scope: !2, file: !6, line: 166, type: !53, isLocal: false, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !2, file: !130, line: 147, type: !27, isLocal: false, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "old_file_name", scope: !2, file: !130, line: 169, type: !100, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "old_line_number", scope: !2, file: !130, line: 170, type: !7, isLocal: true, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "outfp", scope: !2, file: !6, line: 157, type: !45, isLocal: true, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "output_format", scope: !2, file: !6, line: 163, type: !100, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "default_format", scope: !2, file: !6, line: 105, type: !126, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "posix_format", scope: !2, file: !6, line: 110, type: !126, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !6, line: 151, type: !105, isLocal: true, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "outfile", scope: !2, file: !6, line: 154, type: !100, isLocal: true, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "append", scope: !2, file: !6, line: 160, type: !105, isLocal: true, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !6, line: 168, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 2048, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 8)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "longstats", scope: !2, file: !6, line: 122, type: !165, isLocal: true, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 1536, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 24)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "ps", scope: !2, file: !6, line: 255, type: !102, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "size", scope: !2, file: !6, line: 257, type: !19, isLocal: true, isDefinition: true)
!172 = !DIFile(filename: "/abs/pronto/test-suite/time-1.7/version.c", directory: "")
!173 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!174 = !{i32 2, !"Dwarf Version", i32 4}
!175 = !{i32 2, !"Debug Info Version", i32 3}
!176 = !{i32 1, !"wchar_size", i32 4}
!177 = !{i32 7, !"PIC Level", i32 2}
!178 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!179 = distinct !DISubprogram(name: "resuse_start", scope: !180, file: !180, line: 46, type: !181, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !211)
!180 = !DIFile(filename: "/abs/pronto/test-suite/time-1.7/resuse.c", directory: "")
!181 = !DISubroutineType(types: !182)
!182 = !{null, !183}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESUSE", file: !185, line: 56, baseType: !186)
!185 = !DIFile(filename: "/abs/pronto/test-suite/time-1.7/resuse.h", directory: "")
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_RESUSE_37", file: !185, line: 56, size: 1472, elements: !187)
!187 = !{!188, !189, !209, !210}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "waitstatus", scope: !186, file: !185, line: 57, baseType: !27, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ru", scope: !186, file: !185, line: 58, baseType: !190, size: 1152, offset: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage", file: !191, line: 153, size: 1152, elements: !192)
!191 = !DIFile(filename: "/usr/include/bits/resource.h", directory: "")
!192 = !{!193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ru_utime", scope: !190, file: !191, line: 154, baseType: !13, size: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ru_stime", scope: !190, file: !191, line: 155, baseType: !13, size: 128, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ru_maxrss", scope: !190, file: !191, line: 156, baseType: !19, size: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ru_ixrss", scope: !190, file: !191, line: 157, baseType: !19, size: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ru_idrss", scope: !190, file: !191, line: 158, baseType: !19, size: 64, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ru_isrss", scope: !190, file: !191, line: 159, baseType: !19, size: 64, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ru_minflt", scope: !190, file: !191, line: 160, baseType: !19, size: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ru_majflt", scope: !190, file: !191, line: 161, baseType: !19, size: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nswap", scope: !190, file: !191, line: 162, baseType: !19, size: 64, offset: 640)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ru_inblock", scope: !190, file: !191, line: 163, baseType: !19, size: 64, offset: 704)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ru_oublock", scope: !190, file: !191, line: 164, baseType: !19, size: 64, offset: 768)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgsnd", scope: !190, file: !191, line: 165, baseType: !19, size: 64, offset: 832)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgrcv", scope: !190, file: !191, line: 166, baseType: !19, size: 64, offset: 896)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nsignals", scope: !190, file: !191, line: 167, baseType: !19, size: 64, offset: 960)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nvcsw", scope: !190, file: !191, line: 168, baseType: !19, size: 64, offset: 1024)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nivcsw", scope: !190, file: !191, line: 169, baseType: !19, size: 64, offset: 1088)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !186, file: !185, line: 59, baseType: !13, size: 128, offset: 1216)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !186, file: !185, line: 60, baseType: !13, size: 128, offset: 1344)
!211 = !{}
!212 = !DILocalVariable(name: "resp", arg: 1, scope: !179, file: !180, line: 46, type: !183)
!213 = !DILocation(line: 0, scope: !179)
!214 = !DILocation(line: 51, column: 60, scope: !215)
!215 = distinct !DILexicalBlock(scope: !216, file: !180, line: 51, column: 3)
!216 = distinct !DILexicalBlock(scope: !179, file: !180, line: 50, column: 3)
!217 = !DILocation(line: 51, column: 3, scope: !215)
!218 = !DILocation(line: 60, column: 3, scope: !216)
!219 = distinct !DISubprogram(name: "resuse_end", scope: !180, file: !180, line: 67, type: !220, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !211)
!220 = !DISubroutineType(types: !221)
!221 = !{!27, !222, !183}
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !223, line: 100, baseType: !224)
!223 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !18, line: 145, baseType: !27)
!225 = !DILocalVariable(name: "pid", arg: 1, scope: !219, file: !180, line: 67, type: !222)
!226 = !DILocation(line: 0, scope: !219)
!227 = !DILocalVariable(name: "resp", arg: 2, scope: !219, file: !180, line: 67, type: !183)
!228 = !DILocalVariable(name: "status", scope: !219, file: !180, line: 69, type: !27)
!229 = !DILocation(line: 69, column: 7, scope: !219)
!230 = !DILocation(line: 83, column: 3, scope: !231)
!231 = distinct !DILexicalBlock(scope: !232, file: !180, line: 73, column: 3)
!232 = distinct !DILexicalBlock(scope: !219, file: !180, line: 72, column: 3)
!233 = !DILocation(line: 83, column: 13, scope: !231)
!234 = !DILocation(line: 83, column: 20, scope: !235)
!235 = distinct !DILexicalBlock(scope: !236, file: !180, line: 85, column: 5)
!236 = distinct !DILexicalBlock(scope: !231, file: !180, line: 83, column: 13)
!237 = !DILocation(line: 83, column: 57, scope: !235)
!238 = !DILocation(line: 83, column: 14, scope: !235)
!239 = !DILocalVariable(name: "caught", scope: !219, file: !180, line: 70, type: !222)
!240 = !DILocation(line: 83, column: 19, scope: !241)
!241 = distinct !DILexicalBlock(scope: !236, file: !180, line: 83, column: 9)
!242 = !DILocation(line: 83, column: 9, scope: !236)
!243 = !DILocation(line: 83, column: 7, scope: !244)
!244 = distinct !DILexicalBlock(scope: !241, file: !180, line: 83, column: 28)
!245 = !DILocation(line: 85, column: 16, scope: !246)
!246 = distinct !DILexicalBlock(scope: !236, file: !180, line: 85, column: 9)
!247 = !DILocation(line: 85, column: 9, scope: !236)
!248 = !DILocation(line: 86, column: 7, scope: !249)
!249 = distinct !DILexicalBlock(scope: !246, file: !180, line: 85, column: 23)
!250 = distinct !{!250, !230, !251}
!251 = !DILocation(line: 88, column: 3, scope: !231)
!252 = !DILocation(line: 89, column: 60, scope: !253)
!253 = distinct !DILexicalBlock(scope: !232, file: !180, line: 91, column: 3)
!254 = !DILocation(line: 89, column: 3, scope: !253)
!255 = !DILocation(line: 117, column: 33, scope: !253)
!256 = !DILocation(line: 117, column: 39, scope: !253)
!257 = !DILocation(line: 117, column: 9, scope: !253)
!258 = !DILocation(line: 117, column: 17, scope: !253)
!259 = !DILocation(line: 117, column: 24, scope: !253)
!260 = !DILocation(line: 118, column: 13, scope: !261)
!261 = distinct !DILexicalBlock(scope: !232, file: !180, line: 118, column: 7)
!262 = !DILocation(line: 118, column: 21, scope: !261)
!263 = !DILocation(line: 118, column: 37, scope: !261)
!264 = !DILocation(line: 118, column: 43, scope: !261)
!265 = !DILocation(line: 118, column: 29, scope: !261)
!266 = !DILocation(line: 118, column: 7, scope: !232)
!267 = !DILocation(line: 121, column: 11, scope: !268)
!268 = distinct !DILexicalBlock(scope: !261, file: !180, line: 118, column: 52)
!269 = !DILocation(line: 121, column: 19, scope: !268)
!270 = !DILocation(line: 121, column: 27, scope: !268)
!271 = !DILocation(line: 122, column: 12, scope: !268)
!272 = !DILocation(line: 122, column: 20, scope: !268)
!273 = !DILocation(line: 122, column: 28, scope: !268)
!274 = !DILocation(line: 123, column: 3, scope: !268)
!275 = !DILocation(line: 124, column: 34, scope: !232)
!276 = !DILocation(line: 124, column: 40, scope: !232)
!277 = !DILocation(line: 124, column: 9, scope: !232)
!278 = !DILocation(line: 124, column: 17, scope: !232)
!279 = !DILocation(line: 124, column: 25, scope: !232)
!280 = !DILocation(line: 126, column: 22, scope: !232)
!281 = !DILocation(line: 126, column: 9, scope: !232)
!282 = !DILocation(line: 126, column: 20, scope: !232)
!283 = !DILocation(line: 128, column: 3, scope: !232)
!284 = !DILocation(line: 0, scope: !232)
!285 = !DILocation(line: 130, column: 1, scope: !219)
!286 = distinct !DISubprogram(name: "error", scope: !130, file: !130, line: 101, type: !287, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !211)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !27, !27, !100, null}
!289 = !DILocalVariable(name: "status", arg: 1, scope: !286, file: !130, line: 101, type: !27)
!290 = !DILocation(line: 0, scope: !286)
!291 = !DILocalVariable(name: "errnum", arg: 2, scope: !286, file: !130, line: 101, type: !27)
!292 = !DILocalVariable(name: "message", arg: 3, scope: !286, file: !130, line: 101, type: !100)
!293 = !DILocalVariable(name: "args", scope: !286, file: !130, line: 103, type: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !295, line: 105, baseType: !296)
!295 = !DIFile(filename: "/usr/lib/gcc-lib/i486-linux/3.3.5/include/stdarg.h", directory: "")
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !295, line: 43, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 103, baseType: !298)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 192, elements: !84)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 103, size: 192, elements: !300)
!300 = !{!301, !302, !303, !304}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !299, file: !3, line: 103, baseType: !7, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !299, file: !3, line: 103, baseType: !7, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !299, file: !3, line: 103, baseType: !93, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !299, file: !3, line: 103, baseType: !93, size: 64, offset: 128)
!305 = !DILocation(line: 103, column: 11, scope: !286)
!306 = !DILocation(line: 116, column: 7, scope: !307)
!307 = distinct !DILexicalBlock(scope: !308, file: !130, line: 116, column: 7)
!308 = distinct !DILexicalBlock(scope: !286, file: !130, line: 106, column: 3)
!309 = !DILocation(line: 116, column: 7, scope: !308)
!310 = !DILocation(line: 117, column: 7, scope: !311)
!311 = distinct !DILexicalBlock(scope: !312, file: !130, line: 117, column: 5)
!312 = distinct !DILexicalBlock(scope: !307, file: !130, line: 116, column: 29)
!313 = !DILocation(line: 117, column: 5, scope: !311)
!314 = !DILocation(line: 119, column: 3, scope: !312)
!315 = !DILocation(line: 120, column: 12, scope: !316)
!316 = distinct !DILexicalBlock(scope: !317, file: !130, line: 120, column: 5)
!317 = distinct !DILexicalBlock(scope: !307, file: !130, line: 119, column: 10)
!318 = !DILocation(line: 120, column: 5, scope: !316)
!319 = !DILocation(line: 121, column: 38, scope: !316)
!320 = !DILocation(line: 122, column: 13, scope: !316)
!321 = !DILocation(line: 121, column: 5, scope: !316)
!322 = !DILocation(line: 125, column: 3, scope: !323)
!323 = distinct !DILexicalBlock(scope: !308, file: !130, line: 125, column: 3)
!324 = !DILocation(line: 127, column: 37, scope: !323)
!325 = !DILocation(line: 128, column: 12, scope: !323)
!326 = !DILocation(line: 127, column: 3, scope: !323)
!327 = !DILocation(line: 131, column: 3, scope: !323)
!328 = !DILocation(line: 136, column: 23, scope: !323)
!329 = !DILocation(line: 137, column: 7, scope: !330)
!330 = distinct !DILexicalBlock(scope: !308, file: !130, line: 137, column: 7)
!331 = !DILocation(line: 137, column: 7, scope: !308)
!332 = !DILocation(line: 138, column: 11, scope: !333)
!333 = distinct !DILexicalBlock(scope: !334, file: !130, line: 138, column: 5)
!334 = distinct !DILexicalBlock(scope: !330, file: !130, line: 137, column: 15)
!335 = !DILocalVariable(name: "tmp", scope: !286, file: !130, line: 104, type: !53)
!336 = !DILocation(line: 138, column: 38, scope: !333)
!337 = !DILocation(line: 138, column: 5, scope: !333)
!338 = !DILocation(line: 141, column: 3, scope: !334)
!339 = !DILocation(line: 139, column: 18, scope: !340)
!340 = distinct !DILexicalBlock(scope: !308, file: !130, line: 142, column: 3)
!341 = !DILocation(line: 139, column: 3, scope: !340)
!342 = !DILocation(line: 140, column: 10, scope: !340)
!343 = !DILocation(line: 140, column: 3, scope: !340)
!344 = !DILocation(line: 141, column: 7, scope: !345)
!345 = distinct !DILexicalBlock(scope: !308, file: !130, line: 141, column: 7)
!346 = !DILocation(line: 141, column: 7, scope: !308)
!347 = !DILocation(line: 142, column: 5, scope: !348)
!348 = distinct !DILexicalBlock(scope: !349, file: !130, line: 142, column: 5)
!349 = distinct !DILexicalBlock(scope: !345, file: !130, line: 141, column: 15)
!350 = !DILocation(line: 143, column: 3, scope: !308)
!351 = distinct !DISubprogram(name: "error_at_line", scope: !130, file: !130, line: 149, type: !352, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !211)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !27, !27, !100, !7, !100, null}
!354 = !DILocalVariable(name: "status", arg: 1, scope: !351, file: !130, line: 149, type: !27)
!355 = !DILocation(line: 0, scope: !351)
!356 = !DILocalVariable(name: "errnum", arg: 2, scope: !351, file: !130, line: 149, type: !27)
!357 = !DILocalVariable(name: "file_name", arg: 3, scope: !351, file: !130, line: 149, type: !100)
!358 = !DILocalVariable(name: "line_number", arg: 4, scope: !351, file: !130, line: 149, type: !7)
!359 = !DILocalVariable(name: "message", arg: 5, scope: !351, file: !130, line: 150, type: !100)
!360 = !DILocalVariable(name: "args", scope: !351, file: !130, line: 152, type: !294)
!361 = !DILocation(line: 152, column: 11, scope: !351)
!362 = !DILocation(line: 167, column: 7, scope: !363)
