; ModuleID = '/tmp/tmp.ll'
source_filename = "c/trueprint-5.3.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option_type = type { i8, i32, i32, i8, i32, %union.__anonunion_t_27 }
%union.__anonunion_t_27 = type { %struct.__anonstruct_oflg_36 }
%struct.__anonstruct_oflg_36 = type { i8*, i8*, i32, i8**, i32, i8*, i8*, void (i8*, i8*, i32, i8*, i8*)*, void (i32, i8*)*, i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.__anonstruct_function_entry_29 = type { [70 x i8], i64, i64, i64, i64, i32, i8* }
%struct.__anonstruct_file_entry_30 = type { i64, i64, i8*, i64 }
%struct.__anonstruct_page_entry_31 = type { i32 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.__anonstruct_ostrng_35 = type { i8*, i8**, i8*, void (i8*, i8*, i8*)*, void (i8*)*, i8* }
%struct.stat = type { i64, i16, i64, i32, i32, i32, i32, i64, i16, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, i64, i64 }
%struct.timespec = type { i64, i64 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.printer_record = type { i8*, i8*, %struct.printer_record* }

!223 = !DIEnumerator(name: "FN_CLOSE_BRACKET___1", value: 4, isUnsigned: true)
!224 = !DIEnumerator(name: "FN_FNTEXT", value: 5, isUnsigned: true)
!225 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__anonenum_java_ip_states_27", file: !226, line: 53, baseType: !7, size: 32, elements: !227)
!226 = !DIFile(filename: "/home/wslee/benchmarks/textformat/trueprint-5.3/src/lang_java.c", directory: "")
!227 = !{!228, !229, !230, !231, !232, !233, !234, !235}
!228 = !DIEnumerator(name: "IP_CODE___4", value: 0, isUnsigned: true)
!229 = !DIEnumerator(name: "IP_COMMENT_START___2", value: 1, isUnsigned: true)
!230 = !DIEnumerator(name: "IP_COMMENT___5", value: 2, isUnsigned: true)
!231 = !DIEnumerator(name: "IP_CPP_COMMENT", value: 3, isUnsigned: true)
!232 = !DIEnumerator(name: "IP_COMMENT_END___2", value: 4, isUnsigned: true)
!233 = !DIEnumerator(name: "IP_STRING___3", value: 5, isUnsigned: true)
!234 = !DIEnumerator(name: "IP_QUOTE_STRING___1", value: 6, isUnsigned: true)
!235 = !DIEnumerator(name: "IP_ESCAPED___1", value: 7, isUnsigned: true)
!236 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__anonenum_java_fn_states_28", file: !226, line: 64, baseType: !7, size: 32, elements: !237)
!237 = !{!238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248}
!238 = !DIEnumerator(name: "FN_INITIAL_SPACE___2", value: 0, isUnsigned: true)
!239 = !DIEnumerator(name: "FN_FINAL_CHARS___1", value: 1, isUnsigned: true)
!240 = !DIEnumerator(name: "FN_NAME___3", value: 2, isUnsigned: true)
!241 = !DIEnumerator(name: "FN_TRAIL_SPACE___2", value: 3, isUnsigned: true)
!242 = !DIEnumerator(name: "FN_OPEN_BRACKET___2", value: 4, isUnsigned: true)
!243 = !DIEnumerator(name: "FN_DBL_OPEN_BRACKET___1", value: 5, isUnsigned: true)
!244 = !DIEnumerator(name: "FN_CLOSE_BRACKET___2", value: 6, isUnsigned: true)
!245 = !DIEnumerator(name: "FN_SEMICOLON___1", value: 7, isUnsigned: true)
!246 = !DIEnumerator(name: "FN_BODY___1", value: 8, isUnsigned: true)
!247 = !DIEnumerator(name: "FN_MACRO___1", value: 9, isUnsigned: true)
!248 = !DIEnumerator(name: "FN_MACRO_ESCAPED___1", value: 10, isUnsigned: true)
!249 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__anonenum_c_ip_states_27", file: !250, line: 32, baseType: !7, size: 32, elements: !251)
!250 = !DIFile(filename: "/home/wslee/benchmarks/textformat/trueprint-5.3/src/lang_c.c", directory: "")
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259}
!252 = !DIEnumerator(name: "IP_CODE___5", value: 0, isUnsigned: true)
!253 = !DIEnumerator(name: "IP_COMMENT_START___3", value: 1, isUnsigned: true)
!254 = !DIEnumerator(name: "IP_COMMENT___6", value: 2, isUnsigned: true)
!255 = !DIEnumerator(name: "IP_COMMENT_LINE___2", value: 3, isUnsigned: true)
!256 = !DIEnumerator(name: "IP_COMMENT_END___3", value: 4, isUnsigned: true)
!257 = !DIEnumerator(name: "IP_STRING___4", value: 5, isUnsigned: true)
!258 = !DIEnumerator(name: "IP_QUOTE_STRING___2", value: 6, isUnsigned: true)
!259 = !DIEnumerator(name: "IP_ESCAPED___2", value: 7, isUnsigned: true)
!260 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__anonenum_c_fn_states_28", file: !250, line: 43, baseType: !7, size: 32, elements: !261)
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273}
!262 = !DIEnumerator(name: "FN_INITIAL_SPACE___3", value: 0, isUnsigned: true)
!263 = !DIEnumerator(name: "FN_FINAL_CHARS___2", value: 1, isUnsigned: true)
!264 = !DIEnumerator(name: "FN_NAME___4", value: 2, isUnsigned: true)
!265 = !DIEnumerator(name: "FN_TRAIL_SPACE___3", value: 3, isUnsigned: true)
!266 = !DIEnumerator(name: "FN_OPEN_BRACKET___3", value: 4, isUnsigned: true)
!267 = !DIEnumerator(name: "FN_DBL_OPEN_BRACKET___2", value: 5, isUnsigned: true)
!268 = !DIEnumerator(name: "FN_CLOSE_BRACKET___3", value: 6, isUnsigned: true)
!269 = !DIEnumerator(name: "FN_ARG___1", value: 7, isUnsigned: true)
!270 = !DIEnumerator(name: "FN_SEMICOLON___2", value: 8, isUnsigned: true)
!271 = !DIEnumerator(name: "FN_BODY___2", value: 9, isUnsigned: true)
!272 = !DIEnumerator(name: "FN_MACRO___2", value: 10, isUnsigned: true)
!273 = !DIEnumerator(name: "FN_MACRO_ESCAPED___2", value: 11, isUnsigned: true)
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__anonenum_diff_states_28", file: !275, line: 39, baseType: !7, size: 32, elements: !276)
!275 = !DIFile(filename: "/home/wslee/benchmarks/textformat/trueprint-5.3/src/output.c", directory: "")
!276 = !{!277, !278, !279}
!277 = !DIEnumerator(name: "INSERT", value: 0, isUnsigned: true)
!278 = !DIEnumerator(name: "DELETE", value: 1, isUnsigned: true)
!279 = !DIEnumerator(name: "NORMAL", value: 2, isUnsigned: true)
!280 = !{!281, !283, !284, !344, !349, !352, !353, !354, !347, !355, !282, !392, !17, !393, !394, !337, !395, !7, !396, !397, !406, !318, !418, !421, !424, !427, !430, !431, !432, !435, !438, !441, !444, !445, !448, !449, !450, !451, !452, !453, !454, !455, !457, !466, !467, !468, !469, !367, !470, !485, !494, !316, !493, !499, !513, !515, !516, !517, !518, !519, !520, !521, !522, !524, !525, !417, !405, !526, !314, !527, !528}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !286, line: 49, baseType: !287)
!286 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !288, line: 271, size: 1728, elements: !289)
!288 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !310, !311, !312, !313, !317, !319, !321, !325, !328, !332, !333, !334, !335, !336, !339, !340}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !287, file: !288, line: 272, baseType: !17, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !287, file: !288, line: 273, baseType: !281, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !287, file: !288, line: 274, baseType: !281, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !287, file: !288, line: 275, baseType: !281, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !287, file: !288, line: 276, baseType: !281, size: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !287, file: !288, line: 277, baseType: !281, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !287, file: !288, line: 278, baseType: !281, size: 64, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !287, file: !288, line: 279, baseType: !281, size: 64, offset: 448)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !287, file: !288, line: 280, baseType: !281, size: 64, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !287, file: !288, line: 281, baseType: !281, size: 64, offset: 576)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !287, file: !288, line: 282, baseType: !281, size: 64, offset: 640)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !287, file: !288, line: 283, baseType: !281, size: 64, offset: 704)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !287, file: !288, line: 284, baseType: !303, size: 64, offset: 768)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !288, line: 186, size: 192, elements: !305)
!305 = !{!306, !307, !309}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !304, file: !288, line: 187, baseType: !303, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !304, file: !288, line: 188, baseType: !308, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !304, file: !288, line: 189, baseType: !17, size: 32, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !287, file: !288, line: 285, baseType: !308, size: 64, offset: 832)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !287, file: !288, line: 286, baseType: !17, size: 32, offset: 896)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !287, file: !288, line: 287, baseType: !17, size: 32, offset: 928)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !287, file: !288, line: 288, baseType: !314, size: 64, offset: 960)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !315, line: 141, baseType: !316)
!315 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!316 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !287, file: !288, line: 289, baseType: !318, size: 16, offset: 1024)
!318 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !287, file: !288, line: 290, baseType: !320, size: 8, offset: 1040)
!320 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !287, file: !288, line: 291, baseType: !322, size: 8, offset: 1048)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 8, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 1)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !287, file: !288, line: 292, baseType: !326, size: 64, offset: 1088)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !288, line: 180, baseType: null)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !287, file: !288, line: 293, baseType: !329, size: 64, offset: 1152)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !315, line: 142, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !315, line: 56, baseType: !331)
!331 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !287, file: !288, line: 294, baseType: !283, size: 64, offset: 1216)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !287, file: !288, line: 295, baseType: !283, size: 64, offset: 1280)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !287, file: !288, line: 296, baseType: !283, size: 64, offset: 1344)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !287, file: !288, line: 297, baseType: !283, size: 64, offset: 1408)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !287, file: !288, line: 298, baseType: !337, size: 32, offset: 1472)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !338, line: 211, baseType: !7)
!338 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !287, file: !288, line: 299, baseType: !17, size: 32, offset: 1504)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !287, file: !288, line: 300, baseType: !341, size: 192, offset: 1536)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 192, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 24)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !347, !347, !281}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !281}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "option_class", file: !6, line: 10, baseType: !5)
!353 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !16, line: 106, baseType: !15)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !357, line: 43, size: 1152, elements: !358)
!357 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!358 = !{!359, !363, !364, !366, !368, !370, !372, !374, !375, !376, !377, !379, !381, !388, !389, !390, !391}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !356, file: !357, line: 44, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !315, line: 134, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_quad_t", file: !315, line: 57, baseType: !362)
!362 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !356, file: !357, line: 45, baseType: !318, size: 16, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !356, file: !357, line: 46, baseType: !365, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !315, line: 137, baseType: !353)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !356, file: !357, line: 47, baseType: !367, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !315, line: 139, baseType: !7)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !356, file: !357, line: 48, baseType: !369, size: 32, offset: 224)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !315, line: 140, baseType: !7)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !356, file: !357, line: 49, baseType: !371, size: 32, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !315, line: 135, baseType: !7)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !356, file: !357, line: 50, baseType: !373, size: 32, offset: 288)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !315, line: 136, baseType: !7)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !356, file: !357, line: 51, baseType: !360, size: 64, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !356, file: !357, line: 52, baseType: !318, size: 16, offset: 384)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !356, file: !357, line: 53, baseType: !314, size: 64, offset: 448)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !356, file: !357, line: 54, baseType: !378, size: 64, offset: 512)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !315, line: 164, baseType: !316)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !356, file: !357, line: 55, baseType: !380, size: 64, offset: 576)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !315, line: 169, baseType: !316)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !356, file: !357, line: 56, baseType: !382, size: 128, offset: 640)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !383, line: 120, size: 128, elements: !384)
!383 = !DIFile(filename: "/usr/include/time.h", directory: "")
!384 = !{!385, !387}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !382, file: !383, line: 121, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !315, line: 149, baseType: !316)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !382, file: !383, line: 122, baseType: !316, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !356, file: !357, line: 57, baseType: !382, size: 128, offset: 768)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !356, file: !357, line: 58, baseType: !382, size: 128, offset: 896)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__unused4", scope: !356, file: !357, line: 59, baseType: !353, size: 64, offset: 1024)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "__unused5", scope: !356, file: !357, line: 60, baseType: !353, size: 64, offset: 1088)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_status", file: !16, line: 88, baseType: !22)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "perl_ip_states", file: !36, line: 34, baseType: !35)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "perl_f1_states", file: !36, line: 60, baseType: !61)
!395 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream_status", file: !16, line: 95, baseType: !28)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "printer_record", file: !399, line: 33, baseType: !400)
!399 = !DIFile(filename: "/home/wslee/benchmarks/textformat/trueprint-5.3/src/printers_fl.c", directory: "")
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "printer_record", file: !399, line: 33, size: 192, elements: !401)
!401 = !{!402, !403, !404}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !400, file: !399, line: 34, baseType: !281, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !400, file: !399, line: 35, baseType: !281, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !400, file: !399, line: 36, baseType: !405, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "printer_type", file: !399, line: 26, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "printer_type", file: !399, line: 26, size: 320, elements: !409)
!409 = !{!410, !411, !412, !413, !414, !415, !416}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !408, file: !399, line: 27, baseType: !281, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sides", scope: !408, file: !399, line: 28, baseType: !395, size: 16, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !408, file: !399, line: 29, baseType: !17, size: 32, offset: 96)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !408, file: !399, line: 30, baseType: !17, size: 32, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !408, file: !399, line: 31, baseType: !17, size: 32, offset: 160)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !408, file: !399, line: 32, baseType: !17, size: 32, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !408, file: !399, line: 33, baseType: !417, size: 64, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !347, !347, !354}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !354}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !347, !347, !395, !395, !395}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !395}
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "page_types", file: !70, line: 6, baseType: !69)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "verilog_ip_states", file: !76, line: 31, baseType: !75)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !347, !347, !17, !17, !17}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !17}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !347, !347, !282}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !282}
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "page_layouts", file: !84, line: 35, baseType: !83)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{null}
!448 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!449 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "languages", file: !92, line: 50, baseType: !91)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "pike_ip_states", file: !108, line: 31, baseType: !107)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "pike_fn_states", file: !108, line: 42, baseType: !118)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !460, line: 81, size: 256, elements: !461)
!460 = !DIFile(filename: "/home/wslee/benchmarks/textformat/trueprint-5.3/src/getopt.h", directory: "")
!461 = !{!462, !463, !464, !465}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !459, file: !460, line: 82, baseType: !347, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !459, file: !460, line: 83, baseType: !17, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !459, file: !460, line: 84, baseType: !454, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !459, file: !460, line: 85, baseType: !17, size: 32, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "option_types", file: !134, line: 46, baseType: !133)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "pascal_states", file: !146, line: 33, baseType: !145)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "pascal_fn_states", file: !146, line: 40, baseType: !152)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "report_ip_states", file: !162, line: 33, baseType: !161)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "function_entry", file: !472, line: 41, baseType: !473)
!472 = !DIFile(filename: "/home/wslee/benchmarks/textformat/trueprint-5.3/src/index.c", directory: "")
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_function_entry_29", file: !472, line: 41, size: 960, elements: !474)
!474 = !{!475, !479, !480, !481, !482, !483, !484}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !473, file: !472, line: 42, baseType: !476, size: 560)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 560, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 70)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "name_start_char", scope: !473, file: !472, line: 43, baseType: !316, size: 64, offset: 576)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "name_end_char", scope: !473, file: !472, line: 44, baseType: !316, size: 64, offset: 640)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "page_number", scope: !473, file: !472, line: 45, baseType: !316, size: 64, offset: 704)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "end_page", scope: !473, file: !472, line: 46, baseType: !316, size: 64, offset: 768)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !473, file: !472, line: 47, baseType: !354, size: 32, offset: 832)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !473, file: !472, line: 48, baseType: !281, size: 64, offset: 896)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "file_entry", file: !472, line: 51, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_file_entry_30", file: !472, line: 51, size: 256, elements: !488)
!488 = !{!489, !490, !491, !492}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "starting_page", scope: !487, file: !472, line: 52, baseType: !316, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ending_page", scope: !487, file: !472, line: 53, baseType: !316, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !487, file: !472, line: 54, baseType: !281, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !487, file: !472, line: 55, baseType: !493, size: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !383, line: 76, baseType: !386)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "page_entry", file: !472, line: 58, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_page_entry_31", file: !472, line: 58, size: 32, elements: !497)
!497 = !{!498}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !496, file: !472, line: 59, baseType: !354, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !383, line: 133, size: 448, elements: !501)
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !500, file: !383, line: 134, baseType: !17, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !500, file: !383, line: 135, baseType: !17, size: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !500, file: !383, line: 136, baseType: !17, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !500, file: !383, line: 137, baseType: !17, size: 32, offset: 96)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !500, file: !383, line: 138, baseType: !17, size: 32, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !500, file: !383, line: 139, baseType: !17, size: 32, offset: 160)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !500, file: !383, line: 140, baseType: !17, size: 32, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !500, file: !383, line: 141, baseType: !17, size: 32, offset: 224)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !500, file: !383, line: 142, baseType: !17, size: 32, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !500, file: !383, line: 143, baseType: !316, size: 64, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !500, file: !383, line: 144, baseType: !347, size: 64, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !493)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "cxx_ip_states", file: !168, line: 31, baseType: !167)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "cxx_fn_states", file: !168, line: 42, baseType: !178)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "sh_ip_states", file: !194, line: 32, baseType: !193)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "sh_f1_states", file: !194, line: 48, baseType: !209)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "sh_fn_states", file: !194, line: 57, baseType: !217)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "java_ip_states", file: !226, line: 53, baseType: !225)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "java_fn_states", file: !226, line: 64, baseType: !236)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "c_ip_states", file: !250, line: 32, baseType: !249)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "c_fn_states", file: !250, line: 43, baseType: !260)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "diff_states", file: !275, line: 39, baseType: !274)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!529 = !{!530, !535, !540, !542, !544, !547, !552, !554, !559, !561, !563, !568, !570, !0, !572, !575, !577, !579, !581, !583, !585, !588, !590, !593, !596, !598, !601, !603, !605, !607, !609, !611, !613, !615, !617, !619, !621, !623, !625, !627, !629, !631, !633, !635, !637, !640, !642, !648, !650, !652, !654, !656, !658, !660, !662, !664, !666, !668, !670, !672, !674, !676, !678, !680, !682, !684, !686, !688, !690, !692, !694, !696, !698, !700, !702, !704, !706, !708, !710, !712, !714, !716, !718, !720, !722, !724, !726, !728, !730, !732, !734, !736, !738, !740, !742, !744, !746, !748, !750, !752, !754, !756, !759, !761, !763, !765, !767, !769, !771, !773, !775, !777, !779, !781, !783, !788, !915, !918, !920, !922, !924, !926, !928, !930, !932, !935, !937, !939, !941, !943, !945, !947, !950, !952, !954, !956, !958, !960, !962, !964, !966, !969, !971, !973, !975, !977, !979, !981, !983, !986, !988, !990, !992, !994, !996, !998, !1000, !1002, !1004, !1006, !1008, !1010, !1012, !1014, !1016, !1018, !1020, !1025, !1027, !1029, !1034, !1037, !1039, !1041, !1047, !1049, !1051, !1053, !1058, !1060, !1062, !1064, !1066, !1068, !1070, !1075, !1080, !1085, !1089, !1091, !1093, !1095, !1097, !1099, !1104, !1106, !1108, !1110, !1112, !1114, !1116, !1118, !1120, !1122, !1124, !1126, !1128, !1130, !1132, !1134, !1136, !1138, !1140, !1142, !1144, !1146, !1148, !1150, !1152, !1154, !1156, !1158, !1160, !1162, !1164, !1166, !1168, !1170, !1172, !1174, !1176, !1178, !1180, !1182, !1184, !1186, !1188, !1190, !1192, !1195, !1197, !1199, !1201, !1206, !1209, !1211, !1213, !1215, !1217, !1219, !1221, !1223, !1225, !1227}
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "lang_perl_defaults", scope: !2, file: !36, line: 29, type: !532, isLocal: false, isDefinition: true)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 96, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 12)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "lang_verilog_defaults", scope: !2, file: !76, line: 26, type: !537, isLocal: false, isDefinition: true)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 88, elements: !538)
!538 = !{!539}
!539 = !DISubrange(count: 11)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "language_list", scope: !2, file: !92, line: 31, type: !281, isLocal: false, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "lang_pike_defaults", scope: !2, file: !108, line: 26, type: !532, isLocal: false, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "lang_text_defaults", scope: !2, file: !546, line: 20, type: !532, isLocal: false, isDefinition: true)
!546 = !DIFile(filename: "/home/wslee/benchmarks/textformat/trueprint-5.3/src/lang_text.c", directory: "")
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "lang_list_defaults", scope: !2, file: !546, line: 21, type: !549, isLocal: false, isDefinition: true)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 176, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 22)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "lang_pascal_defaults", scope: !2, file: !146, line: 27, type: !532, isLocal: false, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "lang_report_defaults", scope: !2, file: !162, line: 28, type: !556, isLocal: false, isDefinition: true)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 120, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 15)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "lang_cxx_defaults", scope: !2, file: !168, line: 26, type: !532, isLocal: false, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "lang_sh_defaults", scope: !2, file: !194, line: 27, type: !537, isLocal: false, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "lang_java_defaults", scope: !2, file: !226, line: 48, type: !565, isLocal: false, isDefinition: true)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 128, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 16)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "lang_c_defaults", scope: !2, file: !250, line: 26, type: !532, isLocal: false, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "lang_pc_defaults", scope: !2, file: !250, line: 27, type: !532, isLocal: false, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "diffs_stream", scope: !2, file: !574, line: 55, type: !284, isLocal: true, isDefinition: true)
!574 = !DIFile(filename: "/home/wslee/benchmarks/textformat/trueprint-5.3/src/diffs.c", directory: "")
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "diffs_on", scope: !2, file: !574, line: 56, type: !354, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "diff_start_line", scope: !2, file: !574, line: 57, type: !316, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "diff_end_line", scope: !2, file: !574, line: 58, type: !316, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "lines_deleted", scope: !2, file: !574, line: 59, type: !316, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "lines_added", scope: !2, file: !574, line: 60, type: !316, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "current_filename", scope: !2, file: !587, line: 10, type: !281, isLocal: false, isDefinition: true)
!587 = !DIFile(filename: "/home/wslee/benchmarks/textformat/trueprint-5.3/src/main.h", directory: "")
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "pass", scope: !2, file: !587, line: 11, type: !395, isLocal: false, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "char_number", scope: !2, file: !592, line: 6, type: !316, isLocal: false, isDefinition: true)
!592 = !DIFile(filename: "/home/wslee/benchmarks/textformat/trueprint-5.3/src/input.h", directory: "")
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "restart_language", scope: !2, file: !595, line: 9, type: !354, isLocal: false, isDefinition: true)
!595 = !DIFile(filename: "/home/wslee/benchmarks/textformat/trueprint-5.3/src/language.h", directory: "")
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "braces_depth", scope: !2, file: !595, line: 10, type: !395, isLocal: false, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "page_number", scope: !2, file: !600, line: 7, type: !316, isLocal: false, isDefinition: true)
!600 = !DIFile(filename: "/home/wslee/benchmarks/textformat/trueprint-5.3/src/output.h", directory: "")
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "state", scope: !2, file: !36, line: 79, type: !393, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "f1_state", scope: !2, file: !36, line: 81, type: !394, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "f1_index", scope: !2, file: !36, line: 82, type: !337, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "f1_start_char", scope: !2, file: !36, line: 83, type: !316, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "f1_end_char", scope: !2, file: !36, line: 84, type: !316, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "f1_name", scope: !2, file: !36, line: 85, type: !476, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "here_marker", scope: !2, file: !36, line: 86, type: !476, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "here_marker_index", scope: !2, file: !36, line: 87, type: !395, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(name: "here_marker_length", scope: !2, file: !36, line: 88, type: !395, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "f1_page_number", scope: !2, file: !36, line: 89, type: !316, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "escaped", scope: !2, file: !36, line: 91, type: !354, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "prepodstate", scope: !2, file: !36, line: 92, type: !17, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "use_environment", scope: !2, file: !587, line: 16, type: !354, isLocal: false, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "printers_filename", scope: !2, file: !399, line: 41, type: !281, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "file_number", scope: !2, file: !587, line: 12, type: !7, isLocal: false, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "page_length", scope: !2, file: !587, line: 13, type: !17, isLocal: false, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "page_width", scope: !2, file: !587, line: 14, type: !17, isLocal: false, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "total_pages", scope: !2, file: !587, line: 15, type: !316, isLocal: false, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "no_show_indent_level", scope: !2, file: !639, line: 6, type: !354, isLocal: false, isDefinition: true)
!639 = !DIFile(filename: "/home/wslee/benchmarks/textformat/trueprint-5.3/src/postscript.h", directory: "")
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "no_show_line_number", scope: !2, file: !639, line: 7, type: !354, isLocal: false, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "get_char", scope: !2, file: !595, line: 8, type: !644, isLocal: false, isDefinition: true)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!396, !281, !647}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "file_page_number", scope: !2, file: !600, line: 6, type: !316, isLocal: false, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "no_clever_wrap", scope: !2, file: !275, line: 53, type: !354, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "min_line_length", scope: !2, file: !275, line: 54, type: !395, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "tabsize", scope: !2, file: !275, line: 55, type: !395, isLocal: true, isDefinition: true)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "no_function_page_breaks", scope: !2, file: !275, line: 56, type: !354, isLocal: true, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "new_sheet_after_file", scope: !2, file: !275, line: 57, type: !354, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "no_expand_page_break", scope: !2, file: !275, line: 58, type: !354, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "line_number", scope: !2, file: !275, line: 59, type: !316, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "reached_end_of_sheet", scope: !2, file: !275, line: 60, type: !354, isLocal: true, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "saved_state", scope: !2, file: !76, line: 50, type: !431, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "start_char", scope: !2, file: !76, line: 55, type: !316, isLocal: true, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "end_char", scope: !2, file: !76, line: 55, type: !316, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "fn_page_number", scope: !2, file: !76, line: 56, type: !316, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "no_of_files", scope: !2, file: !587, line: 9, type: !7, isLocal: false, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "logical_pages_on_physical_page", scope: !2, file: !84, line: 43, type: !318, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "physical_page_no", scope: !2, file: !84, line: 44, type: !316, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "greenlines", scope: !2, file: !84, line: 45, type: !395, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "no_holepunch", scope: !2, file: !84, line: 46, type: !354, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "no_top_holepunch", scope: !2, file: !84, line: 47, type: !354, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "page_furniture", scope: !2, file: !84, line: 48, type: !354, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(name: "interline_gap", scope: !2, file: !84, line: 49, type: !17, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "include_headers", scope: !2, file: !84, line: 50, type: !354, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "include_footers", scope: !2, file: !84, line: 51, type: !354, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "pointsize", scope: !2, file: !84, line: 52, type: !395, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "orientation", scope: !2, file: !84, line: 53, type: !282, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "layout", scope: !2, file: !84, line: 54, type: !444, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "no_cover_sheet", scope: !2, file: !84, line: 55, type: !354, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "user_name", scope: !2, file: !84, line: 56, type: !281, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "printable_width", scope: !2, file: !84, line: 57, type: !318, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "printable_height", scope: !2, file: !84, line: 58, type: !318, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(name: "virtual_width", scope: !2, file: !84, line: 59, type: !318, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "virtual_height", scope: !2, file: !84, line: 60, type: !318, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "header_box_height", scope: !2, file: !84, line: 61, type: !318, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "footer_box_height", scope: !2, file: !84, line: 62, type: !318, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "logical_pages_rotated", scope: !2, file: !84, line: 63, type: !318, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "pos_left", scope: !2, file: !84, line: 64, type: !318, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "pos_centre_left", scope: !2, file: !84, line: 65, type: !318, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "pos_centre_right", scope: !2, file: !84, line: 66, type: !318, isLocal: true, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "pos_right", scope: !2, file: !84, line: 67, type: !318, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "pos_bottom", scope: !2, file: !84, line: 68, type: !318, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "pos_centre_bottom", scope: !2, file: !84, line: 69, type: !318, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "pos_centre_top", scope: !2, file: !84, line: 70, type: !318, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "pos_top", scope: !2, file: !84, line: 71, type: !318, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "logical_page_no", scope: !2, file: !84, line: 72, type: !318, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "left_margin", scope: !2, file: !84, line: 73, type: !318, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "right_margin", scope: !2, file: !84, line: 74, type: !318, isLocal: true, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "top_margin", scope: !2, file: !84, line: 75, type: !318, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "bottom_margin", scope: !2, file: !84, line: 76, type: !318, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "left_page", scope: !2, file: !84, line: 77, type: !354, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "right_page", scope: !2, file: !84, line: 77, type: !354, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "no_of_sides", scope: !2, file: !84, line: 78, type: !282, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "ps_level", scope: !2, file: !84, line: 79, type: !282, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "language", scope: !2, file: !92, line: 68, type: !450, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "got_some_input", scope: !2, file: !592, line: 7, type: !17, isLocal: false, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "unget_charstackptr", scope: !2, file: !758, line: 42, type: !281, isLocal: true, isDefinition: true)
!758 = !DIFile(filename: "/home/wslee/benchmarks/textformat/trueprint-5.3/src/input.c", directory: "")
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "unget_statstackptr", scope: !2, file: !758, line: 43, type: !281, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "unget_charstackbase", scope: !2, file: !758, line: 44, type: !281, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "unget_statstackbase", scope: !2, file: !758, line: 45, type: !281, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "unget_stackdepth", scope: !2, file: !758, line: 46, type: !318, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "input_stream", scope: !2, file: !758, line: 47, type: !17, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "saved_state___0", scope: !2, file: !108, line: 97, type: !452, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "fn_state", scope: !2, file: !108, line: 100, type: !453, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "saved_fn_state", scope: !2, file: !108, line: 101, type: !453, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "fn_name_index", scope: !2, file: !108, line: 102, type: !395, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "start_char___0", scope: !2, file: !108, line: 104, type: !316, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "end_char___0", scope: !2, file: !108, line: 104, type: !316, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "fn_page_number___0", scope: !2, file: !108, line: 105, type: !316, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "short_options", scope: !2, file: !134, line: 167, type: !785, isLocal: true, isDefinition: true)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 1984, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 62)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "option_list", scope: !2, file: !134, line: 169, type: !790, isLocal: true, isDefinition: true)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !791, size: 230272, elements: !913)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option_type", file: !134, line: 58, size: 896, elements: !792)
!792 = !{!793, !794, !795, !796, !797, !798}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "letter", scope: !791, file: !134, line: 59, baseType: !282, size: 8)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !791, file: !134, line: 60, baseType: !466, size: 32, offset: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !791, file: !134, line: 61, baseType: !354, size: 32, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "need_string", scope: !791, file: !134, line: 62, baseType: !282, size: 8, offset: 96)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !791, file: !134, line: 63, baseType: !352, size: 32, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !791, file: !134, line: 64, baseType: !799, size: 704, offset: 192)
!799 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_t_27", file: !134, line: 58, size: 704, elements: !800)
!800 = !{!801, !812, !818, !830, !843, !855, !870, !884, !893}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "onoparm", scope: !799, file: !134, line: 59, baseType: !802, size: 320)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_onoparm_28", file: !134, line: 58, size: 320, elements: !803)
!803 = !{!804, !805, !806, !810, !811}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !802, file: !134, line: 59, baseType: !281, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "default_opt", scope: !802, file: !134, line: 60, baseType: !354, size: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !802, file: !134, line: 61, baseType: !807, size: 64, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !347, !347}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "set_default", scope: !802, file: !134, line: 62, baseType: !445, size: 64, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "help_string", scope: !802, file: !134, line: 63, baseType: !281, size: 64, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ooptional", scope: !799, file: !134, line: 60, baseType: !813, size: 192)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_ooptional_29", file: !134, line: 58, size: 192, elements: !814)
!814 = !{!815, !816, !817}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !813, file: !134, line: 59, baseType: !281, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !813, file: !134, line: 60, baseType: !344, size: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "help_string", scope: !813, file: !134, line: 61, baseType: !281, size: 64, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "obool", scope: !799, file: !134, line: 61, baseType: !819, size: 512)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_obool_30", file: !134, line: 58, size: 512, elements: !820)
!820 = !{!821, !822, !823, !825, !826, !827, !828, !829}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "true_string", scope: !819, file: !134, line: 59, baseType: !281, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "false_string", scope: !819, file: !134, line: 60, baseType: !281, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !819, file: !134, line: 61, baseType: !824, size: 64, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !819, file: !134, line: 62, baseType: !354, size: 32, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !819, file: !134, line: 63, baseType: !418, size: 64, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "set_default", scope: !819, file: !134, line: 64, baseType: !421, size: 64, offset: 320)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "true_help_string", scope: !819, file: !134, line: 65, baseType: !281, size: 64, offset: 384)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "false_help_string", scope: !819, file: !134, line: 66, baseType: !281, size: 64, offset: 448)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ochar", scope: !799, file: !134, line: 62, baseType: !831, size: 448)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_ochar_31", file: !134, line: 58, size: 448, elements: !832)
!832 = !{!833, !834, !835, !836, !837, !841, !842}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !831, file: !134, line: 59, baseType: !281, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !831, file: !134, line: 60, baseType: !281, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !831, file: !134, line: 61, baseType: !282, size: 8, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "valid_set", scope: !831, file: !134, line: 62, baseType: !281, size: 64, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !831, file: !134, line: 63, baseType: !838, size: 64, offset: 256)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{null, !347, !347, !282, !281}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "set_default", scope: !831, file: !134, line: 64, baseType: !441, size: 64, offset: 320)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "help_string", scope: !831, file: !134, line: 65, baseType: !281, size: 64, offset: 384)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ochoice", scope: !799, file: !134, line: 63, baseType: !844, size: 512)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_ochoice_32", file: !134, line: 58, size: 512, elements: !845)
!845 = !{!846, !847, !848, !849, !850, !851, !852, !853, !854}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !844, file: !134, line: 59, baseType: !281, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "choice1_string", scope: !844, file: !134, line: 60, baseType: !281, size: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "choice2_string", scope: !844, file: !134, line: 61, baseType: !281, size: 64, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "choice1", scope: !844, file: !134, line: 62, baseType: !282, size: 8, offset: 192)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "choice2", scope: !844, file: !134, line: 63, baseType: !282, size: 8, offset: 200)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !844, file: !134, line: 64, baseType: !438, size: 64, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "set_default", scope: !844, file: !134, line: 65, baseType: !441, size: 64, offset: 320)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "choice1_help_string", scope: !844, file: !134, line: 66, baseType: !281, size: 64, offset: 384)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "choice2_help_string", scope: !844, file: !134, line: 67, baseType: !281, size: 64, offset: 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "oshrt", scope: !799, file: !134, line: 64, baseType: !856, size: 576)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_oshrt_33", file: !134, line: 58, size: 576, elements: !857)
!857 = !{!858, !859, !861, !862, !863, !864, !865, !866, !867, !868, !869}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !856, file: !134, line: 59, baseType: !281, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !856, file: !134, line: 60, baseType: !860, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !856, file: !134, line: 61, baseType: !395, size: 16, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "special_string", scope: !856, file: !134, line: 62, baseType: !281, size: 64, offset: 192)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "special_value", scope: !856, file: !134, line: 63, baseType: !395, size: 16, offset: 256)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !856, file: !134, line: 64, baseType: !395, size: 16, offset: 272)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !856, file: !134, line: 65, baseType: !395, size: 16, offset: 288)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !856, file: !134, line: 66, baseType: !424, size: 64, offset: 320)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "set_default", scope: !856, file: !134, line: 67, baseType: !427, size: 64, offset: 384)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "help_string", scope: !856, file: !134, line: 68, baseType: !281, size: 64, offset: 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "special_help_string", scope: !856, file: !134, line: 69, baseType: !281, size: 64, offset: 512)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "oint", scope: !799, file: !134, line: 65, baseType: !871, size: 640)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_oint_34", file: !134, line: 58, size: 640, elements: !872)
!872 = !{!873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !871, file: !134, line: 59, baseType: !281, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !871, file: !134, line: 60, baseType: !454, size: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !871, file: !134, line: 61, baseType: !17, size: 32, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "special_string", scope: !871, file: !134, line: 62, baseType: !281, size: 64, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "special_value", scope: !871, file: !134, line: 63, baseType: !395, size: 16, offset: 256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !871, file: !134, line: 64, baseType: !17, size: 32, offset: 288)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !871, file: !134, line: 65, baseType: !17, size: 32, offset: 320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !871, file: !134, line: 66, baseType: !432, size: 64, offset: 384)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "set_default", scope: !871, file: !134, line: 67, baseType: !435, size: 64, offset: 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "help_string", scope: !871, file: !134, line: 68, baseType: !281, size: 64, offset: 512)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "special_help_string", scope: !871, file: !134, line: 69, baseType: !281, size: 64, offset: 576)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ostrng", scope: !799, file: !134, line: 66, baseType: !885, size: 384)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_ostrng_35", file: !134, line: 58, size: 384, elements: !886)
!886 = !{!887, !888, !889, !890, !891, !892}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !885, file: !134, line: 59, baseType: !281, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !885, file: !134, line: 60, baseType: !451, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !885, file: !134, line: 61, baseType: !281, size: 64, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !885, file: !134, line: 62, baseType: !344, size: 64, offset: 192)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "set_default", scope: !885, file: !134, line: 63, baseType: !349, size: 64, offset: 256)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "help_string", scope: !885, file: !134, line: 64, baseType: !281, size: 64, offset: 320)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "oflg", scope: !799, file: !134, line: 67, baseType: !894, size: 704)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_oflg_36", file: !134, line: 58, size: 704, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902, !903, !907, !911, !912}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "set_string", scope: !894, file: !134, line: 59, baseType: !281, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "not_set_string", scope: !894, file: !134, line: 60, baseType: !281, size: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var", scope: !894, file: !134, line: 61, baseType: !354, size: 32, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !894, file: !134, line: 62, baseType: !451, size: 64, offset: 192)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !894, file: !134, line: 63, baseType: !354, size: 32, offset: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "true_value", scope: !894, file: !134, line: 64, baseType: !281, size: 64, offset: 320)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "false_value", scope: !894, file: !134, line: 65, baseType: !281, size: 64, offset: 384)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !894, file: !134, line: 66, baseType: !904, size: 64, offset: 448)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{null, !347, !347, !354, !281, !281}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "set_default", scope: !894, file: !134, line: 68, baseType: !908, size: 64, offset: 512)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !354, !281}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "set_help_string", scope: !894, file: !134, line: 69, baseType: !281, size: 64, offset: 576)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "not_set_help_string", scope: !894, file: !134, line: 70, baseType: !281, size: 64, offset: 640)
!913 = !{!914}
!914 = !DISubrange(count: 257)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !134, line: 170, type: !917, isLocal: true, isDefinition: true)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 65792, elements: !913)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(name: "next_option", scope: !2, file: !134, line: 171, type: !17, isLocal: true, isDefinition: true)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "next_long_option", scope: !2, file: !134, line: 172, type: !17, isLocal: true, isDefinition: true)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(name: "this_option", scope: !2, file: !134, line: 173, type: !17, isLocal: true, isDefinition: true)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(name: "start_char___1", scope: !2, file: !146, line: 77, type: !316, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(name: "fn_name___0", scope: !2, file: !146, line: 78, type: !476, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(name: "fn_page", scope: !2, file: !146, line: 79, type: !316, isLocal: true, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(name: "token_index", scope: !2, file: !146, line: 80, type: !337, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(name: "top_left_string", scope: !2, file: !934, line: 17, type: !281, isLocal: true, isDefinition: true)
!934 = !DIFile(filename: "/home/wslee/benchmarks/textformat/trueprint-5.3/src/headers.c", directory: "")
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(name: "top_centre_string", scope: !2, file: !934, line: 18, type: !281, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(name: "top_right_string", scope: !2, file: !934, line: 19, type: !281, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(name: "bottom_left_string", scope: !2, file: !934, line: 20, type: !281, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(name: "bottom_centre_string", scope: !2, file: !934, line: 21, type: !281, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(name: "bottom_right_string", scope: !2, file: !934, line: 22, type: !281, isLocal: true, isDefinition: true)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(name: "message_string", scope: !2, file: !934, line: 23, type: !281, isLocal: true, isDefinition: true)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(name: "no_print_body", scope: !2, file: !949, line: 83, type: !354, isLocal: true, isDefinition: true)
!949 = !DIFile(filename: "/home/wslee/benchmarks/textformat/trueprint-5.3/src/main.c", directory: "")
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(name: "no_print_file_index", scope: !2, file: !949, line: 84, type: !354, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(name: "no_print_function_index", scope: !2, file: !949, line: 85, type: !354, isLocal: true, isDefinition: true)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(name: "destination", scope: !2, file: !949, line: 86, type: !281, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(name: "printer_destination", scope: !2, file: !949, line: 87, type: !281, isLocal: true, isDefinition: true)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(name: "no_of_copies", scope: !2, file: !949, line: 88, type: !395, isLocal: true, isDefinition: true)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(name: "file_names", scope: !2, file: !949, line: 89, type: !451, isLocal: true, isDefinition: true)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "output_filename", scope: !2, file: !949, line: 90, type: !281, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(name: "redirect_output", scope: !2, file: !949, line: 91, type: !354, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(name: "debug_string", scope: !2, file: !968, line: 22, type: !281, isLocal: true, isDefinition: true)
!968 = !DIFile(filename: "/home/wslee/benchmarks/textformat/trueprint-5.3/src/debug.c", directory: "")
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(name: "saved_state___1", scope: !2, file: !168, line: 69, type: !515, isLocal: true, isDefinition: true)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(name: "fn_state___1", scope: !2, file: !168, line: 72, type: !516, isLocal: true, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(name: "saved_fn_state___0", scope: !2, file: !168, line: 73, type: !516, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(name: "fn_name_index___0", scope: !2, file: !168, line: 74, type: !395, isLocal: true, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "start_char___2", scope: !2, file: !168, line: 76, type: !316, isLocal: true, isDefinition: true)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(name: "end_char___1", scope: !2, file: !168, line: 76, type: !316, isLocal: true, isDefinition: true)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(name: "fn_page_number___1", scope: !2, file: !168, line: 77, type: !316, isLocal: true, isDefinition: true)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(name: "print_selection", scope: !2, file: !985, line: 26, type: !281, isLocal: false, isDefinition: true)
!985 = !DIFile(filename: "/home/wslee/benchmarks/textformat/trueprint-5.3/src/print_prompt.c", directory: "")
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "no_prompt_to_print", scope: !2, file: !985, line: 34, type: !354, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "here_marker___1", scope: !2, file: !194, line: 97, type: !476, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "here_marker_index___1", scope: !2, file: !194, line: 98, type: !395, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "here_marker_length___1", scope: !2, file: !194, line: 99, type: !395, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(name: "saved_state___2", scope: !2, file: !226, line: 88, type: !520, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(name: "saved_fn_state___1", scope: !2, file: !226, line: 92, type: !521, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "start_char___4", scope: !2, file: !226, line: 95, type: !316, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(name: "end_char___2", scope: !2, file: !226, line: 95, type: !316, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(name: "fn_page_number___3", scope: !2, file: !226, line: 96, type: !316, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(name: "saved_state___5", scope: !2, file: !250, line: 69, type: !524, isLocal: true, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "fn_state___6", scope: !2, file: !250, line: 72, type: !525, isLocal: true, isDefinition: true)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "saved_fn_state___3", scope: !2, file: !250, line: 73, type: !525, isLocal: true, isDefinition: true)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(name: "fn_name_index___3", scope: !2, file: !250, line: 74, type: !395, isLocal: true, isDefinition: true)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(name: "start_char___7", scope: !2, file: !250, line: 76, type: !316, isLocal: true, isDefinition: true)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(name: "end_char___5", scope: !2, file: !250, line: 76, type: !316, isLocal: true, isDefinition: true)
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(name: "fn_page_number___6", scope: !2, file: !250, line: 77, type: !316, isLocal: true, isDefinition: true)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(name: "saved_fn_state___4", scope: !2, file: !250, line: 325, type: !525, isLocal: true, isDefinition: true)
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(name: "sub", scope: !2, file: !36, line: 90, type: !1022, isLocal: true, isDefinition: true)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 40, elements: !1023)
!1023 = !{!1024}
!1024 = !DISubrange(count: 5)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(name: "input_line_length", scope: !2, file: !275, line: 304, type: !17, isLocal: true, isDefinition: true)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(name: "diff_state", scope: !2, file: !275, line: 310, type: !526, isLocal: true, isDefinition: true)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(name: "input_line", scope: !2, file: !275, line: 301, type: !1031, isLocal: true, isDefinition: true)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 16000, elements: !1032)
!1032 = !{!1033}
!1033 = !DISubrange(count: 2000)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(name: "input_status", scope: !2, file: !275, line: 302, type: !1036, isLocal: true, isDefinition: true)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 64000, elements: !1032)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(name: "retval", scope: !2, file: !275, line: 306, type: !396, isLocal: true, isDefinition: true)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(name: "last_char_printed", scope: !2, file: !275, line: 303, type: !17, isLocal: true, isDefinition: true)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(name: "segment_ends", scope: !2, file: !275, line: 62, type: !1043, isLocal: true, isDefinition: true)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 768, elements: !1044)
!1044 = !{!1045, !1046}
!1045 = !DISubrange(count: 4)
!1046 = !DISubrange(count: 3)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(name: "state___0", scope: !2, file: !76, line: 49, type: !431, isLocal: true, isDefinition: true)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(name: "page_has_printing", scope: !2, file: !84, line: 427, type: !354, isLocal: true, isDefinition: true)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(name: "buffer_size", scope: !2, file: !758, line: 124, type: !17, isLocal: true, isDefinition: true)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(name: "input_buffer", scope: !2, file: !758, line: 122, type: !1055, isLocal: true, isDefinition: true)
!1055 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 32768, elements: !1056)
!1056 = !{!1057}
!1057 = !DISubrange(count: 4096)
!1058 = !DIGlobalVariableExpression(var: !1059, expr: !DIExpression())
!1059 = distinct !DIGlobalVariable(name: "buffer_pointer", scope: !2, file: !758, line: 123, type: !395, isLocal: true, isDefinition: true)
!1060 = !DIGlobalVariableExpression(var: !1061, expr: !DIExpression())
!1061 = distinct !DIGlobalVariable(name: "state___1", scope: !2, file: !108, line: 96, type: !452, isLocal: true, isDefinition: true)
!1062 = !DIGlobalVariableExpression(var: !1063, expr: !DIExpression())
!1063 = distinct !DIGlobalVariable(name: "fn_name", scope: !2, file: !108, line: 103, type: !476, isLocal: true, isDefinition: true)
!1064 = !DIGlobalVariableExpression(var: !1065, expr: !DIExpression())
!1065 = distinct !DIGlobalVariable(name: "state___2", scope: !2, file: !146, line: 75, type: !467, isLocal: true, isDefinition: true)
!1066 = !DIGlobalVariableExpression(var: !1067, expr: !DIExpression())
!1067 = distinct !DIGlobalVariable(name: "fn_state___0", scope: !2, file: !146, line: 76, type: !468, isLocal: true, isDefinition: true)
!1068 = !DIGlobalVariableExpression(var: !1069, expr: !DIExpression())
!1069 = distinct !DIGlobalVariable(name: "function_depth", scope: !2, file: !146, line: 81, type: !395, isLocal: true, isDefinition: true)
!1070 = !DIGlobalVariableExpression(var: !1071, expr: !DIExpression())
!1071 = distinct !DIGlobalVariable(name: "procedure_string", scope: !2, file: !146, line: 50, type: !1072, isLocal: true, isDefinition: true)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 80, elements: !1073)
!1073 = !{!1074}
!1074 = !DISubrange(count: 10)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(name: "function_string", scope: !2, file: !146, line: 51, type: !1077, isLocal: true, isDefinition: true)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 72, elements: !1078)
!1078 = !{!1079}
!1079 = !DISubrange(count: 9)
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(name: "begin_string", scope: !2, file: !146, line: 52, type: !1082, isLocal: true, isDefinition: true)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 48, elements: !1083)
!1083 = !{!1084}
!1084 = !DISubrange(count: 6)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(name: "end_string", scope: !2, file: !146, line: 53, type: !1087, isLocal: true, isDefinition: true)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 32, elements: !1088)
!1088 = !{!1045}
!1089 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression())
!1090 = distinct !DIGlobalVariable(name: "state___3", scope: !2, file: !162, line: 48, type: !469, isLocal: true, isDefinition: true)
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(name: "tag_index", scope: !2, file: !162, line: 50, type: !337, isLocal: true, isDefinition: true)
!1093 = !DIGlobalVariableExpression(var: !1094, expr: !DIExpression())
!1094 = distinct !DIGlobalVariable(name: "tag_name", scope: !2, file: !162, line: 52, type: !476, isLocal: true, isDefinition: true)
!1095 = !DIGlobalVariableExpression(var: !1096, expr: !DIExpression())
!1096 = distinct !DIGlobalVariable(name: "tag_start_char", scope: !2, file: !162, line: 51, type: !316, isLocal: true, isDefinition: true)
!1097 = !DIGlobalVariableExpression(var: !1098, expr: !DIExpression())
!1098 = distinct !DIGlobalVariable(name: "tag_page_number", scope: !2, file: !162, line: 53, type: !316, isLocal: true, isDefinition: true)
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(name: "stdin_filenames", scope: !2, file: !949, line: 196, type: !1101, isLocal: true, isDefinition: true)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 128, elements: !1102)
!1102 = !{!1103}
!1103 = !DISubrange(count: 2)
!1104 = !DIGlobalVariableExpression(var: !1105, expr: !DIExpression())
!1105 = distinct !DIGlobalVariable(name: "stdin_stream", scope: !2, file: !949, line: 436, type: !17, isLocal: true, isDefinition: true)
!1106 = !DIGlobalVariableExpression(var: !1107, expr: !DIExpression())
!1107 = distinct !DIGlobalVariable(name: "max_function_name_length", scope: !2, file: !472, line: 66, type: !337, isLocal: true, isDefinition: true)
!1108 = !DIGlobalVariableExpression(var: !1109, expr: !DIExpression())
!1109 = distinct !DIGlobalVariable(name: "max_file_name_length", scope: !2, file: !472, line: 67, type: !337, isLocal: true, isDefinition: true)
!1110 = !DIGlobalVariableExpression(var: !1111, expr: !DIExpression())
!1111 = distinct !DIGlobalVariable(name: "no_of_functions", scope: !2, file: !472, line: 69, type: !318, isLocal: true, isDefinition: true)
!1112 = !DIGlobalVariableExpression(var: !1113, expr: !DIExpression())
!1113 = distinct !DIGlobalVariable(name: "function_list_size", scope: !2, file: !472, line: 70, type: !7, isLocal: true, isDefinition: true)
!1114 = !DIGlobalVariableExpression(var: !1115, expr: !DIExpression())
!1115 = distinct !DIGlobalVariable(name: "file_list_size", scope: !2, file: !472, line: 71, type: !7, isLocal: true, isDefinition: true)
!1116 = !DIGlobalVariableExpression(var: !1117, expr: !DIExpression())
!1117 = distinct !DIGlobalVariable(name: "page_list_size", scope: !2, file: !472, line: 72, type: !7, isLocal: true, isDefinition: true)
!1118 = !DIGlobalVariableExpression(var: !1119, expr: !DIExpression())
!1119 = distinct !DIGlobalVariable(name: "functions", scope: !2, file: !472, line: 73, type: !470, isLocal: true, isDefinition: true)
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(name: "sorted_functions", scope: !2, file: !472, line: 74, type: !470, isLocal: true, isDefinition: true)
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(name: "files", scope: !2, file: !472, line: 75, type: !485, isLocal: true, isDefinition: true)
!1124 = !DIGlobalVariableExpression(var: !1125, expr: !DIExpression())
!1125 = distinct !DIGlobalVariable(name: "pages", scope: !2, file: !472, line: 76, type: !494, isLocal: true, isDefinition: true)
!1126 = !DIGlobalVariableExpression(var: !1127, expr: !DIExpression())
!1127 = distinct !DIGlobalVariable(name: "current_function_changed", scope: !2, file: !472, line: 78, type: !354, isLocal: true, isDefinition: true)
!1128 = !DIGlobalVariableExpression(var: !1129, expr: !DIExpression())
!1129 = distinct !DIGlobalVariable(name: "current_function", scope: !2, file: !472, line: 297, type: !318, isLocal: true, isDefinition: true)
!1130 = !DIGlobalVariableExpression(var: !1131, expr: !DIExpression())
!1131 = distinct !DIGlobalVariable(name: "dummy_return", scope: !2, file: !472, line: 327, type: !322, isLocal: true, isDefinition: true)
!1132 = !DIGlobalVariableExpression(var: !1133, expr: !DIExpression())
!1133 = distinct !DIGlobalVariable(name: "current_function___0", scope: !2, file: !472, line: 372, type: !318, isLocal: true, isDefinition: true)
!1134 = !DIGlobalVariableExpression(var: !1135, expr: !DIExpression())
!1135 = distinct !DIGlobalVariable(name: "first_call", scope: !2, file: !472, line: 574, type: !354, isLocal: true, isDefinition: true)
!1136 = !DIGlobalVariableExpression(var: !1137, expr: !DIExpression())
!1137 = distinct !DIGlobalVariable(name: "current_file", scope: !2, file: !472, line: 572, type: !7, isLocal: true, isDefinition: true)
!1138 = !DIGlobalVariableExpression(var: !1139, expr: !DIExpression())
!1139 = distinct !DIGlobalVariable(name: "function_idx", scope: !2, file: !472, line: 573, type: !318, isLocal: true, isDefinition: true)
!1140 = !DIGlobalVariableExpression(var: !1141, expr: !DIExpression())
!1141 = distinct !DIGlobalVariable(name: "state___4", scope: !2, file: !168, line: 68, type: !515, isLocal: true, isDefinition: true)
!1142 = !DIGlobalVariableExpression(var: !1143, expr: !DIExpression())
!1143 = distinct !DIGlobalVariable(name: "fn_name___1", scope: !2, file: !168, line: 75, type: !476, isLocal: true, isDefinition: true)
!1144 = !DIGlobalVariableExpression(var: !1145, expr: !DIExpression())
!1145 = distinct !DIGlobalVariable(name: "all_yes", scope: !2, file: !985, line: 72, type: !354, isLocal: true, isDefinition: true)
!1146 = !DIGlobalVariableExpression(var: !1147, expr: !DIExpression())
!1147 = distinct !DIGlobalVariable(name: "all_no", scope: !2, file: !985, line: 72, type: !354, isLocal: true, isDefinition: true)
!1148 = !DIGlobalVariableExpression(var: !1149, expr: !DIExpression())
!1149 = distinct !DIGlobalVariable(name: "yes_count", scope: !2, file: !985, line: 70, type: !17, isLocal: true, isDefinition: true)
!1150 = !DIGlobalVariableExpression(var: !1151, expr: !DIExpression())
!1151 = distinct !DIGlobalVariable(name: "no_count", scope: !2, file: !985, line: 71, type: !17, isLocal: true, isDefinition: true)
!1152 = !DIGlobalVariableExpression(var: !1153, expr: !DIExpression())
!1153 = distinct !DIGlobalVariable(name: "state___8", scope: !2, file: !194, line: 85, type: !517, isLocal: true, isDefinition: true)
!1154 = !DIGlobalVariableExpression(var: !1155, expr: !DIExpression())
!1155 = distinct !DIGlobalVariable(name: "f1_state___1", scope: !2, file: !194, line: 87, type: !518, isLocal: true, isDefinition: true)
!1156 = !DIGlobalVariableExpression(var: !1157, expr: !DIExpression())
!1157 = distinct !DIGlobalVariable(name: "fn_state___3", scope: !2, file: !194, line: 88, type: !519, isLocal: true, isDefinition: true)
!1158 = !DIGlobalVariableExpression(var: !1159, expr: !DIExpression())
!1159 = distinct !DIGlobalVariable(name: "f1_index___1", scope: !2, file: !194, line: 89, type: !337, isLocal: true, isDefinition: true)
!1160 = !DIGlobalVariableExpression(var: !1161, expr: !DIExpression())
!1161 = distinct !DIGlobalVariable(name: "fn_index", scope: !2, file: !194, line: 90, type: !395, isLocal: true, isDefinition: true)
!1162 = !DIGlobalVariableExpression(var: !1163, expr: !DIExpression())
!1163 = distinct !DIGlobalVariable(name: "f1_start_char___1", scope: !2, file: !194, line: 91, type: !316, isLocal: true, isDefinition: true)
!1164 = !DIGlobalVariableExpression(var: !1165, expr: !DIExpression())
!1165 = distinct !DIGlobalVariable(name: "fn_start_char", scope: !2, file: !194, line: 92, type: !316, isLocal: true, isDefinition: true)
!1166 = !DIGlobalVariableExpression(var: !1167, expr: !DIExpression())
!1167 = distinct !DIGlobalVariable(name: "f1_end_char___1", scope: !2, file: !194, line: 93, type: !316, isLocal: true, isDefinition: true)
!1168 = !DIGlobalVariableExpression(var: !1169, expr: !DIExpression())
!1169 = distinct !DIGlobalVariable(name: "fn_end_char", scope: !2, file: !194, line: 94, type: !316, isLocal: true, isDefinition: true)
!1170 = !DIGlobalVariableExpression(var: !1171, expr: !DIExpression())
!1171 = distinct !DIGlobalVariable(name: "f1_page_number___1", scope: !2, file: !194, line: 100, type: !316, isLocal: true, isDefinition: true)
!1172 = !DIGlobalVariableExpression(var: !1173, expr: !DIExpression())
!1173 = distinct !DIGlobalVariable(name: "fn_page_number___2", scope: !2, file: !194, line: 101, type: !316, isLocal: true, isDefinition: true)
!1174 = !DIGlobalVariableExpression(var: !1175, expr: !DIExpression())
!1175 = distinct !DIGlobalVariable(name: "escaped___1", scope: !2, file: !194, line: 103, type: !354, isLocal: true, isDefinition: true)
!1176 = !DIGlobalVariableExpression(var: !1177, expr: !DIExpression())
!1177 = distinct !DIGlobalVariable(name: "f1_name___1", scope: !2, file: !194, line: 95, type: !476, isLocal: true, isDefinition: true)
!1178 = !DIGlobalVariableExpression(var: !1179, expr: !DIExpression())
!1179 = distinct !DIGlobalVariable(name: "fn_name___3", scope: !2, file: !194, line: 96, type: !476, isLocal: true, isDefinition: true)
!1180 = !DIGlobalVariableExpression(var: !1181, expr: !DIExpression())
!1181 = distinct !DIGlobalVariable(name: "function", scope: !2, file: !194, line: 102, type: !1077, isLocal: true, isDefinition: true)
!1182 = !DIGlobalVariableExpression(var: !1183, expr: !DIExpression())
!1183 = distinct !DIGlobalVariable(name: "state___9", scope: !2, file: !226, line: 87, type: !520, isLocal: true, isDefinition: true)
!1184 = !DIGlobalVariableExpression(var: !1185, expr: !DIExpression())
!1185 = distinct !DIGlobalVariable(name: "fn_state___4", scope: !2, file: !226, line: 91, type: !521, isLocal: true, isDefinition: true)
!1186 = !DIGlobalVariableExpression(var: !1187, expr: !DIExpression())
!1187 = distinct !DIGlobalVariable(name: "fn_name___4", scope: !2, file: !226, line: 94, type: !476, isLocal: true, isDefinition: true)
!1188 = !DIGlobalVariableExpression(var: !1189, expr: !DIExpression())
!1189 = distinct !DIGlobalVariable(name: "fn_name_index___1", scope: !2, file: !226, line: 93, type: !395, isLocal: true, isDefinition: true)
!1190 = !DIGlobalVariableExpression(var: !1191, expr: !DIExpression())
!1191 = distinct !DIGlobalVariable(name: "saved_braces_depth", scope: !2, file: !226, line: 97, type: !395, isLocal: true, isDefinition: true)
!1192 = !DIGlobalVariableExpression(var: !1193, expr: !DIExpression())
!1193 = distinct !DIGlobalVariable(name: "output_buffer", scope: !2, file: !1194, line: 47, type: !281, isLocal: true, isDefinition: true)
!1194 = !DIFile(filename: "/home/wslee/benchmarks/textformat/trueprint-5.3/src/expand_str.c", directory: "")
