; ModuleID = '/tmp/tmp.ll'
source_filename = "c/twolame-0.3.12.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.slotinfo = type { double, double, i32, double, i32 }
%struct.__anonstruct_k1k2tab_14 = type { i16, i16 }
%struct.__anonstruct_MaskingThreshold_17 = type { i32, double, double }
%struct.twolame_options_struct = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, [4 x i32], i32, i32, double, double, double, i32, i32, [15 x i32], i32, i32, [2 x [1152 x i16]], i32, i32, i32, [2 x [32 x i32]], [2 x [32 x i32]], [2 x [3 x [32 x i32]]], [3 x [32 x i32]], [2 x [32 x double]], [2 x [32 x double]], [2 x [32 x double]], [2 x [3 x [12 x [32 x i32]]]]*, [3 x [12 x [32 x double]]]*, [2 x [3 x [12 x [32 x double]]]]*, double, [2 x i8*], %struct.psycho_0_mem_struct*, %struct.psycho_1_mem_struct*, %struct.psycho_4_mem_struct*, %struct.psycho_3_mem_struct*, %struct.psycho_4_mem_struct*, %struct.subband_mem_struct, %struct.__anonstruct_frame_header_15, i32, i32, i32, [15 x i32] }
%struct.psycho_0_mem_struct = type { [32 x double] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "crit_band", scope: !2, file: !414, line: 47, type: !436, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !35, globals: !411, nameTableKind: GNU)
!3 = !DIFile(filename: "c/twolame-0.3.12.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{!5, !11, !20, !24, !29}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__anonenum_TWOLAME_MPEG_version_10", file: !6, line: 81, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/libtwolame/twolame.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "TWOLAME_MPEG2", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "TWOLAME_MPEG1", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__anonenum_TWOLAME_MPEG_mode_9", file: !6, line: 67, baseType: !12, size: 32, elements: !13)
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = !{!14, !15, !16, !17, !18, !19}
!14 = !DIEnumerator(name: "TWOLAME_AUTO_MODE", value: -1)
!15 = !DIEnumerator(name: "TWOLAME_STEREO", value: 0)
!16 = !DIEnumerator(name: "TWOLAME_JOINT_STEREO", value: 1)
!17 = !DIEnumerator(name: "TWOLAME_DUAL_CHANNEL", value: 2)
!18 = !DIEnumerator(name: "TWOLAME_MONO", value: 3)
!19 = !DIEnumerator(name: "TWOLAME_NOT_SET", value: 4)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__anonenum_TWOLAME_Padding_11", file: !6, line: 88, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23}
!22 = !DIEnumerator(name: "TWOLAME_PAD_NO", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "TWOLAME_PAD_ALL", value: 1, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__anonenum_TWOLAME_Emphasis_12", file: !6, line: 95, baseType: !7, size: 32, elements: !25)
!25 = !{!26, !27, !28}
!26 = !DIEnumerator(name: "TWOLAME_EMPHASIS_N", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "TWOLAME_EMPHASIS_5", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "TWOLAME_EMPHASIS_C", value: 3, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "byte_order", file: !30, line: 37, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/simplefrontend/audio_wave.c", directory: "")
!31 = !{!32, !33, !34}
!32 = !DIEnumerator(name: "order_unknown", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "order_bigEndian", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "order_littleEndian", value: 2, isUnsigned: true)
!35 = !{!12, !36, !37, !39, !41, !107, !85, !87, !90, !93, !54, !108, !166, !7, !168, !169, !172, !40, !174, !176, !192, !213, !188, !201, !215, !140, !228, !233, !242, !245, !259, !247, !305, !311, !316, !326, !285, !377, !378, !389, !221, !390, !392, !29, !394, !395, !396, !397, !400, !403, !407, !409}
!36 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !38, line: 211, baseType: !7)
!38 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "psycho_2_mem", file: !43, line: 203, baseType: !44)
!43 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/libtwolame/common.h", directory: "")
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "psycho_4_mem_struct", file: !43, line: 203, size: 888448, elements: !45)
!45 = !{!46, !47, !48, !49, !50, !51, !52, !57, !58, !59, !60, !61, !62, !63, !64, !65, !69, !70, !71, !72, !76, !77, !78, !79, !80, !82, !84, !86, !89, !92, !98, !99, !103}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "new", scope: !44, file: !43, line: 204, baseType: !12, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "old", scope: !44, file: !43, line: 205, baseType: !12, size: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "oldest", scope: !44, file: !43, line: 206, baseType: !12, size: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !44, file: !43, line: 207, baseType: !12, size: 32, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "sync_flush", scope: !44, file: !43, line: 208, baseType: !12, size: 32, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "syncsize", scope: !44, file: !43, line: 209, baseType: !12, size: 32, offset: 160)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "grouped_c", scope: !44, file: !43, line: 210, baseType: !53, size: 4096, offset: 192)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 4096, elements: !55)
!54 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!55 = !{!56}
!56 = !DISubrange(count: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "grouped_e", scope: !44, file: !43, line: 211, baseType: !53, size: 4096, offset: 4288)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "nb", scope: !44, file: !43, line: 212, baseType: !53, size: 4096, offset: 8384)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !44, file: !43, line: 213, baseType: !53, size: 4096, offset: 12480)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tb", scope: !44, file: !43, line: 214, baseType: !53, size: 4096, offset: 16576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ecb", scope: !44, file: !43, line: 215, baseType: !53, size: 4096, offset: 20672)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !44, file: !43, line: 216, baseType: !53, size: 4096, offset: 24768)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "cbval", scope: !44, file: !43, line: 217, baseType: !53, size: 4096, offset: 28864)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !44, file: !43, line: 218, baseType: !53, size: 4096, offset: 32960)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "wsamp_r", scope: !44, file: !43, line: 219, baseType: !66, size: 65536, offset: 37056)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 65536, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1024)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !44, file: !43, line: 220, baseType: !66, size: 65536, offset: 102592)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "energy", scope: !44, file: !43, line: 221, baseType: !66, size: 65536, offset: 168128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !44, file: !43, line: 222, baseType: !66, size: 65536, offset: 233664)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ath", scope: !44, file: !43, line: 223, baseType: !73, size: 32832, offset: 299200)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 32832, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 513)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "thr", scope: !44, file: !43, line: 224, baseType: !73, size: 32832, offset: 332032)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !44, file: !43, line: 225, baseType: !73, size: 32832, offset: 364864)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "fthr", scope: !44, file: !43, line: 226, baseType: !73, size: 32832, offset: 397696)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "absthr", scope: !44, file: !43, line: 227, baseType: !73, size: 32832, offset: 430528)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "numlines", scope: !44, file: !43, line: 228, baseType: !81, size: 2048, offset: 463360)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 2048, elements: !55)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !44, file: !43, line: 229, baseType: !83, size: 16416, offset: 465408)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 16416, elements: !74)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tmn", scope: !44, file: !43, line: 230, baseType: !85, size: 64, offset: 481856)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !44, file: !43, line: 231, baseType: !87, size: 64, offset: 481920)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "FCB", file: !43, line: 195, baseType: !53)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "lthr", scope: !44, file: !43, line: 232, baseType: !90, size: 64, offset: 481984)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "FHBLK", file: !43, line: 198, baseType: !73)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !44, file: !43, line: 233, baseType: !93, size: 64, offset: 482048)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "F2HBLK", file: !43, line: 199, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 65664, elements: !96)
!96 = !{!97, !75}
!97 = !DISubrange(count: 2)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "phi_sav", scope: !44, file: !43, line: 234, baseType: !93, size: 64, offset: 482112)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "snrtmp", scope: !44, file: !43, line: 235, baseType: !100, size: 4096, offset: 482176)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 4096, elements: !101)
!101 = !{!97, !102}
!102 = !DISubrange(count: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "cos_table", scope: !44, file: !43, line: 236, baseType: !104, size: 402176, offset: 486272)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 402176, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 6284)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !110, line: 49, baseType: !111)
!110 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !112, line: 271, size: 1728, elements: !113)
!112 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !134, !135, !136, !137, !141, !143, !145, !149, !152, !156, !157, !158, !159, !160, !161, !162}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !111, file: !112, line: 272, baseType: !12, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !111, file: !112, line: 273, baseType: !39, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !111, file: !112, line: 274, baseType: !39, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !111, file: !112, line: 275, baseType: !39, size: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !111, file: !112, line: 276, baseType: !39, size: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !111, file: !112, line: 277, baseType: !39, size: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !111, file: !112, line: 278, baseType: !39, size: 64, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !111, file: !112, line: 279, baseType: !39, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !111, file: !112, line: 280, baseType: !39, size: 64, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !111, file: !112, line: 281, baseType: !39, size: 64, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !111, file: !112, line: 282, baseType: !39, size: 64, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !111, file: !112, line: 283, baseType: !39, size: 64, offset: 704)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !111, file: !112, line: 284, baseType: !127, size: 64, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !112, line: 186, size: 192, elements: !129)
!129 = !{!130, !131, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !128, file: !112, line: 187, baseType: !127, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !128, file: !112, line: 188, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !128, file: !112, line: 189, baseType: !12, size: 32, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !111, file: !112, line: 285, baseType: !132, size: 64, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !111, file: !112, line: 286, baseType: !12, size: 32, offset: 896)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !111, file: !112, line: 287, baseType: !12, size: 32, offset: 928)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !111, file: !112, line: 288, baseType: !138, size: 64, offset: 960)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !139, line: 141, baseType: !140)
!139 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!140 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !111, file: !112, line: 289, baseType: !142, size: 16, offset: 1024)
!142 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !111, file: !112, line: 290, baseType: !144, size: 8, offset: 1040)
!144 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !111, file: !112, line: 291, baseType: !146, size: 8, offset: 1048)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 1)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !111, file: !112, line: 292, baseType: !150, size: 64, offset: 1088)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !112, line: 180, baseType: null)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !111, file: !112, line: 293, baseType: !153, size: 64, offset: 1152)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !139, line: 142, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !139, line: 56, baseType: !155)
!155 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !111, file: !112, line: 294, baseType: !107, size: 64, offset: 1216)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !111, file: !112, line: 295, baseType: !107, size: 64, offset: 1280)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !111, file: !112, line: 296, baseType: !107, size: 64, offset: 1344)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !111, file: !112, line: 297, baseType: !107, size: 64, offset: 1408)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !111, file: !112, line: 298, baseType: !37, size: 32, offset: 1472)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !111, file: !112, line: 299, baseType: !12, size: 32, offset: 1504)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !111, file: !112, line: 300, baseType: !163, size: 192, offset: 1536)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 192, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 24)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!168 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 2048, elements: !171)
!171 = !{!102}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "psycho_4_mem", file: !43, line: 203, baseType: !44)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 256, elements: !171)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "psycho_1_mem", file: !43, line: 147, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "psycho_1_mem_struct", file: !43, line: 147, size: 244544, elements: !179)
!179 = !{!180, !183, !187, !189, !190, !191, !200, !209}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !178, file: !43, line: 148, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, elements: !182)
!182 = !{!97}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "fft_buf", scope: !178, file: !43, line: 149, baseType: !184, size: 180224, offset: 64)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 180224, elements: !185)
!185 = !{!97, !186}
!186 = !DISubrange(count: 1408)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "cbound", scope: !178, file: !43, line: 150, baseType: !188, size: 64, offset: 180288)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "crit_band", scope: !178, file: !43, line: 151, baseType: !12, size: 32, offset: 180352)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sub_size", scope: !178, file: !43, line: 152, baseType: !12, size: 32, offset: 180384)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "power", scope: !178, file: !43, line: 153, baseType: !192, size: 64, offset: 180416)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "mask_ptr", file: !43, line: 142, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_mask_14", file: !43, line: 142, size: 192, elements: !195)
!195 = !{!196, !197, !198, !199}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !194, file: !43, line: 143, baseType: !54, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !194, file: !43, line: 144, baseType: !12, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !194, file: !43, line: 145, baseType: !12, size: 32, offset: 96)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !194, file: !43, line: 146, baseType: !12, size: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ltg", scope: !178, file: !43, line: 154, baseType: !201, size: 64, offset: 180480)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "g_ptr", file: !43, line: 137, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_g_thres_13", file: !43, line: 137, size: 256, elements: !204)
!204 = !{!205, !206, !207, !208}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !203, file: !43, line: 138, baseType: !12, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "bark", scope: !203, file: !43, line: 139, baseType: !54, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "hear", scope: !203, file: !43, line: 140, baseType: !54, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !203, file: !43, line: 141, baseType: !54, size: 64, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dbtable", scope: !178, file: !43, line: 155, baseType: !210, size: 64000, offset: 180544)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 64000, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 1000)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "mask", file: !43, line: 142, baseType: !194)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "bit_stream", file: !217, line: 31, baseType: !218)
!217 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/libtwolame/bitbuffer.h", directory: "")
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bit_stream_struc", file: !217, line: 31, size: 320, elements: !219)
!219 = !{!220, !222, !223, !224, !225, !226, !227}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !218, file: !217, line: 32, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !218, file: !217, line: 33, baseType: !12, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "totbit", scope: !218, file: !217, line: 34, baseType: !140, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "buf_byte_idx", scope: !218, file: !217, line: 35, baseType: !12, size: 32, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "buf_bit_idx", scope: !218, file: !217, line: 36, baseType: !12, size: 32, offset: 224)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "eob", scope: !218, file: !217, line: 37, baseType: !12, size: 32, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "eobs", scope: !218, file: !217, line: 38, baseType: !12, size: 32, offset: 288)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "psycho_0_mem", file: !43, line: 126, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "psycho_0_mem_struct", file: !43, line: 126, size: 2048, elements: !231)
!231 = !{!232}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ath_min", scope: !230, file: !43, line: 127, baseType: !170, size: 2048)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "twolame_options", file: !6, line: 111, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "twolame_options_struct", file: !43, line: 281, size: 164608, elements: !236)
!236 = !{!237, !238, !239, !240, !241, !243, !244, !246, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !260, !261, !262, !263, !264, !265, !266, !270, !271, !272, !273, !274, !275, !276, !277, !281, !282, !283, !288, !289, !290, !291, !293, !294, !298, !301, !302, !303, !304, !310, !315, !319, !320, !322, !323, !324, !325, !342, !343, !357, !373, !374, !375, !376}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "samplerate_in", scope: !235, file: !43, line: 282, baseType: !12, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "samplerate_out", scope: !235, file: !43, line: 283, baseType: !12, size: 32, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "num_channels_in", scope: !235, file: !43, line: 284, baseType: !12, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "num_channels_out", scope: !235, file: !43, line: 285, baseType: !12, size: 32, offset: 96)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !235, file: !43, line: 286, baseType: !242, size: 32, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "TWOLAME_MPEG_version", file: !6, line: 81, baseType: !5)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "bitrate", scope: !235, file: !43, line: 287, baseType: !12, size: 32, offset: 160)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !235, file: !43, line: 288, baseType: !245, size: 32, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "TWOLAME_MPEG_mode", file: !6, line: 67, baseType: !11)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !235, file: !43, line: 289, baseType: !247, size: 32, offset: 224)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "TWOLAME_Padding", file: !6, line: 88, baseType: !20)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "do_energy_levels", scope: !235, file: !43, line: 290, baseType: !12, size: 32, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "num_ancillary_bits", scope: !235, file: !43, line: 291, baseType: !12, size: 32, offset: 288)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "psymodel", scope: !235, file: !43, line: 292, baseType: !12, size: 32, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "athlevel", scope: !235, file: !43, line: 293, baseType: !54, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "quickmode", scope: !235, file: !43, line: 294, baseType: !12, size: 32, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "quickcount", scope: !235, file: !43, line: 295, baseType: !12, size: 32, offset: 480)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "vbr", scope: !235, file: !43, line: 296, baseType: !12, size: 32, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_upper_index", scope: !235, file: !43, line: 297, baseType: !12, size: 32, offset: 544)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_max_bitrate", scope: !235, file: !43, line: 298, baseType: !12, size: 32, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "vbrlevel", scope: !235, file: !43, line: 299, baseType: !54, size: 64, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "emphasis", scope: !235, file: !43, line: 300, baseType: !259, size: 32, offset: 704)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "TWOLAME_Emphasis", file: !6, line: 95, baseType: !24)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "copyright", scope: !235, file: !43, line: 301, baseType: !12, size: 32, offset: 736)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !235, file: !43, line: 302, baseType: !12, size: 32, offset: 768)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "private_bit", scope: !235, file: !43, line: 303, baseType: !12, size: 32, offset: 800)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "error_protection", scope: !235, file: !43, line: 304, baseType: !12, size: 32, offset: 832)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "do_dab", scope: !235, file: !43, line: 305, baseType: !7, size: 32, offset: 864)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "dab_crc_len", scope: !235, file: !43, line: 306, baseType: !7, size: 32, offset: 896)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "dab_crc", scope: !235, file: !43, line: 307, baseType: !267, size: 128, offset: 928)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 4)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "dab_xpad_len", scope: !235, file: !43, line: 308, baseType: !7, size: 32, offset: 1056)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !235, file: !43, line: 309, baseType: !12, size: 32, offset: 1088)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !235, file: !43, line: 310, baseType: !54, size: 64, offset: 1152)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "scale_left", scope: !235, file: !43, line: 311, baseType: !54, size: 64, offset: 1216)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "scale_right", scope: !235, file: !43, line: 312, baseType: !54, size: 64, offset: 1280)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "lower_index", scope: !235, file: !43, line: 313, baseType: !12, size: 32, offset: 1344)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "upper_index", scope: !235, file: !43, line: 314, baseType: !12, size: 32, offset: 1376)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "bitrateindextobits", scope: !235, file: !43, line: 315, baseType: !278, size: 480, offset: 1408)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 480, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 15)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_frame_count", scope: !235, file: !43, line: 316, baseType: !12, size: 32, offset: 1888)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "twolame_init", scope: !235, file: !43, line: 317, baseType: !12, size: 32, offset: 1920)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !235, file: !43, line: 318, baseType: !284, size: 36864, offset: 1952)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 36864, elements: !286)
!285 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!286 = !{!97, !287}
!287 = !DISubrange(count: 1152)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "samples_in_buffer", scope: !235, file: !43, line: 319, baseType: !7, size: 32, offset: 38816)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "psycount", scope: !235, file: !43, line: 320, baseType: !7, size: 32, offset: 38848)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "num_crc_bits", scope: !235, file: !43, line: 321, baseType: !7, size: 32, offset: 38880)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "bit_alloc", scope: !235, file: !43, line: 322, baseType: !292, size: 2048, offset: 38912)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !101)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "scfsi", scope: !235, file: !43, line: 323, baseType: !292, size: 2048, offset: 40960)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "scalar", scope: !235, file: !43, line: 324, baseType: !295, size: 6144, offset: 43008)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 6144, elements: !296)
!296 = !{!97, !297, !102}
!297 = !DISubrange(count: 3)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "j_scale", scope: !235, file: !43, line: 325, baseType: !299, size: 3072, offset: 49152)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 3072, elements: !300)
!300 = !{!297, !102}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "smrdef", scope: !235, file: !43, line: 326, baseType: !100, size: 4096, offset: 52224)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "smr", scope: !235, file: !43, line: 327, baseType: !100, size: 4096, offset: 56320)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "max_sc", scope: !235, file: !43, line: 328, baseType: !100, size: 4096, offset: 60416)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "subband", scope: !235, file: !43, line: 329, baseType: !305, size: 64, offset: 64512)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "subband_t", file: !43, line: 270, baseType: !307)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 73728, elements: !308)
!308 = !{!97, !297, !309, !102}
!309 = !DISubrange(count: 12)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "j_sample", scope: !235, file: !43, line: 330, baseType: !311, size: 64, offset: 64576)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "jsb_sample_t", file: !43, line: 271, baseType: !313)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 73728, elements: !314)
!314 = !{!297, !309, !102}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "sb_sample", scope: !235, file: !43, line: 331, baseType: !316, size: 64, offset: 64640)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "sb_sample_t", file: !43, line: 272, baseType: !318)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 147456, elements: !308)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "resample_ratio", scope: !235, file: !43, line: 332, baseType: !54, size: 64, offset: 64704)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "resample_handle", scope: !235, file: !43, line: 333, baseType: !321, size: 128, offset: 64768)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 128, elements: !182)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "p0mem", scope: !235, file: !43, line: 334, baseType: !228, size: 64, offset: 64896)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "p1mem", scope: !235, file: !43, line: 335, baseType: !176, size: 64, offset: 64960)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "p2mem", scope: !235, file: !43, line: 336, baseType: !41, size: 64, offset: 65024)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "p3mem", scope: !235, file: !43, line: 337, baseType: !326, size: 64, offset: 65088)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "psycho_3_mem", file: !43, line: 166, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "psycho_3_mem_struct", file: !43, line: 166, size: 315392, elements: !329)
!329 = !{!330, !331, !335, !336, !337, !338, !339, !341}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !328, file: !43, line: 167, baseType: !181, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "freq_subset", scope: !328, file: !43, line: 168, baseType: !332, size: 4352, offset: 64)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 4352, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 136)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "bark", scope: !328, file: !43, line: 169, baseType: !73, size: 32832, offset: 4416)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ath", scope: !328, file: !43, line: 170, baseType: !73, size: 32832, offset: 37248)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "fft_buf", scope: !328, file: !43, line: 171, baseType: !184, size: 180224, offset: 70080)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "cbands", scope: !328, file: !43, line: 172, baseType: !12, size: 32, offset: 250304)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "cbandindex", scope: !328, file: !43, line: 173, baseType: !340, size: 1024, offset: 250336)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 1024, elements: !171)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "dbtable", scope: !328, file: !43, line: 174, baseType: !210, size: 64000, offset: 251392)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "p4mem", scope: !235, file: !43, line: 338, baseType: !172, size: 64, offset: 65152)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "smem", scope: !235, file: !43, line: 339, baseType: !344, size: 98432, offset: 65216)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "subband_mem", file: !43, line: 239, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "subband_mem_struct", file: !43, line: 239, size: 98432, elements: !346)
!346 = !{!347, !351, !355, !356}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !345, file: !43, line: 240, baseType: !348, size: 65536)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 65536, elements: !349)
!349 = !{!97, !350}
!350 = !DISubrange(count: 512)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !345, file: !43, line: 241, baseType: !352, size: 32768, offset: 65536)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 32768, elements: !353)
!353 = !{!354, !102}
!354 = !DISubrange(count: 16)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !345, file: !43, line: 242, baseType: !181, size: 64, offset: 98304)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "half", scope: !345, file: !43, line: 243, baseType: !181, size: 64, offset: 98368)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !235, file: !43, line: 340, baseType: !358, size: 384, offset: 163648)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "frame_header", file: !43, line: 253, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_frame_header_15", file: !43, line: 253, size: 384, elements: !360)
!360 = !{!361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !359, file: !43, line: 254, baseType: !12, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !359, file: !43, line: 255, baseType: !12, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "error_protection", scope: !359, file: !43, line: 256, baseType: !12, size: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "bitrate_index", scope: !359, file: !43, line: 257, baseType: !12, size: 32, offset: 96)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "samplerate_idx", scope: !359, file: !43, line: 258, baseType: !12, size: 32, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !359, file: !43, line: 259, baseType: !12, size: 32, offset: 160)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "private_bit", scope: !359, file: !43, line: 260, baseType: !12, size: 32, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !359, file: !43, line: 261, baseType: !12, size: 32, offset: 224)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "mode_ext", scope: !359, file: !43, line: 262, baseType: !12, size: 32, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "copyright", scope: !359, file: !43, line: 263, baseType: !12, size: 32, offset: 288)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !359, file: !43, line: 264, baseType: !12, size: 32, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "emphasis", scope: !359, file: !43, line: 265, baseType: !12, size: 32, offset: 352)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "jsbound", scope: !235, file: !43, line: 341, baseType: !12, size: 32, offset: 164032)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sblimit", scope: !235, file: !43, line: 342, baseType: !12, size: 32, offset: 164064)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tablenum", scope: !235, file: !43, line: 343, baseType: !12, size: 32, offset: 164096)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "vbrstats", scope: !235, file: !43, line: 344, baseType: !278, size: 480, offset: 164128)
!377 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "wave_info_t", file: !380, line: 25, baseType: !381)
!380 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/simplefrontend/audio_wave.h", directory: "")
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wave_info_struct", file: !380, line: 25, size: 320, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !388}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "soundfile", scope: !381, file: !380, line: 26, baseType: !108, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !381, file: !380, line: 27, baseType: !285, size: 16, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "num_samples", scope: !381, file: !380, line: 28, baseType: !168, size: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "samplesize", scope: !381, file: !380, line: 29, baseType: !285, size: 16, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "samplerate", scope: !381, file: !380, line: 30, baseType: !12, size: 32, offset: 224)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "byteswap", scope: !381, file: !380, line: 31, baseType: !12, size: 32, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !285)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 24576, elements: !399)
!399 = !{!309, !102}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 18432, elements: !402)
!402 = !{!287}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 16896, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 1056)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, elements: !171)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 36864, elements: !314)
!411 = !{!412, !416, !419, !429, !0, !434, !439, !444, !455, !460, !462, !464, !471, !474, !477, !479, !483, !488, !492, !496, !501, !503, !506, !508, !510, !512, !514, !516, !520, !522, !524, !531, !536, !548, !551, !553, !557, !560, !566, !569, !571, !576}
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression(DW_OP_constu, 4617878467915022336, DW_OP_stack_value))
!413 = distinct !DIGlobalVariable(name: "nmt", scope: !2, file: !414, line: 45, type: !415, isLocal: true, isDefinition: true)
!414 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/libtwolame/psycho_2.c", directory: "")
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression(DW_OP_constu, 4617878467915022336, DW_OP_stack_value))
!417 = distinct !DIGlobalVariable(name: "NMT", scope: !2, file: !418, line: 70, type: !415, isLocal: true, isDefinition: true)
!418 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/libtwolame/psycho_4.c", directory: "")
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "slots", scope: !2, file: !421, line: 33, type: !422, isLocal: false, isDefinition: true)
!421 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/libtwolame/availbits.c", directory: "")
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotinfo", file: !421, line: 33, size: 320, elements: !423)
!423 = !{!424, !425, !426, !427, !428}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "average", scope: !422, file: !421, line: 34, baseType: !54, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "frac", scope: !422, file: !421, line: 35, baseType: !54, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "whole", scope: !422, file: !421, line: 36, baseType: !12, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !422, file: !421, line: 37, baseType: !54, size: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !422, file: !421, line: 38, baseType: !12, size: 32, offset: 256)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "absthr_table", scope: !2, file: !431, line: 29, type: !432, isLocal: true, isDefinition: true)
!431 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/libtwolame/psycho_2_absthr.h", directory: "")
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 131328, elements: !433)
!433 = !{!269, !75}
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "bmax", scope: !2, file: !414, line: 53, type: !436, isLocal: true, isDefinition: true)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 1728, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 27)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "enwindow", scope: !2, file: !441, line: 26, type: !442, isLocal: true, isDefinition: true)
!441 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/libtwolame/enwindow.h", directory: "")
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 32768, elements: !443)
!443 = !{!350}
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "k1k2tab", scope: !2, file: !446, line: 117, type: !447, isLocal: true, isDefinition: true)
!446 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/libtwolame/fft.c", directory: "")
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 15872, elements: !453)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_k1k2tab_14", file: !446, line: 117, size: 32, elements: !450)
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !449, file: !446, line: 118, baseType: !142, size: 16)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !449, file: !446, line: 119, baseType: !142, size: 16, offset: 16)
!453 = !{!454}
!454 = !DISubrange(count: 496)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "costab", scope: !2, file: !446, line: 70, type: !457, isLocal: true, isDefinition: true)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 1280, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 20)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "sintab", scope: !2, file: !446, line: 88, type: !457, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "minval", scope: !2, file: !418, line: 74, type: !436, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "table_sblimit", scope: !2, file: !466, line: 107, type: !467, isLocal: true, isDefinition: true)
!466 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/libtwolame/encode.c", directory: "")
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 160, elements: !469)
!468 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!469 = !{!470}
!470 = !DISubrange(count: 5)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "jsb_table", scope: !2, file: !466, line: 164, type: !473, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 128, elements: !268)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "scalefactor", scope: !2, file: !466, line: 124, type: !476, isLocal: true, isDefinition: true)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 4096, elements: !55)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "multiple", scope: !2, file: !466, line: 37, type: !476, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "pattern", scope: !2, file: !466, line: 379, type: !481, isLocal: true, isDefinition: true)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 800, elements: !482)
!482 = !{!470, !470}
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "nbal", scope: !2, file: !466, line: 88, type: !485, isLocal: true, isDefinition: true)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 288, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: 9)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "line", scope: !2, file: !466, line: 113, type: !490, isLocal: true, isDefinition: true)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 5120, elements: !491)
!491 = !{!470, !102}
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "step_index", scope: !2, file: !466, line: 75, type: !494, isLocal: true, isDefinition: true)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 4608, elements: !495)
!495 = !{!487, !354}
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "a", scope: !2, file: !466, line: 545, type: !498, isLocal: true, isDefinition: true)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 1152, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 18)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "b", scope: !2, file: !466, line: 553, type: !498, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "steps2n", scope: !2, file: !466, line: 95, type: !505, isLocal: true, isDefinition: true)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 576, elements: !499)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "group", scope: !2, file: !466, line: 100, type: !505, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "bits", scope: !2, file: !466, line: 97, type: !505, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "steps", scope: !2, file: !466, line: 93, type: !505, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "SNR", scope: !2, file: !466, line: 155, type: !498, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "sfsPerScfsi", scope: !2, file: !466, line: 741, type: !473, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "vbrlimits", scope: !2, file: !466, line: 826, type: !518, isLocal: true, isDefinition: true)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 384, elements: !519)
!519 = !{!97, !297, !97}
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "sfsPerScfsi___0", scope: !2, file: !466, line: 1057, type: !473, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "sfsPerScfsi___1", scope: !2, file: !466, line: 1207, type: !473, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "SecondCriticalBand", scope: !2, file: !526, line: 29, type: !527, isLocal: true, isDefinition: true)
!526 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/libtwolame/psycho_1_critband.h", directory: "")
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 6272, elements: !528)
!528 = !{!529, !530}
!529 = !DISubrange(count: 7)
!530 = !DISubrange(count: 28)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "SecondFreqEntries", scope: !2, file: !533, line: 38, type: !534, isLocal: true, isDefinition: true)
!533 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/libtwolame/psycho_1_freqtable.h", directory: "")
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 224, elements: !535)
!535 = !{!529}
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "SecondFreqSubband", scope: !2, file: !533, line: 42, type: !538, isLocal: true, isDefinition: true)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 177408, elements: !546)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskingThreshold", file: !533, line: 29, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_MaskingThreshold_17", file: !533, line: 29, size: 192, elements: !542)
!542 = !{!543, !544, !545}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !541, file: !533, line: 30, baseType: !12, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "bark", scope: !541, file: !533, line: 31, baseType: !54, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "hear", scope: !541, file: !533, line: 32, baseType: !54, size: 64, offset: 128)
!546 = !{!529, !547}
!547 = !DISubrange(count: 132)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "init", scope: !2, file: !550, line: 171, type: !12, isLocal: true, isDefinition: true)
!550 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/libtwolame/psycho_1.c", directory: "")
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "window", scope: !2, file: !550, line: 172, type: !66, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "snrdef", scope: !2, file: !555, line: 40, type: !556, isLocal: true, isDefinition: true)
!555 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/libtwolame/psycho_n1.c", directory: "")
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 2048, elements: !171)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "putmask", scope: !2, file: !559, line: 83, type: !485, isLocal: true, isDefinition: true)
!559 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/libtwolame/bitbuffer.c", directory: "")
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "mode_name", scope: !2, file: !562, line: 60, type: !563, isLocal: true, isDefinition: true)
!562 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/libtwolame/get_set.c", directory: "")
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 384, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 6)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "init___1", scope: !2, file: !568, line: 79, type: !12, isLocal: true, isDefinition: true)
!568 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/libtwolame/psycho_3.c", directory: "")
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "window___1", scope: !2, file: !568, line: 80, type: !66, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "version_name", scope: !2, file: !573, line: 66, type: !574, isLocal: true, isDefinition: true)
!573 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/libtwolame/util.c", directory: "")
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 192, elements: !575)
!575 = !{!297}
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "bitrate_table", scope: !2, file: !573, line: 56, type: !578, isLocal: true, isDefinition: true)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 960, elements: !579)
!579 = !{!97, !280}
!580 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!581 = !{i32 2, !"Dwarf Version", i32 4}
!582 = !{i32 2, !"Debug Info Version", i32 3}
!583 = !{i32 1, !"wchar_size", i32 4}
!584 = !{i32 7, !"PIC Level", i32 2}
!585 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!586 = distinct !DISubprogram(name: "get_required_energy_bits", scope: !587, file: !587, line: 38, type: !588, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !590)
!587 = !DIFile(filename: "/home/wslee/benchmarks/sound/twolame-0.3.12/libtwolame/energy.c", directory: "")
!588 = !DISubroutineType(types: !589)
!589 = !{!12, !233}
!590 = !{}
!591 = !DILocalVariable(name: "glopts", arg: 1, scope: !586, file: !587, line: 38, type: !233)
!592 = !DILocation(line: 0, scope: !586)
!593 = !DILocation(line: 40, column: 21, scope: !594)
!594 = distinct !DILexicalBlock(scope: !595, file: !587, line: 40, column: 7)
