; ModuleID = '/tmp/tmp.ll'
source_filename = "c/unhtml-2.3.9.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.table = type { i8*, i32 }

@.str = private unnamed_addr constant [54 x i8] c"unhtml  Version 2.3  Copyright (C) 1998 by Kevin Swan\00", align 1
@VERSION = global i8* getelementptr inbounds ([54 x i8], [54 x i8]* @.str, i32 0, i32 0), align 8, !dbg !0
@.str.1 = private unnamed_addr constant [31 x i8] c"unhtml -version | [ filename ]\00", align 1
@USAGE = global i8* getelementptr inbounds ([31 x i8], [31 x i8]* @.str.1, i32 0, i32 0), align 8, !dbg !78
@stderr = external global %struct._IO_FILE*, align 8
@.str.2 = private unnamed_addr constant [11 x i8] c"Usage: %s\0A\00", align 1
@.str.3 = private unnamed_addr constant [9 x i8] c"-version\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str.5 = private unnamed_addr constant [37 x i8] c"Cannot malloc tag space (%d bytes).\0A\00", align 1
@.str.6 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.7 = private unnamed_addr constant [38 x i8] c"Error opening file [%s] for reading.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "VERSION", scope: !2, file: !80, line: 26, type: !15, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !77, nameTableKind: GNU)
!3 = !DIFile(filename: "c/unhtml-2.3.9.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !71, !63, !15, !73, !58, !16, !13, !74, !76}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !8, line: 49, baseType: !9)
!8 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !10, line: 271, size: 1728, elements: !11)
!10 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!11 = !{!12, !14, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !35, !36, !37, !38, !42, !44, !46, !50, !53, !57, !59, !60, !61, !62, !66, !67}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !9, file: !10, line: 272, baseType: !13, size: 32)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !9, file: !10, line: 273, baseType: !15, size: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !9, file: !10, line: 274, baseType: !15, size: 64, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !9, file: !10, line: 275, baseType: !15, size: 64, offset: 192)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !9, file: !10, line: 276, baseType: !15, size: 64, offset: 256)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !9, file: !10, line: 277, baseType: !15, size: 64, offset: 320)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !9, file: !10, line: 278, baseType: !15, size: 64, offset: 384)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !9, file: !10, line: 279, baseType: !15, size: 64, offset: 448)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !9, file: !10, line: 280, baseType: !15, size: 64, offset: 512)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !9, file: !10, line: 281, baseType: !15, size: 64, offset: 576)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !9, file: !10, line: 282, baseType: !15, size: 64, offset: 640)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !9, file: !10, line: 283, baseType: !15, size: 64, offset: 704)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !9, file: !10, line: 284, baseType: !28, size: 64, offset: 768)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !10, line: 186, size: 192, elements: !30)
!30 = !{!31, !32, !34}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !29, file: !10, line: 187, baseType: !28, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !29, file: !10, line: 188, baseType: !33, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !29, file: !10, line: 189, baseType: !13, size: 32, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !9, file: !10, line: 285, baseType: !33, size: 64, offset: 832)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !9, file: !10, line: 286, baseType: !13, size: 32, offset: 896)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !9, file: !10, line: 287, baseType: !13, size: 32, offset: 928)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !9, file: !10, line: 288, baseType: !39, size: 64, offset: 960)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !40, line: 141, baseType: !41)
!40 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!41 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !9, file: !10, line: 289, baseType: !43, size: 16, offset: 1024)
!43 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !9, file: !10, line: 290, baseType: !45, size: 8, offset: 1040)
!45 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !9, file: !10, line: 291, baseType: !47, size: 8, offset: 1048)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 1)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !9, file: !10, line: 292, baseType: !51, size: 64, offset: 1088)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !10, line: 180, baseType: null)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !9, file: !10, line: 293, baseType: !54, size: 64, offset: 1152)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !40, line: 142, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !40, line: 56, baseType: !56)
!56 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !9, file: !10, line: 294, baseType: !58, size: 64, offset: 1216)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !9, file: !10, line: 295, baseType: !58, size: 64, offset: 1280)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !9, file: !10, line: 296, baseType: !58, size: 64, offset: 1344)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !9, file: !10, line: 297, baseType: !58, size: 64, offset: 1408)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !9, file: !10, line: 298, baseType: !63, size: 32, offset: 1472)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !64, line: 211, baseType: !65)
!64 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!65 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !9, file: !10, line: 299, baseType: !13, size: 32, offset: 1504)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !9, file: !10, line: 300, baseType: !68, size: 192, offset: 1536)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 192, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 24)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!73 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!77 = !{!0, !78, !81, !91, !96, !98, !100, !103, !105}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "USAGE", scope: !2, file: !80, line: 27, type: !15, isLocal: false, isDefinition: true)
!80 = !DIFile(filename: "/home/wslee/benchmarks/textformat/unhtml-2.3.9/unhtml.c", directory: "")
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "ktbl", scope: !2, file: !83, line: 29, type: !84, isLocal: false, isDefinition: true)
!83 = !DIFile(filename: "/home/wslee/benchmarks/textformat/unhtml-2.3.9/esc.c", directory: "")
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 12928, elements: !89)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "table", file: !83, line: 29, size: 128, elements: !86)
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !85, file: !83, line: 30, baseType: !15, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !85, file: !83, line: 31, baseType: !13, size: 32, offset: 64)
!89 = !{!90}
!90 = !DISubrange(count: 101)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "bff", scope: !2, file: !83, line: 17, type: !93, isLocal: true, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 56, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 7)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "mode", scope: !2, file: !83, line: 16, type: !13, isLocal: true, isDefinition: true)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "index", scope: !2, file: !83, line: 18, type: !13, isLocal: true, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "taglen", scope: !2, file: !102, line: 139, type: !13, isLocal: true, isDefinition: true)
!102 = !DIFile(filename: "/home/wslee/benchmarks/textformat/unhtml-2.3.9/ops.c", directory: "")
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "ptr", scope: !2, file: !102, line: 138, type: !15, isLocal: true, isDefinition: true)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "html", scope: !2, file: !102, line: 112, type: !107, isLocal: true, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 5824, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 91)
!110 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!111 = !{i32 2, !"Dwarf Version", i32 4}
!112 = !{i32 2, !"Debug Info Version", i32 3}
!113 = !{i32 1, !"wchar_size", i32 4}
!114 = !{i32 7, !"PIC Level", i32 2}
!115 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!116 = distinct !DISubprogram(name: "main", scope: !80, file: !80, line: 31, type: !117, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!117 = !DISubroutineType(types: !118)
!118 = !{!13, !13, !76}
!119 = !DILocalVariable(name: "argc", arg: 1, scope: !116, file: !80, line: 31, type: !13)
!120 = !DILocation(line: 0, scope: !116)
!121 = !DILocalVariable(name: "argv", arg: 2, scope: !116, file: !80, line: 31, type: !76)
!122 = !DILocalVariable(name: "__cil_tmp27", scope: !116, file: !80, line: 57, type: !15)
!123 = !DILocation(line: 57, column: 9, scope: !116)
!124 = !DILocalVariable(name: "__cil_tmp28", scope: !116, file: !80, line: 58, type: !15)
!125 = !DILocation(line: 58, column: 9, scope: !116)
!126 = !DILocalVariable(name: "__cil_tmp29", scope: !116, file: !80, line: 59, type: !15)
!127 = !DILocation(line: 59, column: 9, scope: !116)
!128 = !DILocalVariable(name: "__cil_tmp30", scope: !116, file: !80, line: 60, type: !15)
!129 = !DILocation(line: 60, column: 9, scope: !116)
!130 = !DILocalVariable(name: "__cil_tmp31", scope: !116, file: !80, line: 61, type: !15)
!131 = !DILocation(line: 61, column: 9, scope: !116)
!132 = !DILocalVariable(name: "__cil_tmp32", scope: !116, file: !80, line: 62, type: !15)
!133 = !DILocation(line: 62, column: 9, scope: !116)
!134 = !DILocalVariable(name: "__cil_tmp33", scope: !116, file: !80, line: 63, type: !15)
!135 = !DILocation(line: 63, column: 9, scope: !116)
!136 = !DILocalVariable(name: "__cil_tmp34", scope: !116, file: !80, line: 64, type: !15)
!137 = !DILocation(line: 64, column: 9, scope: !116)
!138 = !DILocalVariable(name: "__cil_tmp35", scope: !116, file: !80, line: 65, type: !15)
!139 = !DILocation(line: 65, column: 9, scope: !116)
!140 = !DILocalVariable(name: "__cil_tmp36", scope: !116, file: !80, line: 66, type: !15)
!141 = !DILocation(line: 66, column: 9, scope: !116)
!142 = !DILocalVariable(name: "__cil_tmp37", scope: !116, file: !80, line: 67, type: !15)
!143 = !DILocation(line: 67, column: 9, scope: !116)
