; ModuleID = '/tmp/tmp.ll'
source_filename = "c/unrtf-0.19.3.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.__anonstruct_OutputPersonality_23 = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__anonstruct_chars_24, i8**, i8, i8**, i16, i16, i8**, i16, i16, i8**, i16, i16, i8**, i16, i16, void (i32, i32, i32)* }
%struct.__anonstruct_chars_24 = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8* }
%struct._hi = type { %struct._hi*, i8*, i64 }
%struct._stack = type { [10000 x i8], [10000 x i8*], i32, %struct._stack* }
%struct.__anonstruct_FontEntry_30 = type { i32, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "indent_level", scope: !2, file: !540, line: 67, type: !143, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !263, nameTableKind: GNU)
!3 = !DIFile(filename: "c/unrtf-0.19.3.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !12, !163, !164, !167, !168, !226, !143, !228, !148, !237, !246, !202, !247, !260, !13, !261, !243, !166}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputPersonality", file: !8, line: 37, baseType: !9)
!8 = !DIFile(filename: "/home/wslee/benchmarks/textformat/unrtf-0.19.3/output.h", directory: "")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_OutputPersonality_23", file: !8, line: 37, size: 8640, elements: !10)
!10 = !{!11, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !140, !142, !144, !145, !146, !147, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "comment_begin", scope: !9, file: !8, line: 38, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "comment_end", scope: !9, file: !8, line: 39, baseType: !12, size: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "document_begin", scope: !9, file: !8, line: 40, baseType: !12, size: 64, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "document_end", scope: !9, file: !8, line: 41, baseType: !12, size: 64, offset: 192)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "header_begin", scope: !9, file: !8, line: 42, baseType: !12, size: 64, offset: 256)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "header_end", scope: !9, file: !8, line: 43, baseType: !12, size: 64, offset: 320)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "document_title_begin", scope: !9, file: !8, line: 44, baseType: !12, size: 64, offset: 384)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "document_title_end", scope: !9, file: !8, line: 45, baseType: !12, size: 64, offset: 448)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "document_keywords_begin", scope: !9, file: !8, line: 46, baseType: !12, size: 64, offset: 512)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "document_keywords_end", scope: !9, file: !8, line: 47, baseType: !12, size: 64, offset: 576)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "document_author_begin", scope: !9, file: !8, line: 48, baseType: !12, size: 64, offset: 640)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "document_author_end", scope: !9, file: !8, line: 49, baseType: !12, size: 64, offset: 704)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "document_changedate_begin", scope: !9, file: !8, line: 50, baseType: !12, size: 64, offset: 768)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "document_changedate_end", scope: !9, file: !8, line: 51, baseType: !12, size: 64, offset: 832)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "body_begin", scope: !9, file: !8, line: 52, baseType: !12, size: 64, offset: 896)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "body_end", scope: !9, file: !8, line: 53, baseType: !12, size: 64, offset: 960)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "word_begin", scope: !9, file: !8, line: 54, baseType: !12, size: 64, offset: 1024)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "word_end", scope: !9, file: !8, line: 55, baseType: !12, size: 64, offset: 1088)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "paragraph_begin", scope: !9, file: !8, line: 56, baseType: !12, size: 64, offset: 1152)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "paragraph_end", scope: !9, file: !8, line: 57, baseType: !12, size: 64, offset: 1216)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "center_begin", scope: !9, file: !8, line: 58, baseType: !12, size: 64, offset: 1280)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "center_end", scope: !9, file: !8, line: 59, baseType: !12, size: 64, offset: 1344)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "align_left_begin", scope: !9, file: !8, line: 60, baseType: !12, size: 64, offset: 1408)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "align_left_end", scope: !9, file: !8, line: 61, baseType: !12, size: 64, offset: 1472)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "align_right_begin", scope: !9, file: !8, line: 62, baseType: !12, size: 64, offset: 1536)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "align_right_end", scope: !9, file: !8, line: 63, baseType: !12, size: 64, offset: 1600)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "justify_begin", scope: !9, file: !8, line: 64, baseType: !12, size: 64, offset: 1664)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "justify_end", scope: !9, file: !8, line: 65, baseType: !12, size: 64, offset: 1728)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "forced_space", scope: !9, file: !8, line: 66, baseType: !12, size: 64, offset: 1792)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "line_break", scope: !9, file: !8, line: 67, baseType: !12, size: 64, offset: 1856)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "page_break", scope: !9, file: !8, line: 68, baseType: !12, size: 64, offset: 1920)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "hyperlink_begin", scope: !9, file: !8, line: 69, baseType: !12, size: 64, offset: 1984)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "hyperlink_end", scope: !9, file: !8, line: 70, baseType: !12, size: 64, offset: 2048)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "imagelink_begin", scope: !9, file: !8, line: 71, baseType: !12, size: 64, offset: 2112)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "imagelink_end", scope: !9, file: !8, line: 72, baseType: !12, size: 64, offset: 2176)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "table_begin", scope: !9, file: !8, line: 73, baseType: !12, size: 64, offset: 2240)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "table_end", scope: !9, file: !8, line: 74, baseType: !12, size: 64, offset: 2304)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "table_row_begin", scope: !9, file: !8, line: 75, baseType: !12, size: 64, offset: 2368)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "table_row_end", scope: !9, file: !8, line: 76, baseType: !12, size: 64, offset: 2432)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "table_cell_begin", scope: !9, file: !8, line: 77, baseType: !12, size: 64, offset: 2496)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "table_cell_end", scope: !9, file: !8, line: 78, baseType: !12, size: 64, offset: 2560)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "font_begin", scope: !9, file: !8, line: 79, baseType: !12, size: 64, offset: 2624)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "font_end", scope: !9, file: !8, line: 80, baseType: !12, size: 64, offset: 2688)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize_begin", scope: !9, file: !8, line: 81, baseType: !12, size: 64, offset: 2752)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize_end", scope: !9, file: !8, line: 82, baseType: !12, size: 64, offset: 2816)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize8_begin", scope: !9, file: !8, line: 83, baseType: !12, size: 64, offset: 2880)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize8_end", scope: !9, file: !8, line: 84, baseType: !12, size: 64, offset: 2944)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize10_begin", scope: !9, file: !8, line: 85, baseType: !12, size: 64, offset: 3008)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize10_end", scope: !9, file: !8, line: 86, baseType: !12, size: 64, offset: 3072)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize12_begin", scope: !9, file: !8, line: 87, baseType: !12, size: 64, offset: 3136)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize12_end", scope: !9, file: !8, line: 88, baseType: !12, size: 64, offset: 3200)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize14_begin", scope: !9, file: !8, line: 89, baseType: !12, size: 64, offset: 3264)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize14_end", scope: !9, file: !8, line: 90, baseType: !12, size: 64, offset: 3328)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize18_begin", scope: !9, file: !8, line: 91, baseType: !12, size: 64, offset: 3392)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize18_end", scope: !9, file: !8, line: 92, baseType: !12, size: 64, offset: 3456)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize24_begin", scope: !9, file: !8, line: 93, baseType: !12, size: 64, offset: 3520)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize24_end", scope: !9, file: !8, line: 94, baseType: !12, size: 64, offset: 3584)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize36_begin", scope: !9, file: !8, line: 95, baseType: !12, size: 64, offset: 3648)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize36_end", scope: !9, file: !8, line: 96, baseType: !12, size: 64, offset: 3712)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize48_begin", scope: !9, file: !8, line: 97, baseType: !12, size: 64, offset: 3776)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize48_end", scope: !9, file: !8, line: 98, baseType: !12, size: 64, offset: 3840)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "smaller_begin", scope: !9, file: !8, line: 99, baseType: !12, size: 64, offset: 3904)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "smaller_end", scope: !9, file: !8, line: 100, baseType: !12, size: 64, offset: 3968)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "bigger_begin", scope: !9, file: !8, line: 101, baseType: !12, size: 64, offset: 4032)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "bigger_end", scope: !9, file: !8, line: 102, baseType: !12, size: 64, offset: 4096)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "foreground_begin", scope: !9, file: !8, line: 103, baseType: !12, size: 64, offset: 4160)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "foreground_end", scope: !9, file: !8, line: 104, baseType: !12, size: 64, offset: 4224)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "background_begin", scope: !9, file: !8, line: 105, baseType: !12, size: 64, offset: 4288)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "background_end", scope: !9, file: !8, line: 106, baseType: !12, size: 64, offset: 4352)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "bold_begin", scope: !9, file: !8, line: 107, baseType: !12, size: 64, offset: 4416)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "bold_end", scope: !9, file: !8, line: 108, baseType: !12, size: 64, offset: 4480)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "italic_begin", scope: !9, file: !8, line: 109, baseType: !12, size: 64, offset: 4544)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "italic_end", scope: !9, file: !8, line: 110, baseType: !12, size: 64, offset: 4608)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "underline_begin", scope: !9, file: !8, line: 111, baseType: !12, size: 64, offset: 4672)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "underline_end", scope: !9, file: !8, line: 112, baseType: !12, size: 64, offset: 4736)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "dbl_underline_begin", scope: !9, file: !8, line: 113, baseType: !12, size: 64, offset: 4800)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dbl_underline_end", scope: !9, file: !8, line: 114, baseType: !12, size: 64, offset: 4864)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "superscript_begin", scope: !9, file: !8, line: 115, baseType: !12, size: 64, offset: 4928)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "superscript_end", scope: !9, file: !8, line: 116, baseType: !12, size: 64, offset: 4992)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "subscript_begin", scope: !9, file: !8, line: 117, baseType: !12, size: 64, offset: 5056)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "subscript_end", scope: !9, file: !8, line: 118, baseType: !12, size: 64, offset: 5120)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "strikethru_begin", scope: !9, file: !8, line: 119, baseType: !12, size: 64, offset: 5184)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "strikethru_end", scope: !9, file: !8, line: 120, baseType: !12, size: 64, offset: 5248)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "dbl_strikethru_begin", scope: !9, file: !8, line: 121, baseType: !12, size: 64, offset: 5312)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "dbl_strikethru_end", scope: !9, file: !8, line: 122, baseType: !12, size: 64, offset: 5376)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "emboss_begin", scope: !9, file: !8, line: 123, baseType: !12, size: 64, offset: 5440)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "emboss_end", scope: !9, file: !8, line: 124, baseType: !12, size: 64, offset: 5504)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "engrave_begin", scope: !9, file: !8, line: 125, baseType: !12, size: 64, offset: 5568)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "engrave_end", scope: !9, file: !8, line: 126, baseType: !12, size: 64, offset: 5632)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "shadow_begin", scope: !9, file: !8, line: 127, baseType: !12, size: 64, offset: 5696)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "shadow_end", scope: !9, file: !8, line: 128, baseType: !12, size: 64, offset: 5760)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "outline_begin", scope: !9, file: !8, line: 129, baseType: !12, size: 64, offset: 5824)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "outline_end", scope: !9, file: !8, line: 130, baseType: !12, size: 64, offset: 5888)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "small_caps_begin", scope: !9, file: !8, line: 131, baseType: !12, size: 64, offset: 5952)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "small_caps_end", scope: !9, file: !8, line: 132, baseType: !12, size: 64, offset: 6016)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pointlist_begin", scope: !9, file: !8, line: 133, baseType: !12, size: 64, offset: 6080)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "pointlist_end", scope: !9, file: !8, line: 134, baseType: !12, size: 64, offset: 6144)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "pointlist_item_begin", scope: !9, file: !8, line: 135, baseType: !12, size: 64, offset: 6208)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "pointlist_item_end", scope: !9, file: !8, line: 136, baseType: !12, size: 64, offset: 6272)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "numericlist_begin", scope: !9, file: !8, line: 137, baseType: !12, size: 64, offset: 6336)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "numericlist_end", scope: !9, file: !8, line: 138, baseType: !12, size: 64, offset: 6400)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "numericlist_item_begin", scope: !9, file: !8, line: 139, baseType: !12, size: 64, offset: 6464)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "numericlist_item_end", scope: !9, file: !8, line: 140, baseType: !12, size: 64, offset: 6528)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "expand_begin", scope: !9, file: !8, line: 141, baseType: !12, size: 64, offset: 6592)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "expand_end", scope: !9, file: !8, line: 142, baseType: !12, size: 64, offset: 6656)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "toc_entry_begin", scope: !9, file: !8, line: 143, baseType: !12, size: 64, offset: 6720)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "toc_entry_end", scope: !9, file: !8, line: 144, baseType: !12, size: 64, offset: 6784)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "index_entry_begin", scope: !9, file: !8, line: 145, baseType: !12, size: 64, offset: 6848)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "index_entry_end", scope: !9, file: !8, line: 146, baseType: !12, size: 64, offset: 6912)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "chars", scope: !9, file: !8, line: 147, baseType: !123, size: 960, offset: 6976)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_chars_24", file: !8, line: 37, size: 960, elements: !124)
!124 = !{!125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "bullet", scope: !123, file: !8, line: 38, baseType: !12, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !123, file: !8, line: 39, baseType: !12, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !123, file: !8, line: 40, baseType: !12, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "left_dbl_quote", scope: !123, file: !8, line: 41, baseType: !12, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "right_dbl_quote", scope: !123, file: !8, line: 42, baseType: !12, size: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nonbreaking_space", scope: !123, file: !8, line: 43, baseType: !12, size: 64, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "emdash", scope: !123, file: !8, line: 44, baseType: !12, size: 64, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "endash", scope: !123, file: !8, line: 45, baseType: !12, size: 64, offset: 448)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "lessthan", scope: !123, file: !8, line: 46, baseType: !12, size: 64, offset: 512)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "greaterthan", scope: !123, file: !8, line: 47, baseType: !12, size: 64, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "amp", scope: !123, file: !8, line: 48, baseType: !12, size: 64, offset: 640)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "copyright", scope: !123, file: !8, line: 49, baseType: !12, size: 64, offset: 704)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "trademark", scope: !123, file: !8, line: 50, baseType: !12, size: 64, offset: 768)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nonbreaking_hyphen", scope: !123, file: !8, line: 51, baseType: !12, size: 64, offset: 832)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "optional_hyphen", scope: !123, file: !8, line: 52, baseType: !12, size: 64, offset: 896)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ascii_translation_table", scope: !9, file: !8, line: 148, baseType: !141, size: 64, offset: 7936)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "simulate_small_caps", scope: !9, file: !8, line: 149, baseType: !143, size: 1, offset: 8000, flags: DIFlagBitField, extraData: i64 8000)
!143 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "simulate_all_caps", scope: !9, file: !8, line: 150, baseType: !143, size: 1, offset: 8001, flags: DIFlagBitField, extraData: i64 8000)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "simulate_word_underline", scope: !9, file: !8, line: 151, baseType: !143, size: 1, offset: 8002, flags: DIFlagBitField, extraData: i64 8000)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ansi_translation_table", scope: !9, file: !8, line: 152, baseType: !141, size: 64, offset: 8064)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ansi_first_char", scope: !9, file: !8, line: 153, baseType: !148, size: 16, offset: 8128)
!148 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ansi_last_char", scope: !9, file: !8, line: 154, baseType: !148, size: 16, offset: 8144)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cp437_translation_table", scope: !9, file: !8, line: 155, baseType: !141, size: 64, offset: 8192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "cp437_first_char", scope: !9, file: !8, line: 156, baseType: !148, size: 16, offset: 8256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "cp437_last_char", scope: !9, file: !8, line: 157, baseType: !148, size: 16, offset: 8272)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "cp850_translation_table", scope: !9, file: !8, line: 158, baseType: !141, size: 64, offset: 8320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "cp850_first_char", scope: !9, file: !8, line: 159, baseType: !148, size: 16, offset: 8384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "cp850_last_char", scope: !9, file: !8, line: 160, baseType: !148, size: 16, offset: 8400)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mac_translation_table", scope: !9, file: !8, line: 161, baseType: !141, size: 64, offset: 8448)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mac_first_char", scope: !9, file: !8, line: 162, baseType: !148, size: 16, offset: 8512)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "mac_last_char", scope: !9, file: !8, line: 163, baseType: !148, size: 16, offset: 8528)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "write_set_foreground", scope: !9, file: !8, line: 164, baseType: !160, size: 64, offset: 8576)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !143, !143, !143}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !165, line: 211, baseType: !166)
!165 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!166 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!167 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !170, line: 49, baseType: !171)
!170 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !172, line: 271, size: 1728, elements: !173)
!172 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !194, !195, !196, !197, !201, !203, !205, !209, !212, !216, !217, !218, !219, !220, !221, !222}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !171, file: !172, line: 272, baseType: !143, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !171, file: !172, line: 273, baseType: !12, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !171, file: !172, line: 274, baseType: !12, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !171, file: !172, line: 275, baseType: !12, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !171, file: !172, line: 276, baseType: !12, size: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !171, file: !172, line: 277, baseType: !12, size: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !171, file: !172, line: 278, baseType: !12, size: 64, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !171, file: !172, line: 279, baseType: !12, size: 64, offset: 448)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !171, file: !172, line: 280, baseType: !12, size: 64, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !171, file: !172, line: 281, baseType: !12, size: 64, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !171, file: !172, line: 282, baseType: !12, size: 64, offset: 640)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !171, file: !172, line: 283, baseType: !12, size: 64, offset: 704)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !171, file: !172, line: 284, baseType: !187, size: 64, offset: 768)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !172, line: 186, size: 192, elements: !189)
!189 = !{!190, !191, !193}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !188, file: !172, line: 187, baseType: !187, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !188, file: !172, line: 188, baseType: !192, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !188, file: !172, line: 189, baseType: !143, size: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !171, file: !172, line: 285, baseType: !192, size: 64, offset: 832)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !171, file: !172, line: 286, baseType: !143, size: 32, offset: 896)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !171, file: !172, line: 287, baseType: !143, size: 32, offset: 928)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !171, file: !172, line: 288, baseType: !198, size: 64, offset: 960)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !199, line: 141, baseType: !200)
!199 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!200 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !171, file: !172, line: 289, baseType: !202, size: 16, offset: 1024)
!202 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !171, file: !172, line: 290, baseType: !204, size: 8, offset: 1040)
!204 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !171, file: !172, line: 291, baseType: !206, size: 8, offset: 1048)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 1)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !171, file: !172, line: 292, baseType: !210, size: 64, offset: 1088)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !172, line: 180, baseType: null)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !171, file: !172, line: 293, baseType: !213, size: 64, offset: 1152)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !199, line: 142, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !199, line: 56, baseType: !215)
!215 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !171, file: !172, line: 294, baseType: !163, size: 64, offset: 1216)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !171, file: !172, line: 295, baseType: !163, size: 64, offset: 1280)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !171, file: !172, line: 296, baseType: !163, size: 64, offset: 1344)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !171, file: !172, line: 297, baseType: !163, size: 64, offset: 1408)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !171, file: !172, line: 298, baseType: !164, size: 32, offset: 1472)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !171, file: !172, line: 299, baseType: !143, size: 32, offset: 1504)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !171, file: !172, line: 300, baseType: !223, size: 192, offset: 1536)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 192, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 24)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "Word", file: !230, line: 39, baseType: !231)
!230 = !DIFile(filename: "/home/wslee/benchmarks/textformat/unrtf-0.19.3/word.h", directory: "")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_w", file: !230, line: 39, size: 192, elements: !232)
!232 = !{!233, !234, !236}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "hash_index", scope: !231, file: !230, line: 40, baseType: !167, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !231, file: !230, line: 41, baseType: !235, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !231, file: !230, line: 42, baseType: !235, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashItem", file: !239, line: 50, baseType: !240)
!239 = !DIFile(filename: "/home/wslee/benchmarks/textformat/unrtf-0.19.3/hash.c", directory: "")
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_hi", file: !239, line: 50, size: 192, elements: !241)
!241 = !{!242, !244, !245}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !240, file: !239, line: 51, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !240, file: !239, line: 52, baseType: !12, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !240, file: !239, line: 53, baseType: !167, size: 64, offset: 128)
!246 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "AttrStack", file: !249, line: 67, baseType: !250)
!249 = !DIFile(filename: "/home/wslee/benchmarks/textformat/unrtf-0.19.3/attr.c", directory: "")
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stack", file: !249, line: 67, size: 720128, elements: !251)
!251 = !{!252, !256, !258, !259}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "attr_stack", scope: !250, file: !249, line: 68, baseType: !253, size: 80000)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 80000, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 10000)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "attr_stack_params", scope: !250, file: !249, line: 69, baseType: !257, size: 640000, offset: 80000)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 640000, elements: !254)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !250, file: !249, line: 70, baseType: !143, size: 32, offset: 720000)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !250, file: !249, line: 71, baseType: !260, size: 64, offset: 720064)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!263 = !{!264, !267, !269, !271, !273, !275, !277, !279, !284, !287, !290, !292, !302, !0, !313, !319, !324, !327, !329, !331, !333, !335, !337, !339, !341, !343, !345, !348, !350, !352, !355, !357, !360, !362, !364, !366, !368, !371, !374, !376, !379, !384, !386, !388, !390, !393, !395, !397, !399, !404, !406, !408, !410, !415, !417, !419, !421, !423, !425, !427, !429, !431, !433, !435, !437, !439, !441, !446, !448, !450, !452, !454, !456, !471, !476, !481, !486, !488, !493, !498, !500, !505, !507, !509, !514, !516, !518, !523, !525, !528, !530, !532, !534, !536, !538}
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "lineno", scope: !2, file: !266, line: 71, type: !143, isLocal: false, isDefinition: true)
!266 = !DIFile(filename: "/home/wslee/benchmarks/textformat/unrtf-0.19.3/main.c", directory: "")
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "nopict_mode", scope: !2, file: !266, line: 68, type: !143, isLocal: false, isDefinition: true)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "dump_mode", scope: !2, file: !266, line: 69, type: !143, isLocal: false, isDefinition: true)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "debug_mode", scope: !2, file: !266, line: 70, type: !143, isLocal: false, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "simple_mode", scope: !2, file: !266, line: 72, type: !143, isLocal: false, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "inline_mode", scope: !2, file: !266, line: 73, type: !143, isLocal: false, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "op", scope: !2, file: !266, line: 76, type: !6, isLocal: false, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "hash", scope: !2, file: !239, line: 59, type: !281, isLocal: true, isDefinition: true)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 16384, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 256)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "hash_length", scope: !2, file: !239, line: 60, type: !286, isLocal: true, isDefinition: true)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 16384, elements: !282)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "simulate_allcaps", scope: !2, file: !289, line: 110, type: !143, isLocal: false, isDefinition: true)
!289 = !DIFile(filename: "/home/wslee/benchmarks/textformat/unrtf-0.19.3/convert.c", directory: "")
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "simulate_smallcaps", scope: !2, file: !289, line: 109, type: !143, isLocal: false, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "font_table", scope: !2, file: !289, line: 291, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 1048576, elements: !300)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontEntry", file: !289, line: 285, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_FontEntry_30", file: !289, line: 285, size: 128, elements: !297)
!297 = !{!298, !299}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !296, file: !289, line: 286, baseType: !143, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !296, file: !289, line: 287, baseType: !12, size: 64, offset: 64)
!300 = !{!301}
!301 = !DISubrange(count: 8192)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "color_table", scope: !2, file: !289, line: 590, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 24576, elements: !311)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "Color", file: !289, line: 585, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Color_31", file: !289, line: 585, size: 24, elements: !307)
!307 = !{!308, !309, !310}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !306, file: !289, line: 586, baseType: !246, size: 8)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !306, file: !289, line: 587, baseType: !246, size: 8, offset: 8)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !306, file: !289, line: 588, baseType: !246, size: 8, offset: 16)
!311 = !{!312}
!312 = !DISubrange(count: 1024)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "ascii_translation_table", scope: !2, file: !315, line: 44, type: !316, isLocal: true, isDefinition: true)
!315 = !DIFile(filename: "/home/wslee/benchmarks/textformat/unrtf-0.19.3/vt.c", directory: "")
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 6144, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 96)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "upper_translation_table", scope: !2, file: !315, line: 61, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8192, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 128)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "current_max_length", scope: !2, file: !326, line: 179, type: !167, isLocal: true, isDefinition: true)
!326 = !DIFile(filename: "/home/wslee/benchmarks/textformat/unrtf-0.19.3/parse.c", directory: "")
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "ungot_char", scope: !2, file: !326, line: 62, type: !143, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "ungot_char2", scope: !2, file: !326, line: 63, type: !143, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "ungot_char3", scope: !2, file: !326, line: 64, type: !143, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "last_returned_ch", scope: !2, file: !326, line: 87, type: !143, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "read_buf_index", scope: !2, file: !326, line: 94, type: !143, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "read_buf_end", scope: !2, file: !326, line: 93, type: !143, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "read_buf", scope: !2, file: !326, line: 92, type: !12, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "buffer_size", scope: !2, file: !326, line: 91, type: !143, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "input_str", scope: !2, file: !326, line: 178, type: !12, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "ascii_translation_table___0", scope: !2, file: !347, line: 44, type: !316, isLocal: true, isDefinition: true)
!347 = !DIFile(filename: "/home/wslee/benchmarks/textformat/unrtf-0.19.3/text.c", directory: "")
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "upper_translation_table___0", scope: !2, file: !347, line: 60, type: !321, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "hash_value", scope: !2, file: !239, line: 61, type: !167, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "ascii", scope: !2, file: !354, line: 51, type: !316, isLocal: true, isDefinition: true)
!354 = !DIFile(filename: "/home/wslee/benchmarks/textformat/unrtf-0.19.3/ps.c", directory: "")
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "ansi", scope: !2, file: !354, line: 68, type: !321, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "cp437", scope: !2, file: !354, line: 108, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, elements: !207)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "cp850", scope: !2, file: !354, line: 112, type: !359, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "mac", scope: !2, file: !354, line: 104, type: !359, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "stack_of_stacks_top", scope: !2, file: !249, line: 76, type: !247, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "stack_of_stacks", scope: !2, file: !249, line: 75, type: !247, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "count", scope: !2, file: !370, line: 55, type: !167, isLocal: true, isDefinition: true)
!370 = !DIFile(filename: "/home/wslee/benchmarks/textformat/unrtf-0.19.3/malloc.c", directory: "")
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "ascii_translation_table___1", scope: !2, file: !373, line: 45, type: !316, isLocal: true, isDefinition: true)
!373 = !DIFile(filename: "/home/wslee/benchmarks/textformat/unrtf-0.19.3/wpml.c", directory: "")
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "upper_translation_table___1", scope: !2, file: !373, line: 61, type: !321, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "ascii___0", scope: !2, file: !378, line: 48, type: !316, isLocal: true, isDefinition: true)
!378 = !DIFile(filename: "/home/wslee/benchmarks/textformat/unrtf-0.19.3/latex.c", directory: "")
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "ansi___0", scope: !2, file: !378, line: 64, type: !381, isLocal: true, isDefinition: true)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8064, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 126)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "cp437___0", scope: !2, file: !378, line: 98, type: !359, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "cp850___0", scope: !2, file: !378, line: 102, type: !359, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "mac___0", scope: !2, file: !378, line: 94, type: !359, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "ascii___1", scope: !2, file: !392, line: 49, type: !316, isLocal: true, isDefinition: true)
!392 = !DIFile(filename: "/home/wslee/benchmarks/textformat/unrtf-0.19.3/html.c", directory: "")
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "ansi___1", scope: !2, file: !392, line: 65, type: !381, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "cp437___1", scope: !2, file: !392, line: 105, type: !321, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "cp850___1", scope: !2, file: !392, line: 236, type: !321, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "mac___1", scope: !2, file: !392, line: 87, type: !401, isLocal: true, isDefinition: true)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 3200, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 50)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "banner_printed", scope: !2, file: !289, line: 148, type: !143, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "have_printed_body", scope: !2, file: !289, line: 135, type: !143, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "within_header", scope: !2, file: !289, line: 136, type: !143, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "month_strings", scope: !2, file: !289, line: 210, type: !412, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 768, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 12)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "total_fonts", scope: !2, file: !289, line: 292, type: !143, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "hyperlink_base", scope: !2, file: !289, line: 140, type: !12, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "total_colors", scope: !2, file: !289, line: 591, type: !143, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "charset_type", scope: !2, file: !289, line: 78, type: !143, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "within_table", scope: !2, file: !289, line: 84, type: !143, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "have_printed_cell_end", scope: !2, file: !289, line: 88, type: !143, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "have_printed_row_end", scope: !2, file: !289, line: 87, type: !143, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "have_printed_row_begin", scope: !2, file: !289, line: 85, type: !143, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "have_printed_cell_begin", scope: !2, file: !289, line: 86, type: !143, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "coming_pars_that_are_tabular", scope: !2, file: !289, line: 83, type: !143, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "within_picture", scope: !2, file: !289, line: 124, type: !143, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "picture_type", scope: !2, file: !289, line: 130, type: !143, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "picture_file_number", scope: !2, file: !289, line: 125, type: !143, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "picture_path", scope: !2, file: !289, line: 126, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 2040, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 255)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "picture_wmetafile_type_str", scope: !2, file: !289, line: 132, type: !12, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "picture_width", scope: !2, file: !289, line: 127, type: !143, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "picture_height", scope: !2, file: !289, line: 128, type: !143, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "picture_bits_per_pixel", scope: !2, file: !289, line: 129, type: !143, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "total_chars_this_line", scope: !2, file: !289, line: 93, type: !143, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "hash___0", scope: !2, file: !289, line: 2318, type: !458, isLocal: true, isDefinition: true)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 1664, elements: !469)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashItem___0", file: !289, line: 2067, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_HashItem_32", file: !289, line: 2067, size: 192, elements: !462)
!462 = !{!463, !464, !468}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !461, file: !289, line: 2068, baseType: !12, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !461, file: !289, line: 2069, baseType: !465, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!143, !228, !143, !13, !148}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "debug_print", scope: !461, file: !289, line: 2070, baseType: !12, size: 64, offset: 128)
!469 = !{!470}
!470 = !DISubrange(count: 26)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "hashArray_a", scope: !2, file: !289, line: 2083, type: !473, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 384, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 2)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "hashArray_b", scope: !2, file: !289, line: 2087, type: !478, isLocal: true, isDefinition: true)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 768, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 4)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "hashArray_c", scope: !2, file: !289, line: 2115, type: !483, isLocal: true, isDefinition: true)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 1344, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 7)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "hashArray_d", scope: !2, file: !289, line: 2151, type: !473, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "hashArray_e", scope: !2, file: !289, line: 2158, type: !490, isLocal: true, isDefinition: true)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 1152, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 6)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "hashArray_f", scope: !2, file: !289, line: 2166, type: !495, isLocal: true, isDefinition: true)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 3072, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 16)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "hashArray_h", scope: !2, file: !289, line: 2184, type: !483, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "hashArray_i", scope: !2, file: !289, line: 2193, type: !502, isLocal: true, isDefinition: true)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 960, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 5)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "hashArray_j", scope: !2, file: !289, line: 2200, type: !473, isLocal: true, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "hashArray_l", scope: !2, file: !289, line: 2204, type: !478, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "hashArray_m", scope: !2, file: !289, line: 2210, type: !511, isLocal: true, isDefinition: true)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 576, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 3)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "hashArray_n", scope: !2, file: !289, line: 2215, type: !473, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "hashArray_o", scope: !2, file: !289, line: 2219, type: !473, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "hashArray_p", scope: !2, file: !289, line: 2223, type: !520, isLocal: true, isDefinition: true)
