; ModuleID = '/tmp/tmp.ll'
source_filename = "c/vtprint-2.0.2.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.termios = type { i32, i32, i32, i32, i8, [32 x i8], i32, i32 }
%struct.alist = type { i32, i32, i8** }

@.str = private unnamed_addr constant [3 x i8] c"\09 \00", align 1
@.str.1 = private unnamed_addr constant [5 x i8] c"\1B[5i\00", align 1
@ptr_on = global i8* getelementptr inbounds ([5 x i8], [5 x i8]* @.str.1, i32 0, i32 0), align 8, !dbg !0
@.str.2 = private unnamed_addr constant [5 x i8] c"\1B[4i\00", align 1
@ptr_off = global i8* getelementptr inbounds ([5 x i8], [5 x i8]* @.str.2, i32 0, i32 0), align 8, !dbg !98
@.str.3 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@termname = global i8* getelementptr inbounds ([1 x i8], [1 x i8]* @.str.3, i32 0, i32 0), align 8, !dbg !101
@.str.4 = private unnamed_addr constant [16 x i8] c"/etc/vtprintcap\00", align 1
@libtermname = global i8* getelementptr inbounds ([16 x i8], [16 x i8]* @.str.4, i32 0, i32 0), align 8, !dbg !103
@.str.5 = private unnamed_addr constant [9 x i8] c"/dev/tty\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ptr_on", scope: !2, file: !100, line: 87, type: !31, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !97, nameTableKind: GNU)
!3 = !DIFile(filename: "c/vtprint-2.0.2.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !27, !28, !30, !33, !31, !34, !36, !32, !37, !95}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "termios", file: !9, line: 30, size: 480, elements: !10)
!9 = !DIFile(filename: "/usr/include/bits/termios.h", directory: "")
!10 = !{!11, !14, !15, !16, !17, !20, !24, !26}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "c_iflag", scope: !8, file: !9, line: 31, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcflag_t", file: !9, line: 27, baseType: !13)
!13 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "c_oflag", scope: !8, file: !9, line: 32, baseType: !12, size: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "c_cflag", scope: !8, file: !9, line: 33, baseType: !12, size: 32, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "c_lflag", scope: !8, file: !9, line: 34, baseType: !12, size: 32, offset: 96)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "c_line", scope: !8, file: !9, line: 35, baseType: !18, size: 8, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "cc_t", file: !9, line: 25, baseType: !19)
!19 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "c_cc", scope: !8, file: !9, line: 36, baseType: !21, size: 256, offset: 136)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 256, elements: !22)
!22 = !{!23}
!23 = !DISubrange(count: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "c_ispeed", scope: !8, file: !9, line: 37, baseType: !25, size: 32, offset: 416)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "speed_t", file: !9, line: 26, baseType: !13)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "c_ospeed", scope: !8, file: !9, line: 38, baseType: !25, size: 32, offset: 448)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !29, line: 211, baseType: !13)
!29 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!33 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !39, line: 49, baseType: !40)
!39 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !41, line: 271, size: 1728, elements: !42)
!41 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !63, !64, !65, !66, !70, !72, !74, !78, !81, !85, !86, !87, !88, !89, !90, !91}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !40, file: !41, line: 272, baseType: !36, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !40, file: !41, line: 273, baseType: !31, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !40, file: !41, line: 274, baseType: !31, size: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !40, file: !41, line: 275, baseType: !31, size: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !40, file: !41, line: 276, baseType: !31, size: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !40, file: !41, line: 277, baseType: !31, size: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !40, file: !41, line: 278, baseType: !31, size: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !40, file: !41, line: 279, baseType: !31, size: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !40, file: !41, line: 280, baseType: !31, size: 64, offset: 512)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !40, file: !41, line: 281, baseType: !31, size: 64, offset: 576)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !40, file: !41, line: 282, baseType: !31, size: 64, offset: 640)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !40, file: !41, line: 283, baseType: !31, size: 64, offset: 704)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !40, file: !41, line: 284, baseType: !56, size: 64, offset: 768)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !41, line: 186, size: 192, elements: !58)
!58 = !{!59, !60, !62}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !57, file: !41, line: 187, baseType: !56, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !57, file: !41, line: 188, baseType: !61, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !57, file: !41, line: 189, baseType: !36, size: 32, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !40, file: !41, line: 285, baseType: !61, size: 64, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !40, file: !41, line: 286, baseType: !36, size: 32, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !40, file: !41, line: 287, baseType: !36, size: 32, offset: 928)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !40, file: !41, line: 288, baseType: !67, size: 64, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !68, line: 141, baseType: !69)
!68 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!69 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !40, file: !41, line: 289, baseType: !71, size: 16, offset: 1024)
!71 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !40, file: !41, line: 290, baseType: !73, size: 8, offset: 1040)
!73 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !40, file: !41, line: 291, baseType: !75, size: 8, offset: 1048)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !40, file: !41, line: 292, baseType: !79, size: 64, offset: 1088)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !41, line: 180, baseType: null)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !40, file: !41, line: 293, baseType: !82, size: 64, offset: 1152)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !68, line: 142, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !68, line: 56, baseType: !84)
!84 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !40, file: !41, line: 294, baseType: !27, size: 64, offset: 1216)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !40, file: !41, line: 295, baseType: !27, size: 64, offset: 1280)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !40, file: !41, line: 296, baseType: !27, size: 64, offset: 1344)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !40, file: !41, line: 297, baseType: !27, size: 64, offset: 1408)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !40, file: !41, line: 298, baseType: !28, size: 32, offset: 1472)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !40, file: !41, line: 299, baseType: !36, size: 32, offset: 1504)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !40, file: !41, line: 300, baseType: !92, size: 192, offset: 1536)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 192, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 24)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!97 = !{!0, !98, !101, !103, !105, !107, !109, !111, !113, !115, !117, !119, !121, !123, !125, !127, !129, !133, !135, !137, !142}
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "ptr_off", scope: !2, file: !100, line: 88, type: !31, isLocal: false, isDefinition: true)
!100 = !DIFile(filename: "/home/wslee/benchmarks/textformat/vtprint-2.0.2/vtprint.c", directory: "")
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "termname", scope: !2, file: !100, line: 91, type: !31, isLocal: false, isDefinition: true)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "libtermname", scope: !2, file: !100, line: 92, type: !31, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "devname", scope: !2, file: !100, line: 93, type: !31, isLocal: false, isDefinition: true)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "vtbasename", scope: !2, file: !100, line: 94, type: !31, isLocal: false, isDefinition: true)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "quiet", scope: !2, file: !100, line: 97, type: !36, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "binary", scope: !2, file: !100, line: 98, type: !36, isLocal: false, isDefinition: true)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "ffeed", scope: !2, file: !100, line: 99, type: !36, isLocal: false, isDefinition: true)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "device", scope: !2, file: !100, line: 100, type: !36, isLocal: false, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "stripcr", scope: !2, file: !100, line: 101, type: !36, isLocal: false, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "addcr", scope: !2, file: !100, line: 102, type: !36, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "builtin", scope: !2, file: !100, line: 103, type: !36, isLocal: false, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "forcenv", scope: !2, file: !100, line: 104, type: !36, isLocal: false, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "dowork", scope: !2, file: !100, line: 105, type: !36, isLocal: false, isDefinition: true)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "state_saved", scope: !2, file: !100, line: 108, type: !36, isLocal: false, isDefinition: true)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "oldstate", scope: !2, file: !100, line: 109, type: !131, isLocal: false, isDefinition: true)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "termstate", file: !132, line: 57, baseType: !8)
!132 = !DIFile(filename: "/home/wslee/benchmarks/textformat/vtprint-2.0.2/termstate.h", directory: "")
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "newstate", scope: !2, file: !100, line: 110, type: !131, isLocal: false, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "outfile", scope: !2, file: !100, line: 113, type: !37, isLocal: false, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "on", scope: !2, file: !100, line: 337, type: !139, isLocal: true, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8200, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 1025)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "off", scope: !2, file: !100, line: 338, type: !139, isLocal: true, isDefinition: true)
!144 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!145 = !{i32 2, !"Dwarf Version", i32 4}
!146 = !{i32 2, !"Debug Info Version", i32 3}
!147 = !{i32 1, !"wchar_size", i32 4}
!148 = !{i32 7, !"PIC Level", i32 2}
!149 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!150 = distinct !DISubprogram(name: "save_termstate", scope: !151, file: !151, line: 73, type: !152, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!151 = !DIFile(filename: "/home/wslee/benchmarks/textformat/vtprint-2.0.2/termstate.c", directory: "")
!152 = !DISubroutineType(types: !153)
!153 = !{!36, !36, !154}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!155 = !DILocalVariable(name: "fd", arg: 1, scope: !150, file: !151, line: 73, type: !36)
!156 = !DILocation(line: 0, scope: !150)
!157 = !DILocalVariable(name: "state", arg: 2, scope: !150, file: !151, line: 73, type: !154)
!158 = !DILocation(line: 75, column: 9, scope: !159)
!159 = distinct !DILexicalBlock(scope: !160, file: !151, line: 80, column: 3)
!160 = distinct !DILexicalBlock(scope: !161, file: !151, line: 79, column: 3)
!161 = distinct !DILexicalBlock(scope: !150, file: !151, line: 78, column: 3)
!162 = !DILocalVariable(name: "tmp", scope: !150, file: !151, line: 75, type: !36)
!163 = !DILocation(line: 75, column: 9, scope: !164)
!164 = distinct !DILexicalBlock(scope: !161, file: !151, line: 75, column: 7)
!165 = !DILocation(line: 75, column: 7, scope: !161)
!166 = !DILocation(line: 75, column: 5, scope: !167)
!167 = distinct !DILexicalBlock(scope: !164, file: !151, line: 75, column: 14)
!168 = !DILocation(line: 82, column: 13, scope: !169)
!169 = distinct !DILexicalBlock(scope: !170, file: !151, line: 78, column: 3)
!170 = distinct !DILexicalBlock(scope: !161, file: !151, line: 77, column: 3)
!171 = !DILocalVariable(name: "tmp___0", scope: !150, file: !151, line: 76, type: !36)
!172 = !DILocation(line: 82, column: 3, scope: !161)
!173 = !DILocation(line: 0, scope: !161)
!174 = !DILocation(line: 84, column: 1, scope: !150)
!175 = distinct !DISubprogram(name: "restore_termstate", scope: !151, file: !151, line: 102, type: !152, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!176 = !DILocalVariable(name: "fd", arg: 1, scope: !175, file: !151, line: 102, type: !36)
!177 = !DILocation(line: 0, scope: !175)
!178 = !DILocalVariable(name: "state", arg: 2, scope: !175, file: !151, line: 102, type: !154)
!179 = !DILocation(line: 104, column: 9, scope: !180)
!180 = distinct !DILexicalBlock(scope: !181, file: !151, line: 109, column: 3)
!181 = distinct !DILexicalBlock(scope: !182, file: !151, line: 108, column: 3)
!182 = distinct !DILexicalBlock(scope: !175, file: !151, line: 107, column: 3)
!183 = !DILocalVariable(name: "tmp", scope: !175, file: !151, line: 104, type: !36)
!184 = !DILocation(line: 104, column: 9, scope: !185)
!185 = distinct !DILexicalBlock(scope: !182, file: !151, line: 104, column: 7)
!186 = !DILocation(line: 104, column: 7, scope: !182)
!187 = !DILocation(line: 104, column: 5, scope: !188)
!188 = distinct !DILexicalBlock(scope: !185, file: !151, line: 104, column: 14)
!189 = !DILocation(line: 111, column: 13, scope: !190)
!190 = distinct !DILexicalBlock(scope: !191, file: !151, line: 107, column: 3)
!191 = distinct !DILexicalBlock(scope: !182, file: !151, line: 106, column: 3)
!192 = !DILocalVariable(name: "tmp___0", scope: !175, file: !151, line: 105, type: !36)
!193 = !DILocation(line: 111, column: 3, scope: !182)
!194 = !DILocation(line: 0, scope: !182)
!195 = !DILocation(line: 113, column: 1, scope: !175)
!196 = distinct !DISubprogram(name: "raw_termstate", scope: !151, file: !151, line: 129, type: !197, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !154}
!199 = !DILocalVariable(name: "state", arg: 1, scope: !196, file: !151, line: 129, type: !154)
!200 = !DILocation(line: 0, scope: !196)
!201 = !DILocation(line: 135, column: 10, scope: !202)
!202 = distinct !DILexicalBlock(scope: !196, file: !151, line: 133, column: 3)
!203 = !DILocation(line: 135, column: 18, scope: !202)
!204 = !DILocation(line: 138, column: 3, scope: !202)
!205 = distinct !DISubprogram(name: "string2arglist", scope: !206, file: !206, line: 67, type: !207, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!206 = !DIFile(filename: "/home/wslee/benchmarks/textformat/vtprint-2.0.2/arglist.c", directory: "")
!207 = !DISubroutineType(types: !208)
!208 = !{!36, !31, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "arglist", file: !211, line: 52, baseType: !212)
!211 = !DIFile(filename: "/home/wslee/benchmarks/textformat/vtprint-2.0.2/arglist.h", directory: "")
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alist", file: !211, line: 52, size: 128, elements: !213)
!213 = !{!214, !215, !216}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !212, file: !211, line: 53, baseType: !36, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !212, file: !211, line: 54, baseType: !36, size: 32, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !212, file: !211, line: 55, baseType: !30, size: 64, offset: 64)
!217 = !DILocalVariable(name: "string", arg: 1, scope: !205, file: !206, line: 67, type: !31)
!218 = !DILocation(line: 0, scope: !205)
!219 = !DILocalVariable(name: "args", arg: 2, scope: !205, file: !206, line: 67, type: !209)
!220 = !DILocalVariable(name: "__cil_tmp7", scope: !205, file: !206, line: 73, type: !31)
!221 = !DILocation(line: 73, column: 9, scope: !205)
!222 = !DILocation(line: 72, column: 13, scope: !223)
!223 = distinct !DILexicalBlock(scope: !224, file: !206, line: 72, column: 7)
!224 = distinct !DILexicalBlock(scope: !205, file: !206, line: 75, column: 3)
!225 = !DILocation(line: 72, column: 7, scope: !223)
!226 = !DILocation(line: 72, column: 7, scope: !224)
!227 = !DILocation(line: 72, column: 24, scope: !228)
!228 = distinct !DILexicalBlock(scope: !229, file: !206, line: 74, column: 5)
!229 = distinct !DILexicalBlock(scope: !230, file: !206, line: 73, column: 5)
!230 = distinct !DILexicalBlock(scope: !223, file: !206, line: 72, column: 19)
!231 = !DILocation(line: 72, column: 10, scope: !228)
!232 = !DILocation(line: 72, column: 5, scope: !228)
!233 = !DILocation(line: 75, column: 3, scope: !230)
!234 = !DILocation(line: 73, column: 9, scope: !224)
!235 = !DILocation(line: 73, column: 14, scope: !224)
!236 = !DILocation(line: 74, column: 9, scope: !224)
!237 = !DILocation(line: 74, column: 15, scope: !224)
!238 = !DILocalVariable(name: "st", scope: !205, file: !206, line: 69, type: !31)
!239 = !DILocation(line: 78, column: 3, scope: !240)
!240 = distinct !DILexicalBlock(scope: !241, file: !206, line: 78, column: 3)
!241 = distinct !DILexicalBlock(scope: !224, file: !206, line: 77, column: 3)
!242 = !DILocation(line: 0, scope: !224)
!243 = !DILocation(line: 78, column: 13, scope: !240)
!244 = !DILocation(line: 81, column: 15, scope: !245)
!245 = distinct !DILexicalBlock(scope: !246, file: !206, line: 81, column: 9)
!246 = distinct !DILexicalBlock(scope: !240, file: !206, line: 78, column: 13)
!247 = !DILocation(line: 81, column: 29, scope: !245)
!248 = !DILocation(line: 81, column: 20, scope: !245)
!249 = !DILocation(line: 81, column: 9, scope: !246)
!250 = !DILocation(line: 83, column: 19, scope: !251)
!251 = distinct !DILexicalBlock(scope: !252, file: !206, line: 83, column: 11)
!252 = distinct !DILexicalBlock(scope: !245, file: !206, line: 81, column: 36)
!253 = !DILocation(line: 83, column: 13, scope: !251)
!254 = !DILocation(line: 83, column: 11, scope: !252)
!255 = !DILocation(line: 84, column: 15, scope: !256)
!256 = distinct !DILexicalBlock(scope: !257, file: !206, line: 85, column: 9)
!257 = distinct !DILexicalBlock(scope: !258, file: !206, line: 84, column: 9)
!258 = distinct !DILexicalBlock(scope: !251, file: !206, line: 83, column: 25)
!259 = !DILocalVariable(name: "tmp", scope: !205, file: !206, line: 70, type: !27)
!260 = !DILocation(line: 84, column: 22, scope: !257)
!261 = !DILocation(line: 84, column: 15, scope: !257)
!262 = !DILocation(line: 84, column: 20, scope: !257)
!263 = !DILocation(line: 86, column: 7, scope: !258)
!264 = !DILocation(line: 86, column: 41, scope: !265)
!265 = distinct !DILexicalBlock(scope: !266, file: !206, line: 88, column: 9)
!266 = distinct !DILexicalBlock(scope: !267, file: !206, line: 87, column: 9)
!267 = distinct !DILexicalBlock(scope: !251, file: !206, line: 86, column: 14)
!268 = !DILocation(line: 86, column: 27, scope: !265)
!269 = !DILocation(line: 86, column: 80, scope: !265)
!270 = !DILocation(line: 86, column: 86, scope: !265)
!271 = !DILocation(line: 86, column: 57, scope: !265)
!272 = !DILocation(line: 86, column: 92, scope: !265)
!273 = !DILocation(line: 86, column: 47, scope: !265)
!274 = !DILocation(line: 86, column: 19, scope: !265)
!275 = !DILocalVariable(name: "tmp___0", scope: !205, file: !206, line: 71, type: !27)
!276 = !DILocation(line: 86, column: 22, scope: !266)
!277 = !DILocation(line: 86, column: 15, scope: !266)
