; ModuleID = '/tmp/tmp.ll'
source_filename = "c/wysihtml-0.13.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%union.__anonunion_pthread_mutex_t_10 = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, %union.__anonunion____missing_field_name_11 }
%union.__anonunion____missing_field_name_11 = type { %struct.__pthread_internal_slist }
%struct.__pthread_internal_slist = type { %struct.__pthread_internal_slist* }
%union.__anonunion_pthread_attr_t_9 = type { i64, [32 x i8] }

@plock = global { { i32, i32, i32, i32, i32, [4 x i8], { i32, [4 x i8] } } } { { i32, i32, i32, i32, i32, [4 x i8], { i32, [4 x i8] } } { i32 0, i32 0, i32 0, i32 0, i32 0, [4 x i8] undef, { i32, [4 x i8] } { i32 0, [4 x i8] undef } } }, align 8, !dbg !0
@mozillacmdline = global i8* null, align 8, !dbg !100
@currentfile = global i8* null, align 8, !dbg !103
@wait_sleeptime = global i32 3, align 4, !dbg !105
@last_input = common global i64 0, align 8, !dbg !114
@.str = private unnamed_addr constant [5 x i8] c"m:s:\00", align 1
@optarg = external global i8*, align 8
@stderr = external global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "plock", scope: !2, file: !102, line: 30, type: !116, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !99, nameTableKind: GNU)
!3 = !DIFile(filename: "c/wysihtml-0.13.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !12, !13, !14, !16, !17, !19, !21, !81, !85, !95, !98}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !8, line: 76, baseType: !9)
!8 = !DIFile(filename: "/usr/include/time.h", directory: "")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !10, line: 149, baseType: !11)
!10 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!11 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !23, line: 49, baseType: !24)
!23 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !25, line: 271, size: 1728, elements: !26)
!25 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!26 = !{!27, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !48, !49, !50, !51, !53, !55, !57, !61, !64, !68, !69, !70, !71, !72, !76, !77}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !24, file: !25, line: 272, baseType: !28, size: 32)
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !24, file: !25, line: 273, baseType: !14, size: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !24, file: !25, line: 274, baseType: !14, size: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !24, file: !25, line: 275, baseType: !14, size: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !24, file: !25, line: 276, baseType: !14, size: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !24, file: !25, line: 277, baseType: !14, size: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !24, file: !25, line: 278, baseType: !14, size: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !24, file: !25, line: 279, baseType: !14, size: 64, offset: 448)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !24, file: !25, line: 280, baseType: !14, size: 64, offset: 512)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !24, file: !25, line: 281, baseType: !14, size: 64, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !24, file: !25, line: 282, baseType: !14, size: 64, offset: 640)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !24, file: !25, line: 283, baseType: !14, size: 64, offset: 704)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !24, file: !25, line: 284, baseType: !41, size: 64, offset: 768)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !25, line: 186, size: 192, elements: !43)
!43 = !{!44, !45, !47}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !42, file: !25, line: 187, baseType: !41, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !42, file: !25, line: 188, baseType: !46, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !42, file: !25, line: 189, baseType: !28, size: 32, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !24, file: !25, line: 285, baseType: !46, size: 64, offset: 832)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !24, file: !25, line: 286, baseType: !28, size: 32, offset: 896)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !24, file: !25, line: 287, baseType: !28, size: 32, offset: 928)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !24, file: !25, line: 288, baseType: !52, size: 64, offset: 960)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !10, line: 141, baseType: !11)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !24, file: !25, line: 289, baseType: !54, size: 16, offset: 1024)
!54 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !24, file: !25, line: 290, baseType: !56, size: 8, offset: 1040)
!56 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !24, file: !25, line: 291, baseType: !58, size: 8, offset: 1048)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 1)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !24, file: !25, line: 292, baseType: !62, size: 64, offset: 1088)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !25, line: 180, baseType: null)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !24, file: !25, line: 293, baseType: !65, size: 64, offset: 1152)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !10, line: 142, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !10, line: 56, baseType: !67)
!67 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !24, file: !25, line: 294, baseType: !12, size: 64, offset: 1216)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !24, file: !25, line: 295, baseType: !12, size: 64, offset: 1280)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !24, file: !25, line: 296, baseType: !12, size: 64, offset: 1344)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !24, file: !25, line: 297, baseType: !12, size: 64, offset: 1408)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !24, file: !25, line: 298, baseType: !73, size: 32, offset: 1472)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !74, line: 211, baseType: !75)
!74 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!75 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !24, file: !25, line: 299, baseType: !28, size: 32, offset: 1504)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !24, file: !25, line: 300, baseType: !78, size: 192, offset: 1536)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 192, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 24)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !83, line: 50, baseType: !84)
!83 = !DIFile(filename: "/usr/include/bits/pthreadtypes.h", directory: "")
!84 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_attr_t", file: !83, line: 53, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_pthread_attr_t_9", file: !83, line: 53, size: 320, elements: !89)
!89 = !{!90, !94}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !88, file: !83, line: 54, baseType: !91, size: 288)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 288, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 36)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !88, file: !83, line: 55, baseType: !11, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!12, !12}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!99 = !{!0, !100, !103, !105, !107, !110, !112, !114}
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "mozillacmdline", scope: !2, file: !102, line: 31, type: !17, isLocal: false, isDefinition: true)
!102 = !DIFile(filename: "/home/wslee/benchmarks/textformat/wysihtml-0.13/src/wysihtmldaemon.c", directory: "")
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "currentfile", scope: !2, file: !102, line: 32, type: !14, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "wait_sleeptime", scope: !2, file: !102, line: 34, type: !28, isLocal: false, isDefinition: true)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "temporary_filename", scope: !2, file: !109, line: 41, type: !14, isLocal: false, isDefinition: true)
!109 = !DIFile(filename: "/home/wslee/benchmarks/textformat/wysihtml-0.13/src/wysidocbookdaemon.c", directory: "")
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "xsltstylesheet", scope: !2, file: !109, line: 44, type: !14, isLocal: false, isDefinition: true)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "optional", scope: !2, file: !109, line: 47, type: !14, isLocal: false, isDefinition: true)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "last_input", scope: !2, file: !102, line: 33, type: !7, isLocal: false, isDefinition: true)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !83, line: 76, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_pthread_mutex_t_10", file: !83, line: 76, size: 256, elements: !118)
!118 = !{!119, !137, !138}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !117, file: !83, line: 77, baseType: !120, size: 256)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !83, line: 76, size: 256, elements: !121)
!121 = !{!122, !123, !124, !125, !126, !127}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !120, file: !83, line: 77, baseType: !28, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !120, file: !83, line: 78, baseType: !75, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !120, file: !83, line: 79, baseType: !28, size: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !120, file: !83, line: 80, baseType: !28, size: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !120, file: !83, line: 81, baseType: !75, size: 32, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField1", scope: !120, file: !83, line: 82, baseType: !128, size: 64, offset: 192)
!128 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_11", file: !83, line: 76, size: 64, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !128, file: !83, line: 77, baseType: !28, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !128, file: !83, line: 78, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_slist_t", file: !83, line: 67, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_slist", file: !83, line: 67, size: 64, elements: !134)
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !133, file: !83, line: 68, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !117, file: !83, line: 78, baseType: !78, size: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !117, file: !83, line: 79, baseType: !11, size: 64)
!139 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 15]}
!140 = !{i32 2, !"Dwarf Version", i32 4}
!141 = !{i32 2, !"Debug Info Version", i32 3}
!142 = !{i32 1, !"wchar_size", i32 4}
!143 = !{i32 7, !"PIC Level", i32 2}
!144 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.17)"}
!145 = distinct !DISubprogram(name: "loopexec", scope: !102, file: !102, line: 39, type: !146, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!146 = !DISubroutineType(types: !147)
!147 = !{!28}
!148 = !DILocalVariable(name: "buf", scope: !145, file: !102, line: 49, type: !14)
!149 = !DILocation(line: 49, column: 9, scope: !145)
!150 = !DILocation(line: 41, column: 9, scope: !151)
!151 = distinct !DILexicalBlock(scope: !152, file: !102, line: 53, column: 3)
!152 = distinct !DILexicalBlock(scope: !153, file: !102, line: 52, column: 3)
!153 = distinct !DILexicalBlock(scope: !145, file: !102, line: 51, column: 3)
!154 = !DILocalVariable(name: "tmp", scope: !145, file: !102, line: 42, type: !7)
!155 = !DILocation(line: 0, scope: !145)
!156 = !DILocalVariable(name: "last_display", scope: !145, file: !102, line: 41, type: !7)
!157 = !DILocation(line: 46, column: 3, scope: !158)
!158 = distinct !DILexicalBlock(scope: !159, file: !102, line: 44, column: 3)
!159 = distinct !DILexicalBlock(scope: !153, file: !102, line: 43, column: 3)
!160 = !DILocation(line: 0, scope: !153)
!161 = !DILocation(line: 46, column: 13, scope: !158)
!162 = !DILocation(line: 48, column: 5, scope: !163)
!163 = distinct !DILexicalBlock(scope: !164, file: !102, line: 50, column: 5)
!164 = distinct !DILexicalBlock(scope: !165, file: !102, line: 49, column: 5)
!165 = distinct !DILexicalBlock(scope: !158, file: !102, line: 46, column: 13)
!166 = !DILocation(line: 49, column: 5, scope: !167)
!167 = distinct !DILexicalBlock(scope: !164, file: !102, line: 50, column: 5)
!168 = !DILocation(line: 51, column: 20, scope: !169)
!169 = distinct !DILexicalBlock(scope: !164, file: !102, line: 51, column: 5)
!170 = !DILocalVariable(name: "current_time", scope: !145, file: !102, line: 43, type: !7)
!171 = !DILocalVariable(name: "doit", scope: !145, file: !102, line: 44, type: !28)
!172 = !DILocation(line: 55, column: 24, scope: !173)
!173 = distinct !DILexicalBlock(scope: !164, file: !102, line: 53, column: 5)
!174 = !DILocation(line: 55, column: 15, scope: !173)
!175 = !DILocalVariable(name: "tmp___3", scope: !145, file: !102, line: 48, type: !13)
!176 = !DILocation(line: 55, column: 17, scope: !177)
!177 = distinct !DILexicalBlock(scope: !165, file: !102, line: 55, column: 9)
!178 = !DILocation(line: 55, column: 9, scope: !165)
!179 = !DILocation(line: 57, column: 40, scope: !180)
!180 = distinct !DILexicalBlock(scope: !181, file: !102, line: 57, column: 7)
