; ModuleID = '/tmp/tmp.ll'
source_filename = "c/xmlto-0.0.23.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [24 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.yy_buffer_state = type { %struct._IO_FILE*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32 }
%struct.yy_trans_info = type { i16, i16 }
%struct.stack_t = type { i32, i32, %struct.stack_t* }

@yyin = global %struct._IO_FILE* null, align 8, !dbg !0
@yyout = global %struct._IO_FILE* null, align 8, !dbg !110
@yy_init = internal global i32 1, align 4, !dbg !133
@yy_start = internal global i32 0, align 4, !dbg !135
@stdin = external global %struct._IO_FILE*, align 8
@stdout = external global %struct._IO_FILE*, align 8
@yy_current_buffer = internal global %struct.yy_buffer_state* null, align 8, !dbg !137
@yy_c_buf_p = internal global i8* null, align 8, !dbg !139
@yy_hold_char = internal global i8 0, align 1, !dbg !114

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "yyin", scope: !2, file: !10, line: 274, type: !16, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.17)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !109, nameTableKind: GNU)
!3 = !DIFile(filename: "c/xmlto-0.0.23.c", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!4 = !{}
!5 = !{!6, !8, !9, !12, !11, !13, !7, !14, !16, !76, !69, !78, !79, !80, !94, !101}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "YY_CHAR", file: !10, line: 273, baseType: !11)
!10 = !DIFile(filename: "/home/wslee/benchmarks/textformat/xmlto-0.0.23/xmlif/xmlif.c", directory: "")
!11 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!12 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !18, line: 49, baseType: !19)
!18 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !20, line: 271, size: 1728, elements: !21)
!20 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!21 = !{!22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !42, !43, !44, !45, !49, !51, !53, !57, !60, !64, !65, !66, !67, !68, !71, !72}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !19, file: !20, line: 272, baseType: !13, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !19, file: !20, line: 273, baseType: !6, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !19, file: !20, line: 274, baseType: !6, size: 64, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !19, file: !20, line: 275, baseType: !6, size: 64, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !19, file: !20, line: 276, baseType: !6, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !19, file: !20, line: 277, baseType: !6, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !19, file: !20, line: 278, baseType: !6, size: 64, offset: 384)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !19, file: !20, line: 279, baseType: !6, size: 64, offset: 448)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !19, file: !20, line: 280, baseType: !6, size: 64, offset: 512)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !19, file: !20, line: 281, baseType: !6, size: 64, offset: 576)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !19, file: !20, line: 282, baseType: !6, size: 64, offset: 640)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !19, file: !20, line: 283, baseType: !6, size: 64, offset: 704)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !19, file: !20, line: 284, baseType: !35, size: 64, offset: 768)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !20, line: 186, size: 192, elements: !37)
!37 = !{!38, !39, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !36, file: !20, line: 187, baseType: !35, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !36, file: !20, line: 188, baseType: !40, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !36, file: !20, line: 189, baseType: !13, size: 32, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !19, file: !20, line: 285, baseType: !40, size: 64, offset: 832)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !19, file: !20, line: 286, baseType: !13, size: 32, offset: 896)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !19, file: !20, line: 287, baseType: !13, size: 32, offset: 928)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !19, file: !20, line: 288, baseType: !46, size: 64, offset: 960)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !47, line: 141, baseType: !48)
!47 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!48 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !19, file: !20, line: 289, baseType: !50, size: 16, offset: 1024)
!50 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !19, file: !20, line: 290, baseType: !52, size: 8, offset: 1040)
!52 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !19, file: !20, line: 291, baseType: !54, size: 8, offset: 1048)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 1)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !19, file: !20, line: 292, baseType: !58, size: 64, offset: 1088)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !20, line: 180, baseType: null)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !19, file: !20, line: 293, baseType: !61, size: 64, offset: 1152)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !47, line: 142, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !47, line: 56, baseType: !63)
!63 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !19, file: !20, line: 294, baseType: !8, size: 64, offset: 1216)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !19, file: !20, line: 295, baseType: !8, size: 64, offset: 1280)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !19, file: !20, line: 296, baseType: !8, size: 64, offset: 1344)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !19, file: !20, line: 297, baseType: !8, size: 64, offset: 1408)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !19, file: !20, line: 298, baseType: !69, size: 32, offset: 1472)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 211, baseType: !12)
!70 = !DIFile(filename: "/usr/lib/gcc/i486-linux-gnu/4.4.3/include/stddef.h", directory: "")
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !19, file: !20, line: 299, baseType: !13, size: 32, offset: 1504)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !19, file: !20, line: 300, baseType: !73, size: 192, offset: 1536)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 24)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!78 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "yy_size_t", file: !10, line: 150, baseType: !12)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "YY_BUFFER_STATE", file: !10, line: 99, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yy_buffer_state", file: !10, line: 153, size: 448, elements: !83)
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92, !93}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "yy_input_file", scope: !82, file: !10, line: 154, baseType: !16, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "yy_ch_buf", scope: !82, file: !10, line: 155, baseType: !6, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "yy_buf_pos", scope: !82, file: !10, line: 156, baseType: !6, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "yy_buf_size", scope: !82, file: !10, line: 157, baseType: !79, size: 32, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "yy_n_chars", scope: !82, file: !10, line: 158, baseType: !13, size: 32, offset: 224)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "yy_is_our_buffer", scope: !82, file: !10, line: 159, baseType: !13, size: 32, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "yy_is_interactive", scope: !82, file: !10, line: 160, baseType: !13, size: 32, offset: 288)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "yy_at_bol", scope: !82, file: !10, line: 161, baseType: !13, size: 32, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "yy_fill_buffer", scope: !82, file: !10, line: 162, baseType: !13, size: 32, offset: 352)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "yy_buffer_status", scope: !82, file: !10, line: 163, baseType: !13, size: 32, offset: 384)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_t", file: !96, line: 49, size: 128, elements: !97)
!96 = !DIFile(filename: "xmlif.l", directory: "/Users/hakjoooh/Documents/llir/pa2020/test")
!97 = !{!98, !99, !100}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "matched", scope: !95, file: !96, line: 50, baseType: !13, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "suppressed", scope: !95, file: !96, line: 51, baseType: !13, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !95, file: !96, line: 52, baseType: !94, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "yy_state_type", file: !10, line: 275, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yy_trans_info", file: !10, line: 296, size: 32, elements: !105)
!105 = !{!106, !108}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "yy_verify", scope: !104, file: !10, line: 297, baseType: !107, size: 16)
!107 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "yy_nxt", scope: !104, file: !10, line: 298, baseType: !107, size: 16, offset: 16)
!109 = !{!0, !110, !112, !114, !116, !118, !120, !122, !124, !126, !129, !131, !133, !135, !137, !139, !141, !146, !151, !153, !155}
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "yyout", scope: !2, file: !10, line: 274, type: !16, isLocal: false, isDefinition: true)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "yyleng", scope: !2, file: !10, line: 101, type: !13, isLocal: false, isDefinition: true)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "yy_hold_char", scope: !2, file: !10, line: 220, type: !7, isLocal: true, isDefinition: true)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "yy_n_chars", scope: !2, file: !10, line: 222, type: !13, isLocal: true, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "yy_did_buffer_switch_on_eof", scope: !2, file: !10, line: 235, type: !13, isLocal: true, isDefinition: true)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "yytext", scope: !2, file: !10, line: 276, type: !6, isLocal: false, isDefinition: true)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "yy_last_accepting_state", scope: !2, file: !10, line: 1026, type: !101, isLocal: true, isDefinition: true)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "yy_last_accepting_cpos", scope: !2, file: !10, line: 1027, type: !6, isLocal: true, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "selections", scope: !2, file: !96, line: 44, type: !128, isLocal: true, isDefinition: true)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "nselections", scope: !2, file: !96, line: 45, type: !13, isLocal: true, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "ifsense", scope: !2, file: !96, line: 46, type: !13, isLocal: true, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "yy_init", scope: !2, file: !10, line: 229, type: !13, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "yy_start", scope: !2, file: !10, line: 230, type: !13, isLocal: true, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "yy_current_buffer", scope: !2, file: !10, line: 210, type: !80, isLocal: true, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "yy_c_buf_p", scope: !2, file: !10, line: 228, type: !6, isLocal: true, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "yy_start_state_list", scope: !2, file: !10, line: 1013, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 448, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 7)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "yy_transition", scope: !2, file: !10, line: 301, type: !148, isLocal: true, isDefinition: true)
